[
  {
    "title": "Data Analyst",
    "company": "CGI Group, Inc.",
    "location": "Arlington, VA 22201 \n(Bluemont area)",
    "salary": "$50,800 - $119,200 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0CmPt6JXytAhZscz-5ZOP53MMQ49Xi4hmwETo1lvmuAlZ7fNcZ2Zn_F3aUkaZRnPoqbruWeCCpg--KXk37Eak0rtHoc9jWrb7f4feiBCNMxoh2SvKnXNQAFdKEvHA2V3n2NmSum8xh5BmndKoUK0IXPB9sUhEXyOo6xCOoB2AFgIDdbEE-wrlSALKW2pGpQCZwoCX1jZmajAIq7LcDCL3r7Py25vJADyV35pbvKBr3kDz_QONijTn5iOJH8ZAcFsjQVYQBmd9nOf-aFtUruvUgpAUrTyhmIZZPfyVt8mKoTxlsQ5TgB4i-tz9mqq-robaM1mDA2Bqi-C9YABG-Ryom6F2mSw2wKVBFLk4p9qGXFm5Uzyf4OurKn-B_kjn0ikuCEj2GqeiWb4ddlOf9YV6TSKAewT2x9QWl-p0Qt5BMUFbqiqecHIvlhjn4yDNvyGo3tbTXw-g_4SIfGGU2eYte9LelD5b_dRDg7AMGiIdAdlqJ8doOKZoUxb7riGtOMd2Oh87q-sMMz471OFUN7eUgj7VL7Y_gQ0noepNSR_GDrEX4aM79NMyRjDMEWfUOhM675eHL4ypE7BZvejdL2kY7IKep3O1AmylFvZ0yaPUkUPEaQ5jjjch4wNvS-hdQG5tmH3ldKKlwwL9lHaqVx4TvU6t2ZxJ-A1uM=&xkcb=SoC56_M3sjYv-D0HpJ0CbzkdCdPP&camk=4HOcmqOLYrDRUgFLBjquYg==&p=9&fvj=0&vjs=3",
    "description": "Position Description:\nThis is an exciting full-time opportunity to work in a fast-paced environment with a team of passionate technologists. We take an innovative approach to supporting our client, working side-by-side in an agile environment using emerging technologies. As a solution builder, you will be working to support the clients mission and goals of growing an enterprise analytics platform.\nThis position is located in our Fairfax, VA office with work performed at client site in Arlington, VA.\nYour future duties and responsibilities:\nDemonstrate in-depth technical capabilities with the ability to support multiple work streams and drive assimilation of new techniques and solutions.\nApply data and technical expertise in analysis, data mining and visualization of data using Business Intelligence tools and data development platforms.\nEvaluate data quality using SQL and data analysis techniques that improve client-reporting capabilities.\nFollow technology trends in data science and inform clients how this technology will benefit the future development platform.\nParticipate in team problem solving efforts and offer ideas to solve client issues.\nUnderstand data needs and construct data pipelines for automating and accelerating data preparation.\nRequired qualifications to be successful in this role:\nAn interim Secret clearance is required to begin working onsite with our client in Arlington, VA, and a Secret clearance must be maintained throughout the project duration.\nBachelors degree or masters degree in Computer Science, Mathematics or STEM related discipline.\n2+ Years of Experience working on Analytics and Business Intelligence focused initiatives, preferably in a consulting capacity.\n1+ Years of Experience using Python, R, or other languages to build statistical models or analyze data.\n2+ Years of Experience in creating complex SQL queries and functions, data structures and strong analytical problem-solving skills.\n2+ Years Experience working with various self-service business intelligence and data visualization tools such as Tableau, Power BI, etc.\nExperience building data pipelines in Databricks and/or Synapse.\nExperience applying AI models to refined datasets.\nExperience working in an Agile based environment.\nStrong technical and troubleshooting techniques along with the ability to translate findings to stakeholders and non-technical audiences.\nDesired qualifications/non-essential skills required:\nMicrosoft certifications such as Azure, Power Platform Fundamentals, Power Apps + Power Automate, or Power BI are a plus.\nExperience with integrating Power Platform solutions with SharePoint, Dynamics 365, SQL Server, and other external systems.\nExperience with Azure Functions, PowerShell, Databricks, and REST APIs is a plus.\nCGI is required by law in some jurisdictions to include a reasonable estimate of the compensation range for this role. The determination of this range includes various factors not limited to skill set, level, experience, relevant training, and licensure and certifications. To support the ability to reward for merit-based performance, CGI typically does not hire individuals at or near the top of the range for their role. Compensation decisions are dependent on the facts and circumstances of each case. A reasonable estimate of the current range for this role in the U.S. is $50,800.00 - $119,200.00.\nCGI Federal's benefits are offered to eligible professionals on their first day of employment to include:\nCompetitive compensation\nComprehensive insurance options\nMatching contributions through the 401(k) plan and the share purchase plan\nPaid time off for vacation, holidays, and sick time\nPaid parental leave\nLearning opportunities and tuition assistance\nWellness and Well-being programs\n#CGIFederalJob\n#LI-KK4\nSkills:\nSQL\nPython\nWhat you can expect from us:\nTogether, as owners, lets turn meaningful insights into action.\n\nLife at CGI is rooted in ownership, teamwork, respect and belonging. Here, youll reach your full potential because\n\nYou are invited to be an owner from day 1 as we work together to bring our Dream to life. Thats why we call ourselves CGI Partners rather than employees. We benefit from our collective success and actively shape our companys strategy and direction.\n\nYour work creates value. Youll develop innovative solutions and build relationships with teammates and clients while accessing global capabilities to scale your ideas, embrace new opportunities, and benefit from expansive industry and technology expertise.\n\nYoull shape your career by joining a company built to grow and last. Youll be supported by leaders who care about your health and well-being and provide you with opportunities to deepen your skills and broaden your horizons.\n\nCome join our teamone of the largest IT and business consulting services firms in the world.\n\nQualified applicants will receive consideration for employment without regard to their race, ethnicity, ancestry, color, sex, religion, creed, age, national origin, citizenship status, disability, pregnancy, medical condition, military and veteran status, marital status, sexual orientation or perceived sexual orientation, gender, gender identity, and gender expression, familial status or responsibilities, reproductive health decisions, political affiliation, genetic information, height, weight, or any other legally protected status or characteristics to the extent required by applicable federal, state, and/or local laws where we do business.\n\nCGI provides reasonable accommodations to qualified individuals with disabilities. If you need an accommodation to apply for a job in the U.S., please email the CGI U.S. Employment Compliance mailbox at US_Employment_Compliance@cgi.com. You will need to reference the Position ID of the position in which you are interested. Your message will be routed to the appropriate recruiter who will assist you. Please note, this email address is only to be used for those individuals who need an accommodation to apply for a job. Emails for any other reason or those that do not include a Position ID will not be returned.\n\nWe make it easy to translate military experience and skills! Click here to be directed to our site that is dedicated to veterans and transitioning service members.\n\nAll CGI offers of employment in the U.S. are contingent upon the ability to successfully complete a background investigation. Background investigation components can vary dependent upon specific assignment and/or level of US government security clearance held. Dependent upon role and/or federal government security clearance requirements, and in accordance with applicable laws, some background investigations may include a credit check. CGI will consider for employment qualified applicants with arrests and conviction records in accordance with all local regulations and ordinances.\n\nCGI will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with CGIs legal duty to furnish information."
  },
  {
    "title": "Data Governance Foundation Senior Analyst, AVP (Hybrid)",
    "company": "Citi",
    "location": "Tampa, FL 33601",
    "salary": "$87,280 - $130,920 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0B7UYL49yWBrrOlEWIsfJu1HwdoffaEv3MPqVgUrdyA2nqMRst1XIqVLLV8fxiBaZMeiXQn8w0kpdCR1tuBxA6rvP9WWIEt4P4cix8P0kQ84hs_pzWF-SIsB7kmgHJhBJjgMABZO-dfG9OZLe1UfbI48zpMU9w0oEtoyFBrVHrw22Ehza-LnMyLs02EkqjO4wHmKrgQx_npO8FeIJa4IiQ_wzUfAdQXEeY_6xr115TqQkQruF528R95CSYJq9fx8qpjZxRTgYZQcQ5KHs8I61K6QaYrOesU339vc9OKYdyNdTnbBmaKgcKqwn4UR3fzAKDQhQJKKUaI2r6B5shFtbxqAZ-Ds-uKQhnzGDib-awRZc6IJn4F9IEu7Xe1Gsm3089QCIEggvaUN4uY0FDBNTjITTy5QfU4eL19WcStdy70esnHrig3kwH4aGxg5AqWEpKO7eAJhm7fgLrDNXqGI2yxtxl1rpWGdufsCz2_7V3AOlGGE1cNIYq9ySorWik_y7WMK4GbljCnCCfM1YWUxxkrMZWrkPzdMTWdUKeIfmWX-Fm2D-xjVf1a5YxOUZDmEwsloDYaczOeds-DFTwWxvQD4Pfdo0BqNKQ6M208dkZ_oE71VxDXiDEiXXucwOg5BPsWDiO5SkV4VH_WWEDkeahqriZvColsVFPHOd6AUUEF1r1ewDqGR0YGIyLQcWoEfspHMrsX5ejx2LkVQfP8RxM3Z94ps8Xgycmr48dWBMlrylQkXFUPUiGCJAEbgLq0plKHb16iZYaFGTdo2MlXqmEZ-stUfJm2wbCy63J1e8226FFvKzPSmEuc&xkcb=SoAe6_M3sjYv-D0HpJ0HbzkdCdPP&camk=ethIe0s0hecjsRX6tg6Ocg==&p=12&fvj=0&vjs=3",
    "description": "The Data Governance Foundation Senior Analyst is responsible for contributing to compliance of Citi Data Governance Policy with a focus on Data Concern Remediation Management (DCRM) program. The focus of this role may be on one or more of the following areas: DCRM policy adoption and compliance, controls framework performance, issue management process, regulatory/ audit response/action tracking and cross Services collaboration enabling execution for Data Managers\n\nThis role requires someone who is dynamic, flexible, and can easily respond to quickly changing needs. The candidate must have the ability to handle ambiguity and complexity and be able to deliver on multiple responsibilities. Developed communication and diplomacy skills are required in order to guide, influence and convince others\nResponsibilities:\nEstablish and drive the DCRM compliance program for Services, ensuring alignment with overall program objectives policy, procedure user guides and regulatory requirements.\nEstablish and maintain strong relationships with key execution leads and cross functional team to facilitate collaborative execution\nOrganize and lead working groups, ensuring effective collaboration, decision-making, and progress tracking.\nSynthesize complex compliance implementation status updates with concise, accurate information to the broader Data managers, Technology Operations, and senior leadership.\nAct as the primary point of contact for Services DCRM related matters, including escalations, inquiries, and coordination efforts.\nProvide hands-on execution support to DCRM program and ensure alignment across Product, Operations, Technology, and Data teams to drive integrated solutions.\nIdentify, track, and support the resolution of risks and issues specific to DCRM program execution\nFacilitate effective communication channels and advocate DCRM program needs and challenges\nQualifications:\nBachelor's/University degree\n5-8 years of relevant experience in Banking, Financial Services\nDeep subject matter expertise around Data Governance and/or Data risk, control framework and policy development\nDemonstrates consistent track record of having worked as a Program or Project Manager, or working on large, strategic cross-functional projects\nStrong business analysis competency with historic success in shaping opportunities via conceptual thinking and abstract problem-solving capabilities\nAdvanced skills with business intelligence and data visualization software: Microsoft Excel, Microsoft PowerPoint, Tableau.\nCommunicates effectively, develops and delivers multi-mode communications that convey a clear understanding of the unique needs of different audiences; able to drive consensus, and influence relationships at all levels\nCollaborates effectively by building partnerships and working well with others to meet shared objectives\nAbility to gain confidence and trust of others through honesty, integrity and authenticity\nStrong negotiation, influencing and stakeholder management skills across a variety of stakeholders at different levels\nStrong analytical and problem-solving skills, appreciation of the enterprise data vision\nExperience creating and being a champion for a positive risk culture that supports sustainable business growth through transparent engagement, a partnership approach, and a no-tolerance approach for behavior that exposes the organization to an inappropriate amount of risk\nExperience creating and executing against frameworks that improve the quality and value of data to meet regulatory commitments and enhance risk management. Experience leveraging glossary, lineage, and data quality tools to drive governance\nOptimizes work processes by balancing effective / efficient processes with a focus on continuous improvement. Demonstrates ability to balance between seeing the big picture while paying close attention to detail\nOrganizational savvy: understands systems, management processes, knows where to go for information and how to interpret them\nWorking knowledge of Data Operating Model practices, Data Governance and Data Compliance within large, financial services firms\n-\nJob Family Group:\nData Governance\n-\nJob Family:\nData Quality & Data Quality Analytics and Reporting\n-\nTime Type:\nFull time\n-\nPrimary Location:\nJacksonville Florida United States\n-\nPrimary Location Full Time Salary Range:\n$87,280.00 - $130,920.00\n\nIn addition to salary, Citi’s offerings may also include, for eligible employees, discretionary and formulaic incentive and retention awards. Citi offers competitive employee benefits, including: medical, dental & vision coverage; 401(k); life, accident, and disability insurance; and wellness programs. Citi also offers paid time off packages, including planned time off (vacation), unplanned time off (sick leave), and paid holidays. For additional information regarding Citi employee benefits, please visit citibenefits.com. Available offerings may vary by jurisdiction, job level, and date of hire.\n-\nMost Relevant Skills\nChange Management, Data Analysis, Data Governance, Data Lineage, Data Management, Data Quality, Internal Controls, Management Reporting, Program Management, Risk Management.\n-\nOther Relevant Skills\nFor complementary skills, please see above and/or contact the recruiter.\n-\nAnticipated Posting Close Date:\nOct 13, 2025\n-\nCiti is an equal opportunity employer, and qualified candidates will receive consideration without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, disability, status as a protected veteran, or any other characteristic protected by law.\n\nIf you are a person with a disability and need a reasonable accommodation to use our search tools and/or apply for a career opportunity review Accessibility at Citi.\n\nView Citi’s EEO Policy Statement and the Know Your Rights poster."
  },
  {
    "title": "Associate eCommerce Data Analyst",
    "company": "Uline",
    "location": "Pleasant Prairie, WI 53158",
    "salary": "Full-time",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0Ad3giXQyOqSjtuCazZCjThtx5L7e01X6oDYMq-RePRDXs6ieJf7-MKpiYPrwAmIsO8-L6WSgDBdc_JfeBM7tuzmd4ZU4R6sRawU61Yr7-tjKc2mJewdZsgh_0uNgQaE6QXn1JjxSisVvNzhaMz3XmWp8sNL43TXD2gc8WUWKFXN6dj9j2aQMTXwd32dm3rxjMpLVBBuA2fZUAQzvhYyCY69jCMf0XnCUVBSqmP9pQMvrifVxrk8B2HLoEz2SgFPSpqM7seZeTHrkRJy4k_3g1YZvwgQyIEWSe_FwwHuYpQz1HFl3oseTo4uy7Gx3BnHnVRSX15BdOyD8bMURBjkfou86dsNNT_ZhNrnwWClUrXJNkYhR3XSbqpaGg0lZmgHCO1IJKLHBlwgJxo7PmM0JFRYhq189Rq-Lb2cf_8U25FB1sChbHNHaUEhMPRJRXk0JJ3gZc2lpMe38BYggwcZSNuPu-se2DCazREInW8yxB7LAYD8h1zsU47vIo7YaUg9pXopd5VnZ1fzRZVu2X3WFQvBNBIR3BDiCPSj3SjWzG_muFS_63XEgg9vTMM1hxrZ_OIFodapIXmVAQ_lKzlPkZf1d7-3twg-FmA0gpbNLm9j31dujrkfRW6bnhxyHyV7_O9vgLVzTou1lJInVZ3TsjKWOOr1lCJ53cm6Vwk1A_wPcWvV7hiVWl5zzEal2Gib4nXHRQSbnXS1g==&xkcb=SoDN6_M3sjYv-D0HpJ0ObzkdCdPP&camk=xqnMBGaf-K9HPy7Q16e6zQ==&p=5&fvj=0&vjs=3",
    "description": "Associate eCommerce Data Analyst\nCorporate Headquarters\n12575 Uline Drive, Pleasant Prairie, WI 53158\nAs one of the largest e-commerce websites in the country, uline.com provides a vital service that millions of users depend on. We’re looking for an Associate Ecommerce Data Analyst where you’ll dig into the data and help identify key insights to support our growing eCommerce team.\nCareers Packed with Potential. Backed by 45+ years of success, Uline offers opportunities to grow your career with stability you can count on.\nPosition Responsibilities\nManage Uline’s eCommerce data infrastructure including digital analytics data, reporting and analytic platforms to support informed business strategy.\nUtilize Google Analytics, BigQuery, SQL and PowerBI to generate reports and visual dashboards.\nPartner with the eCommerce user experience and delivery team to define project success measures.\nCollaborate in project meetings and suggest using data insights to inform project decision-making.\nImplement events and success measures as wells as conduct A / B and multivariate testing.\nMinimum Requirements\nBachelor's degree in Marketing, Information Systems, IT or related field.\nPrior eCommerce experience preferred.\nFamiliarity with web analytics, tag management solutions, SQL, dashboard visualization and A / B Testing.\nBenefits\nComplete health insurance coverage and 401(k) with 6% employer match that starts day one!\nMultiple bonus programs.\nPaid holidays and generous paid time off.\nTuition Assistance Program that covers professional continuing education.\nEmployee Perks\nOn-site café and first-class fitness center with complimentary personal trainers.\nOver four miles of beautifully maintained walking trails.\nAbout Uline\nUline, a family-owned company, is North America’s leading distributor of shipping, industrial, and packaging materials with over 9,000 employees across 14 locations.\nUline is a drug-free workplace. All positions are on-site.\nEEO/AA Employer/Vet/Disabled\n#LI-PM1\n#CORP\n(#IN-PPINT)\nOur employees make the difference and we are committed to offering exceptional benefits and perks! Explore https://www.uline.jobs/#working-here_blankUline.jobs to learn more!"
  },
  {
    "title": "Jr. Business Data Analyst",
    "company": "WebFX",
    "location": "Harrisburg, PA 17102 \n(Midtown area)",
    "salary": "$47,000 - $50,000 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0AA3uNcJ0aeXBAdVd1dUlJvZjHaUXbbC2QUFGJChoFW7xEU327m6es5F6yuQV6WwCPMqnw8RdKnS73sn-8cGkDDQrTP1J8NhNMb4CdvTxw_4OOGEvGOfcZwa9WhZ3pehm3_hCs7B8wAv0ElgJxSBVhozMi5XpFHaEQGGHTRhanSzZC9jLw7IkVd_RjxOHRXy89NqockTk4oW62fD7OZxf6OG3zoai8dbJY2uyQBUM0FH3DJGwkQVXUhdvQXD7-aeXujFAHngzzzLNc_VdHKdt6yAjVDX1OyLvWN1k93IKqOwfrt96OPYc8DjlIzEPmogtuvr3JKSc8CJcJGzFi__cRwYZMj4AlmpGVApNqWI8SGjbf_q9vuxR5WHaycIECUvMGTJ7EOjk35BMlSgsdg7mcw52VJJS2qQ5rWE8k0Kn8EzUHpKi8Xew58yr6e0LWiivWAW7-MHV4sLt-S-CCYco9B1fSWMYdKlDZgbwD42OdbdNAtBoTm-SdmdKWP6DnWNk11u9YjsYaBB_xEGmL-4-L7IDadBU6aIytt0pqGKidw8QsBQEJHH4Zdd8ON8KH9Zr7cFQ5ga8gvuuzYrD8Ay9jC2Y_S8pMBYd9Bfvwu7Y1VPBkqyrk3ViXCTHIcbWt_rsRd327HFz4FS6lGeVvCT4RZ-kHY7Goy2ncvsiwsXe03yJ0x8E0BTKKN&xkcb=SoBD6_M3sjYv-D0HpJ0JbzkdCdPP&camk=xqnMBGaf-K9qJno1OSwSaw==&p=2&fvj=0&vjs=3",
    "description": "Hi there! We're WebFX, a full-service digital marketing agency based in the US. We've been 9x named the Best Place To Work in Pennsylvania, and we'd love to meet you! We are a fast-growing company that has doubled in size over the past 5 years, with talented team members now based around the globe (and representing 18+ different countries!). While we are growing at a rapid rate, we are committed to growing strategically and sustainably, and that starts with growing our team of the #BestCoworkers - that’s where you come in!\n\nWe're looking for people to join our mission to provide world-class digital marketing solutions to mid-size businesses around the world. We are passionate about what we do, we’re committed to driving business growth for our clients, and we’re on the hunt for people just like you, who take pride in their work and want to be part of a company that does too.\n\nYou Might Be a Great Fit For This Position if You Have…\n\nA Bachelor’s Degree\nSuccessful FXers in this role have majored in Marketing, Advertising, Business, Journalism, Communications, Information Systems, Statistics, and beyond\nGPA above 3.4\n\nA Few Related Skills and Experiences\n(This is an entry-level role, and experience in every one of these areas is not required - we will train you on what you need to know! But the following skills/experience are awesome to have, and will help get your career off to a running start):\n\nPart-time/summer job/internship experience is a must\nCustomer service experience in any industry\nAdvertising/marketing agency experience\nDigital marketing experience\nBasic HTML experience\nGoogle Analytics and/or analytical/research skills\nExcel/Google Docs skills\nCopywriting for the web\nPresentation skills\n\nAny of these Signature FXer Traits!\nYou have an interest in the web and stay up-to-date on new and developing technologies\nYou are a professional, dependable, and independent worker with a strong work ethic\nYou’re self-motivated, thrive on challenges, and enjoy getting things done\nYou have an eye for detail and dedication to high-quality work\nYou have an exceptional level of follow-through\nYou are a proactive, creative problem-solver who faces challenges with a can-do mindset\nYou possess excellent time/project management skills\nYou have solid analytical skills and a knack for making data-driven decisions\nYou work with a sense of urgency and can consistently meet deadlines\nYou are an outstanding communicator and possess strong interpersonal skills\nYou are a lifelong learner who loves to grow and stretch outside of your comfort zone, and are always looking to improve your skills\n\nIf any of these sound like you, then we want to hear from you! We are committed to growing 1% better everyday, and we believe working at WebFX could quite possibly make your life 1(00)% better - after all, you would be surrounded by the #BestCoworkersinPA!\n\nIn This Role, You’ll Get To…\n\nWork directly with a portfolio of clients as their direct point of contact at WebFX, educating them through clear communication, and helping them achieve their goals\nWork to maintain our world-class client retention rate by developing and fostering long-lasting client relationships\nAnalyze performance data (in Google Analytics and RevenueCloudFX) and prepare monthly digital marketing campaign reports\nDevelop appropriate SEO strategies and action plans/optimizations based on data\nCreate and manage PPC (think Google Ads!) campaigns and work to ensure a positive ROI for clients\n-Perform research to ensure client success - think keyword research, competitor analysis, and everything in between\nDevise the content strategy and outlines for our team of copywriters and manage the execution of web content based on client goals\nManage the ideation, planning, and execution efforts of CRO special projects and champion CRO best practices for clients\nPerform A/B, website usability, and website conversion rate testing to determine what works best for your client and provide recommendations accordingly\nInterpret web analytics, demographic data, market research, and buyer behaviors, and generate and execute strategies as they relate to findings\n'Get your hands dirty’ and get into the backend of client websites to correct errors and technical issues and implement content\n\nA Typical ‘Day in the Life’ Might Consist of:\n5% analyzing clients’ competitors and making appropriate recommendations\n5% creating reports for client campaigns\n10% working in the backend of websites/fixing technical issues/implementing content\n15% analyzing data and identifying deliverables\n25% executing on SEO and PPC strategies with regular optimization\n40% communicating with clients\n100% pursuing your own personal best while delivering real-world impact for our clients!\nNote: The Jr. Business Data Analyst is a client-facing position\n\nWhat You’ll Get From Us!\n\nOpportunities to Learn and Train With Our Team!\nOur “Bootcamp” training program will be provided for new FXers to learn, grow and develop both in and out of the office in the specific hard skills necessary to be successful in their position\nWorld-class on-the-job training from the experts (think Sr. Marketers, not the HR team) as well as opportunities for ongoing personal learning and development\nOn-site, state-of-the-art training amenities to facilitate departmental trainings, industry-related updates, and monthly Lunch-and-Learns.\n\nA Place to Grow Your Career\nWebFX grew 250%+ over the past 3 years, and we promote almost exclusively internally. Merit-based promotional opportunities are abundant for new FXers who meet or exceed position performance metrics.\n\nIn-Person Experience Alongside Our Team of Industry Experts\nThis position is based fully in-office at our riverside campus in Harrisburg, PA, with opportunities for this to evolve as Fxers advance in their career tenure.\n\nPotential promotional path for Jr. Business Data Analyst:\nDigital Marketing Specialist\nDigital Marketing Analyst\nDigital Marketing Consultant\nLead Internet Marketing Consultant\nSr. Internet Marketing Consultant\n\nCompensation\n$47,000 -$50,000 (potentially higher based on work experience)\n\nWhy Choose WebFX?\n\nWe've been named the Best Place To Work in Pennsylvania 9 times\nWe have offices in Guatemala, South Africa, St. Petersburg FL, Ft. Myers FL, Lancaster, and York, PA! AND we're continuing to grow!\n- Entry-level roles - over 90% of our openings are open to brand new college grads!\n- Flexible Schedule (start your day between 8 and 10 am - when you do your best work!)\nLove animals? Cool, so do we! That's why we have a Pet Friendly Office\nProfit Sharing\nNeed that caffeine fix? On-site cappuccino machine, Little Amps Coffee Bar (with a barista!) & Tea Bar\nLooking for a little extra workday fuel? Enjoy surprise catered breakfasts, lunches, mid-day snacks, and more!\nOn-site Yoga sessions\nOn-site Fitness Center ️‍ ️\n150% Company Match Of Personal Charity Donations\n- Our #FXBuilds program is set to positively impact 10,000 people around the world by 2024 - and every individual FXer’s work directly contributes!\nSupplemental Insurance\n100% Company Match 401K (up to 4%)\nGenerous Paid Time Off\nEmployee Wellness Program, including a free FitBit and fitness challenges\nLove to learn? You sound like an FXer! FXLearns Library with hundreds of personal and professional growth books with incentive program to boot\nHumanitarian Trips ✈️\nHealth/Vision/Dental Coverage\nNew Parent Support\nDressing up everyday not for you? We get it! Enjoy our Casual Dress Code\nHome Buyer Program\nPersonal Desk Fund\nGreen Commute Benefits\nPawternity Leave\nMerit-based promotions (we promote from within, you will move up and grow here!)\nThe opportunity to be part of a passionate, driven team where we pride ourselves on delivering high-quality work that makes a real-world impact for our clients\n\n\nWe have a multi-step interview process, where we focus on giving both our candidates, and ourselves, opportunities to get to know each other a bit better. While our process may be more thorough and perhaps longer than other interview processes that you've been a part of, our goal is to work together with our candidates to find a mutually beneficial fit, where a candidate is a great addition to the FXFamily, and WebFX is the right fit for their career goals. Interested in joining the FXFamily? You should definitely apply now!\n\nWebFX is an Equal Opportunity Employer, committed to providing and fostering an inclusive environment where all people, including women, minorities, LGBTQ+ and other underrepresented groups are supported, respected, and encouraged to excel within STEM careers. Our goal as an organization is to empower our team to achieve their personal best, bring people together, and provide equal opportunity to do so regardless of race, age, gender, sexual orientation, religion, physical ability or disability, or political affiliation. You can learn more on our website here!"
  },
  {
    "title": "Jr. Business Data Analyst",
    "company": "webfx.com",
    "location": "Harrisburg, PA",
    "salary": "Full-time",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0AA3uNcJ0aeXBAdVd1dUlJvZjHaUXbbC2QUFGJChoFW7xEU327m6es5F6yuQV6WwCMfP8AmSTkBCZSveaD3Y6wycYFObXI2dxO0SU9K1UUME_l5zQSKubTDPRzKCSflMrMGw2P9Nzrkx8x0qkYE2pxNl66gr89wrCzdCvsWIHAYisKcz5aJRgecu5md6m-W723JlEPRzpXk2V7sIafYoYOirr-8iHIcbKAMFTIOf1hKO3Dw6S97rHcaL_ztWD9A4qO4ELFPBr66N_LF7y1bf7Yi5jvYFXunW-Sox4R07ZPlLzC6PDy2KM0sGZQbAJv44xR362zBIJ25oLHbbjomu9AtzWaej7TbzLRSAMIUND-P-B-X_PSe7w60na_MOJoSWPaSNuX2jjLuEwPlxxhIVFCKn-voKLWmND_uKAsja2pgl9QnTlYxNX8YZJn9FJ0Jd-vKRY6wgL1gN4S06zZ1bWQViocQ_CUOyZxElch13-V9zZxLJ7KeMczvE6Y1VLl-QfTquvbdBsR1hHoS7WzV19PLaKJrRj93C2XfBEhjxwiISg2w-Pg1DIDUlyQeqlwoyXZnwA84q29QLWtriU8RfI1xytoBQE1fQvfupueRpE3cFEzfFPT8T40BjNyQUN7_Qp0AfBDHBgn5EURFL--5RxSxRNdB9DWmKvL9OLa2yIdXudblfxVMcbgSNx2mhhNVnoaKIoeiNK8AmnA1pxxpLYIaopaLA5vbkks=&xkcb=SoDk6_M3sjYv-D0HpJ0MbzkdCdPP&camk=xqnMBGaf-K9qJno1OSwSaw==&p=7&fvj=0&vjs=3",
    "description": "Hi there! We're WebFX, a full-service digital marketing agency based in the US. We've been 9x named the Best Place To Work in Pennsylvania, and we'd love to meet you! We are a fast-growing company that has doubled in size over the past 5 years, with talented team members now based around the globe (and representing 18+ different countries!). While we are growing at a rapid rate, we are committed to growing strategically and sustainably, and that starts with growing our team of the #BestCoworkers - that’s where you come in!\n\nWe're looking for people to join our mission to provide world-class digital marketing solutions to mid-size businesses around the world. We are passionate about what we do, we’re committed to driving business growth for our clients, and we’re on the hunt for people just like you, who take pride in their work and want to be part of a company that does too.\n\nYou Might Be a Great Fit For This Position if You Have…\n\nA Bachelor’s Degree\nSuccessful FXers in this role have majored in Marketing, Advertising, Business, Journalism, Communications, Information Systems, Statistics, and beyond\nGPA above 3.4\n\nA Few Related Skills and Experiences\n(This is an entry-level role, and experience in every one of these areas is not required - we will train you on what you need to know! But the following skills/experience are awesome to have, and will help get your career off to a running start):\n\nPart-time/summer job/internship experience is a must\nCustomer service experience in any industry\nAdvertising/marketing agency experience\nDigital marketing experience\nBasic HTML experience\nGoogle Analytics and/or analytical/research skills\nExcel/Google Docs skills\nCopywriting for the web\nPresentation skills\n\nAny of these Signature FXer Traits!\nYou have an interest in the web and stay up-to-date on new and developing technologies\nYou are a professional, dependable, and independent worker with a strong work ethic\nYou’re self-motivated, thrive on challenges, and enjoy getting things done\nYou have an eye for detail and dedication to high-quality work\nYou have an exceptional level of follow-through\nYou are a proactive, creative problem-solver who faces challenges with a can-do mindset\nYou possess excellent time/project management skills\nYou have solid analytical skills and a knack for making data-driven decisions\nYou work with a sense of urgency and can consistently meet deadlines\nYou are an outstanding communicator and possess strong interpersonal skills\nYou are a lifelong learner who loves to grow and stretch outside of your comfort zone, and are always looking to improve your skills\n\nIf any of these sound like you, then we want to hear from you! We are committed to growing 1% better everyday, and we believe working at WebFX could quite possibly make your life 1(00)% better - after all, you would be surrounded by the #BestCoworkersinPA!\n\nIn This Role, You’ll Get To…\n\nWork directly with a portfolio of clients as their direct point of contact at WebFX, educating them through clear communication, and helping them achieve their goals\nWork to maintain our world-class client retention rate by developing and fostering long-lasting client relationships\nAnalyze performance data (in Google Analytics and RevenueCloudFX) and prepare monthly digital marketing campaign reports\nDevelop appropriate SEO strategies and action plans/optimizations based on data\nCreate and manage PPC (think Google Ads!) campaigns and work to ensure a positive ROI for clients\n-Perform research to ensure client success - think keyword research, competitor analysis, and everything in between\nDevise the content strategy and outlines for our team of copywriters and manage the execution of web content based on client goals\nManage the ideation, planning, and execution efforts of CRO special projects and champion CRO best practices for clients\nPerform A/B, website usability, and website conversion rate testing to determine what works best for your client and provide recommendations accordingly\nInterpret web analytics, demographic data, market research, and buyer behaviors, and generate and execute strategies as they relate to findings\n'Get your hands dirty’ and get into the backend of client websites to correct errors and technical issues and implement content\n\nA Typical ‘Day in the Life’ Might Consist of:\n5% analyzing clients’ competitors and making appropriate recommendations\n5% creating reports for client campaigns\n10% working in the backend of websites/fixing technical issues/implementing content\n15% analyzing data and identifying deliverables\n25% executing on SEO and PPC strategies with regular optimization\n40% communicating with clients\n100% pursuing your own personal best while delivering real-world impact for our clients!\nNote: The Jr. Business Data Analyst is a client-facing position\n\nWhat You’ll Get From Us!\n\nOpportunities to Learn and Train With Our Team!\nOur “Bootcamp” training program will be provided for new FXers to learn, grow and develop both in and out of the office in the specific hard skills necessary to be successful in their position\nWorld-class on-the-job training from the experts (think Sr. Marketers, not the HR team) as well as opportunities for ongoing personal learning and development\nOn-site, state-of-the-art training amenities to facilitate departmental trainings, industry-related updates, and monthly Lunch-and-Learns.\n\nA Place to Grow Your Career\nWebFX grew 250%+ over the past 3 years, and we promote almost exclusively internally. Merit-based promotional opportunities are abundant for new FXers who meet or exceed position performance metrics.\n\nIn-Person Experience Alongside Our Team of Industry Experts\nThis position is based fully in-office at our riverside campus in Harrisburg, PA, with opportunities for this to evolve as Fxers advance in their career tenure.\n\nPotential promotional path for Jr. Business Data Analyst:\nDigital Marketing Specialist\nDigital Marketing Analyst\nDigital Marketing Consultant\nLead Internet Marketing Consultant\nSr. Internet Marketing Consultant\n\nCompensation\n$47,000 -$50,000 (potentially higher based on work experience)\n\nWhy Choose WebFX?\n\nWe've been named the Best Place To Work in Pennsylvania 9 times \\uD83C\\uDF89\nWe have offices in Guatemala, South Africa, St. Petersburg FL, Ft. Myers FL, Lancaster, and York, PA! AND we're continuing to grow! \\uD83C\\uDF31\\uD83D\\uDCC8\n- Entry-level roles - over 90% of our openings are open to brand new college grads! \\uD83C\\uDF93\n- Flexible Schedule (start your day between 8 and 10 am - when you do your best work!)\nLove animals? Cool, so do we! That's why we have a Pet Friendly Office \\uD83D\\uDC36\nProfit Sharing \\uD83D\\uDCB0\nNeed that caffeine fix? On-site cappuccino machine, Little Amps Coffee Bar (with a barista!) & Tea Bar\nLooking for a little extra workday fuel? Enjoy surprise catered breakfasts, lunches, mid-day snacks, and more!\nOn-site Yoga sessions\nOn-site Fitness Center \\uD83C\\uDFCB️‍ ️\n150% Company Match Of Personal Charity Donations\n- Our #FXBuilds program is set to positively impact 10,000 people around the world by 2024 - and every individual FXer’s work directly contributes! \\uD83C\\uDF0D\nSupplemental Insurance\n100% Company Match 401K (up to 4%) \\uD83D\\uDCB0\nGenerous Paid Time Off \\uD83C\\uDFD6\nEmployee Wellness Program, including a free FitBit and fitness challenges \\uD83D\\uDC5F\nLove to learn? You sound like an FXer! FXLearns Library with hundreds of personal and professional growth books with incentive program to boot \\uD83D\\uDCDA\nHumanitarian Trips ✈️\nHealth/Vision/Dental Coverage\nNew Parent Support \\uD83D\\uDC76\\uD83C\\uDFFF\\uD83D\\uDC76\nDressing up everyday not for you? We get it! Enjoy our Casual Dress Code\nHome Buyer Program \\uD83C\\uDFE1\nPersonal Desk Fund \\uD83D\\uDCB0\nGreen Commute Benefits\nPawternity Leave \\uD83D\\uDC31\nMerit-based promotions (we promote from within, you will move up and grow here!)\nThe opportunity to be part of a passionate, driven team where we pride ourselves on delivering high-quality work that makes a real-world impact for our clients\n\nCheck out our culture on social media:\nInstagram\nTwitter\nFacebook\n\nYou don't need to apply more than once even if you're interested in multiple positions - you can simply let us know! We consider all open roles when reviewing resumes and applications!\n\nWe have a multi-step interview process, where we focus on giving both our candidates, and ourselves, opportunities to get to know each other a bit better. While our process may be more thorough and perhaps longer than other interview processes that you've been a part of, our goal is to work together with our candidates to find a mutually beneficial fit, where a candidate is a great addition to the FXFamily, and WebFX is the right fit for their career goals. Interested in joining the FXFamily? You should definitely apply now!\n\nWebFX is an Equal Opportunity Employer, committed to providing and fostering an inclusive environment where all people, including women, minorities, LGBTQ+ and other underrepresented groups are supported, respected, and encouraged to excel within STEM careers. Our goal as an organization is to empower our team to achieve their personal best, bring people together, and provide equal opportunity to do so regardless of race, age, gender, sexual orientation, religion, physical ability or disability, or political affiliation. You can learn more on our website here!"
  },
  {
    "title": "Business Intelligence Analyst",
    "company": "ITAC Solutions",
    "location": "Birmingham, AL 35209",
    "salary": "$68,000 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0CBcAKkMzvCCr3nbIFWZL1QEvzVdjPQKoc8nhQ-JuLQpxzqVVUHoHuUUuWjWLNA8-i_wwCYoQN0za4C_o1i-WUQEd8cRVJGyJlUwUOmNHFjpkjAUBDnIlGe-rFHsFnhbJl-KLsq7smCnCBaRfHrf0oXrGUbd9gRmfIH4zKGyM3uPOKW3keiNvhTnePejyE0bKzDVo0e8956X4DjN1LriimRMzcvF-B0D5-U7ifXMh2U-vO5dzh583sH6WWjkKN8Bjz_0p_K_QH30KXo8IamazoBqig52R1G1brH3plmAYpn2dKrwHc50pWfQEApcYy3xiisjBJvmIj2FrYh5tJTnsOWZCXsXbBvbwOh_5EDsbgjyVFiqvRqU8bfGoSOEJofT8tPHnf_yaeKC9e4onUFjVZp94Ng16EQhebkdLtUB5DnZHI7GuJKYUbEaWWthObyDxn4indx4ouoZtlG9gsbAGT3VQj_AC_bPsxix9ZYTy1foRI3OcdPY8cri3APTYhSpiI_S52Mvsg0Qe6suw9RER2wqecU4EbJ07fswYZ5BFWA8dI2sSX9BxiMK1t-fZ7ZaA45HzEnkCeTG589qaFqhJhMhOSSMf2XpzZWnU4lgrGlzJI86Hx3PAup3Qg7-hfOnDhz0EuAGtsYboGjLjMM2YFQUk1wRd_vA2fGg0HzxzcArQ==&xkcb=SoAk6_M3sjYv-D0HpJ0BbzkdCdPP&camk=CaPcp5JXW8K7ou5DN24PEQ==&p=10&fvj=0&vjs=3",
    "description": "ITAC is helping a local client in their search for a Business Intelligence Analyst!\nThe main function in this role is to generate analytical reports and dashboards using proprietary products, and training customers on using front-end BI tools to access their data.\nOur ideal candidate has experience scripting SQL database queries, utilizing Power BI and is explaining technical and non-technical tools to executives.\n*C2C is not an option with this job opening and all applicants should be able to work for any US Employer without sponsorship.*\n\nCompensation: $68K\nWhat you’ll be doing (duties of this position):\nCreating reports and dashboards in Power BI, DAX Studio, and Excel\nWork closely with other departments to determine reporting and analysis requirements, project priorities, and define Key Performance Indicators (KPIs)\nTake raw data and create visualizations using Power BI\nDocument processes and contribute to reporting template repository for future use\nWork with the development team on product improvement initiatives\nWhat you’ll need to be considered (requirements):\nBachelor’s degree in computer science, software engineering, or a related field\nAbility to work in a team environment\nHave a working knowledge of using Microsoft Excel and Microsoft Power BI for report building and data analytics. (Knowledge of Tableau, Qlik, Microsoft SSRS, and other BI tools is a plus)\nAbility to prioritize assignments and shift priorities as required\nExperience and understanding of Excel, VBA, SQL and/or R preferred\n\n#INDIT"
  },
  {
    "title": "Data Analyst, Specialist (Digital Analytics)",
    "company": "Vanguard",
    "location": "Philadelphia, PA 19102 \n(Logan Square area)",
    "salary": "",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0BWQs_M7ZA8XLbIFWVw-PYcVVEPryqVLyWhKaEKPskHy2YkbHyHJDwB_nHc5A6JaMSwJ35Su6b5EnVBKVzXLUXrjwQX8bhsciNfm2CHo5_N-gigjP5ptm84IeK3x_WRdo00FRYwi-Uix35BY7zedpYZz1ZslUZtW2lFh56Gy64z2uoBJJLjjFEbk25jzzrMnlZymvGCz6UoKPaJ8KhwtcFJMLJuHXL4gnWCz43E24sxEXoRgIaiJF1kNnNvBCYhH-m_JAy_07HfOXSKLzgjFTqMQYVp2Z6QMnFF3viISQznd72v0rDXNyNm3eObQyYekNu9vlSemAULKFc5AF9b5jrcekwktVjeUcYN1tmEhpsKM2LoDQKiQk4TyDtLpvVeueSlOeXyRneSgoFE77isj14VVWmKhWTk6JSrjwtCg1zzSgFgwa0bdS_Lg2Ay2go9om9nPfYZyE5NRXtTSODopoUUjTLr5wq9YqwU7yWFOXT_R7gZHgNMB10oNyC1Tf8F0zEh5Lb_rp7Se4PtCK85QqqyEvmhSeoWessaPvkexIWqA1Z-uNLfsBnTRmKVb-JYQbioc7JALDCqQrR3EwfoEZy3XMpTM18VnKy0YbONBl6_pdMj2wOkzCA6RNTeYIDU4ctA2ySK2M604ddIAxDvh2igyDh2ZNo2ncLlQGNCSSzYwR30ygHldXrkB52a4tGMlRMFvrW6RiI9RgflM2dXQYEUnkbyCDpqXHr2kAB-IxVXfJ7lWOAIEsotzF2NiSGkh4GgoF13j3Ziq-fuES3kF9uIj_NHmzJ8U0gsp9xXzkfzc3IYK_QyXibCaw-oNBRqWfJ5EgzKglHsr80_WqOJpJ2akq2tHkcFNTwjZgeFT3uo1c5vwX55Mjzj0mododH4lge-K2-G1V1iEn4YGwZtCPfSTTX56k1CNYgjDA6-Dtgo6soKXQd96z4uCtIieoRYidxsPLEZcn6YtgvWZP6xSWr0e6bneYfnB2CVFPSBFUakz9XFDQu6FgeOQ_6OOdvy2xvsi3lSDjh7kGRuEF_aTymKt4MkSxl3qQMoB7YPbcHwPS-J5XFBD9Oykve0_vaQoT8uaK4RKCu5Pk2tISfskw_iE66eTI6bdAklNgPIDJ-zqDygwA5j8vPE2vkDSObXzTDslixUFS_QAH3PMZ7UxI3OrmxiB-x7xOIuLlJrzA4Me7IBpSL_2VKjZ8k9zfn8kAcA3q10cLyrxmySClXXNarBFaLh5Nud6I5v-Wpzv2CJQ2wgQH0mGj4IfDhw0DH_yi5hO4T1c6xIIdI2v-40ZETs4ieyWY_Fpi2FKmerAxQSWr5i9Uglc8qSGBS9NWJ1o0YJVt_9MIphvUUYcasGYDNRD1XOEF5WBDetZmcrUTJUOA==&xkcb=SoD36_M3sjYv-D0HpJ0IbzkdCdPP&camk=G42KULXkIwN4Jhi8z6A3Ow==&p=3&fvj=0&vjs=3",
    "description": "Analyzes data, assesses trends and develops actionable insights and recommendations in support of large strategic business initiatives. Actively develops the analytics community at Vanguard by coaching others internally and participating in external events.\nThe CXD Automation and Digitization, and Onboarding Analytics team surfaces insights on the biggest opportunities to reduce back office processing expenses through automation tools and digitization of paper forms. Onboarding analysts optimize the web experience for our new clients. It is a critical component of Vanguard's digital experience, and it includes functions like Open an Account, Transfer of Assets and Change of Ownership.\n\nWe are hiring a lead analyst to help lead client these client engagements!\nCore Responsibilities:\nLead engagement with internal partners to understand business strategy, questions, and goals. Bring structure to business requests, translate requirements into an analytical project approach, and complete analyses.\nAcquire and compile structured and unstructured data and verify its quality, accuracy, and reasonableness.\nPerform amd lead analyses of historical data to surface trends and insights using advanced analytical methods.\nPrepare and deliver expert visualizations and internal presentations that translate analytic insights into tangible, actionable solutions for business partners to implement.\nDevelop, own, and manage recurring analytic or reporting processes.\nMentor, coach, train, and develop senior data analysts. Proactively expand knowledge of business and analytics and shares with team members.\nShare and document best practices.\nParticipate in special projects and perform other duties as assigned.\n\nQualifications\nMinimum of seven years related data analysis/science work experience\nUndergraduate degree (advanced degree preferred)\nCoding knowledge in SQL and Python\nExperience with data storytelling through visualization\nExperience in designing and executing end to end experiments\nSpecial Factors\nSponsorship\nVanguard is not offering visa sponsorship for this position.\nAbout Vanguard\nAt Vanguard, we don't just have a mission—we're on a mission.\nTo work for the long-term financial wellbeing of our clients. To lead through product and services that transform our clients' lives. To learn and develop our skills as individuals and as a team. From Malvern to Melbourne, our mission drives us forward and inspires us to be our best.\nHow We Work\nVanguard has implemented a hybrid working model for the majority of our crew members, designed to capture the benefits of enhanced flexibility while enabling in-person learning, collaboration, and connection. We believe our mission-driven and highly collaborative culture is a critical enabler to support long-term client outcomes and enrich the employee experience."
  },
  {
    "title": "Statistical Process Control Statistical Quality Control Data Analyst",
    "company": "Matheson Tri-Gas, Inc.",
    "location": "Irving, TX 75060",
    "salary": "Full-time",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0C1ihjj1FYx73_02yGTS96r3SNeUtc-9S9zmnK0ry7bjnQ6Jf2s4KR_7BSE-wQz5x_AmhfTAiTks-yJCIbxBv1SBz7VIGd6_mv-XspP1K-_UVEJuJpq4Kxg_-a0MdlkxYre9FquJHhDQIaBnzRC7hzodZXXAL40gueIZD4qUe6MFp4szD6n8mP7rT6HgQu0rTza48-AJCB7CEh5KL7wqdMb6N1uwNLWWGL3ScnlKY7aJzjT1DaBmH62BaBZcQWXafAuRNraPkYpMZUEwpaK3RnCA7rWqpiy5NxaXoyqQfp7u824QDpy-9ix2R0gjzpcIsYt0h3DhD1tA7_duR7nG6R7LS1-qZMFJWhTthIauTMSwRYH1mGA_QuDP-f6kCUFQz8OwcTFC4P213Dcj-CPWhy1EFxabLfR1VI-TeWYyLWsvRPwunCFYDaL9Kz8x6FEp5dCHioWeAJfINs_LQ1-zjliagrEcgENnd3NLZGt6sldGSoOtkePvqYGA5e55AleeJHBLu76NGxTeyN0uR-B1WD-d56ynxP8ZJgCVWjzM08bgT7EXoFp4aaBxvxKeJW0vRxvBYhnjB1oYSUi1lfLB-FLh1_IChbjOOMnN4vfRJuz6j0sTPZAuCNHrc5KIDBqO1d3xRNYXdGWgN_4qavUEMxx_XLatzM7eCo=&xkcb=SoCq6_M3sjYv-D0HpJ0GbzkdCdPP&camk=UoKtGZLa3XLGJ1QJWibkvA==&p=13&fvj=0&vjs=3",
    "description": "Statistical Process Control/ StatisticalQuality Control Data Analyst - New Johnsonville, TN\n\nData Analyst Role\nInvolves collecting, cleaning,processing, and interpreting data to derive actionable insights that helpMatheson make informed decisions, improve performance, and solveproblems. Key responsibilities include performing statistical analysis,identifying trends, creating data visualizations, and communicating findingsthrough reports and dashboards to Operations, Sales, Product Management andSenior Management. Data analysts use tools like SQL, Excel, and NWA orMinitab statistical software, and their findings support strategic planning andoperational improvements.\n\nCore Responsibilities\nData Collection & Acquisition: Gathers data from various primary and secondary sources.\nData Cleaning & Preparation: Cleans and processes raw data to ensure accuracy, consistency, and readiness for analysis.\nData Analysis: Conducts statistical analysis and uses various methods to identify trends, patterns, and relationships within datasets.\nInsight Generation: Translates complex data into meaningful, actionable insights for business stakeholders.\nReporting & Visualization: Creates reports, charts, and dashboards to present findings to internal teams and senior stakeholders in an understandable format.\nDatabase Management: Sets up and maintains databases and data infrastructure.\nCollaboration: Works with technical and non-technical teams to understand business needs and present data-driven solutions.\n\nKey Skills & Tools\nTechnical Skills:\nProficiencyin SQL, Excel, and data visualization software (NWA, Minitab) is essential fordata manipulation and presentation.\nAnalytical Thinking:\nAbility toanalyze complex data, identify root causes, and draw meaningfulconclusions.\nStatistical Knowledge:\nUnderstandingof statistical techniques like regression analysis to interpret datapatterns.\nCommunication:\nStrongskills in communicating findings to both technical and non-technicalaudiences.\nProblem-Solving:\nApplying data analysis to solve specific businesschallenges and identify new opportunities.\n\nPurpose of the Role\nThe primary goal of a data analyst is toconvert raw data into understandable information and insights and effectivelycommunicate it to the stake holders. This enables businesses to:\nUnderstand customer behavior and market trends.\nImprove business processes and operational efficiency.\nCommunicate factual evidence rather than assumptions so that strategic decision can be made.\nIdentify areas for growth or areas that require improvement.\nAt Matheson, we're proud to stand at the forefront of theBig Data revolution. Using the latest analytics tools and processes, we're ableto maximize our offerings and deliver unparalleled service and support. To helpcarry us even further, we're searching for an experienced data analyst to joinour team. The ideal candidate will be highly skilled in all aspects of dataanalytics, including mining, generation, and visualization. Additionally, thisperson should be committed to transforming data into readable, goal-oriented reportsthat drive innovation and growth.\nObjectives of this role\nDevelop, implement, and maintain leading-edge analytics systems, taking complicated problems and building simple frameworks\nIdentify trends and opportunities for growth through analysis of complex datasets\nEvaluate organizational methods and provide source-to-target mappings and information-model specification documents for datasets\nCreate best-practice reports based on data mining, analysis, and visualization\nEvaluate internal systems for efficiency, problems, and inaccuracies, and develop and maintain protocols for handling, processing, and cleaning data\nWork directly with managers and users to gather requirements, provide status updates, and build relationships\n\nResponsibilities\nWork closely with project managers to understand and maintain focus on their analytics needs, including critical metrics and KPIs, and deliver actionable insights to relevant decision-makers\nProactively analyze data to answer key questions for stakeholders or yourself, with an eye on what drives business performance, and investigate and communicate which areas need improvement in efficiency and productivity\nCreate and maintain rich interactive visualizations through data interpretation and analysis, with reporting components from multiple data sources\nDefine and implement data acquisition and integration logic, selecting an appropriate combination of methods and tools within the defined technology stack to ensure optimal scalability and performance of the solution\nDevelop and maintain databases by acquiring data from primary and secondary sources, and build scripts that will make our data evaluation process more flexible or scalable across datasets\nPerforms other duties as assigned\n\nRequired skills and qualifications\nThree or more years of experience mining data as a data analyst\nProven analytics skills, including mining, evaluation, and visualization\nTechnical writing experience in relevant areas, including queries, reports, and presentations\nStrong SQL or Excel skills, with aptitude for learning other analytics tools\n\nPreferred skills and qualifications\nBachelor's degree (or equivalent) in mathematics, computer science, economics, or statistics\nExperience with database and model design and segmentation techniques\nStrong programming experience with frameworks, including XML, JavaScript, and ETL\nPractical experience in statistical analysis through the use of statistical packages, including Excel, NWA, and Minitab\nProven success in a collaborative, team-oriented environment\n\nMatheson is an Equal Opportunity Employer that complies with the laws and regulations set forth under EEOC. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or protected veteran status. EOE AA M/F/VET/Disability."
  },
  {
    "title": "Finance Data Analyst",
    "company": "Stream Companies",
    "location": "West Chester, PA 19380",
    "salary": "",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0BB3MIGOJzplkVM3QDc4n7oxN_EY_0hTf-mixy_elqDvqdgRsLuJh9N_0KPWMxW4vHpw3T1sL6X6ukiPecOhOudxdxcEd8pG057NxKbU7oNN7E9plk-r1C0mAkf0nOIDpTHJnbJW16eFgb8-Qs0OwDxScxb4Ftygeuk2gZIkbPW_kxfX1LkdIN8DQCiuzMdne9lExbwLlNRMsRVAVZTbDrUa0MxLZauKDfAmD8G5oYOlZ61FSJFOKK8mfBe_ebOxe9p1R10_1kzc3q-QuKAEdfFC5NwTvYoJqrnqRcP4x_2ixrRZSAfv2CaICGuV5f6bFw3HxUqoBJqZcRYkisk48Up28W7Z09ucE-x67qE2jP76ARtEBqBU8IjRc_WKRvlUP9vA7LmDUmZ1LRGFky7UwDQtDjhpACFO_o5uFSn5lrk-7iNfm1yLUrak0fFzeRiyZj8h-RwbSVNHmtJvDZfDSp9keucCPO0op84fVZcyiT6AFOhDrUNzO54FRBfAN_f6xN4b4AT-UGQ_xNGvLUtOW8Xum_Tk0hlC1pxUx-SErKP3XzyLujc7-d1vODx4UTIM5tYh3hN76kehP5ayRgcRh9M2zZbWTmabc5zkLH77vz-xRCreaoRfqzvrJiCNvKcvu_nF4Axs6E-fnjS5cDfOV0ulvzvLx7L71ThpdFS8F8zGpaJrpQSVmfXZJR5IgneaOvZ9W3t0fCpHiO57akcC0wLddiV2Cyeem4shI0EUjQ8I7FLQUlQC_VgmVizYWDU1YIlPk1j6a4ScA==&xkcb=SoBq6_M3sjYv-D0HpJ0LbzkdCdPP&camk=ethIe0s0heew7sW8BkhJTQ==&p=0&fvj=0&vjs=3",
    "description": "About Us\n\nStream Companies is an award-winning automotive integrated advertising and digital marketing company. Since 1996, we’ve been helping thousands of clients succeed with innovative, data-driven strategies. Our finance team plays a critical role in supporting the business by providing accurate financial insights, reporting, and analysis that enable smarter decision-making.\n\nPosition Summary\n\nWe are seeking a motivated Finance Data Analyst with 1–3 years of experience to join our Finance team. The analyst will focus on financial reporting, data analysis, and supporting budgeting and forecasting initiatives. This role is ideal for someone early in their career who is detail-oriented, analytical, and eager to grow within corporate finance. The Finance Data Analyst will partner with accounting, FP&A, and business leaders to ensure reliable financial insights are delivered across the organization.\n\nKey Responsibilities:\nFinancial Reporting & Analysis\nPrepare recurring financial and KPI reports, ensuring accuracy and timeliness.\nAssist with monthly variance analysis, highlighting trends and key business drivers.\nSupport development of dashboards and reporting tools (Excel, Tableau, or similar) for finance leadership.\nBudgeting & Forecasting Support\nAssist in maintaining financial models for annual budgets and rolling forecasts.\nGather and validate data inputs from cross-functional teams (Sales, Operations, Marketing).\nProvide supporting analysis for revenue, expenses, and headcount planning.\nData & Systems\nExtract, clean, and analyze data from finance systems (NetSuite, Salesforce, Tableau, Vena).\nHelp improve efficiency in reporting through automation and process documentation.\nSupport reconciliations and data checks in coordination with the accounting team.\n\nBusiness Partnership\nCollaborate with finance and business leaders to answer ad hoc data questions.\nTranslate financial and operational data into insights that guide business decisions.\nProvide analytical support for finance-led initiatives such as profitability analysis, ROI evaluations, and expense tracking.\nQualifications\nBachelor’s degree in Finance, Accounting, Economics, Data Analytics, Statistics or related field.\n1–3 years of experience in finance, FP&A, or data analysis (internships and co-op experience considered).\nStrong Excel skills (pivot tables, power query, lookups, data visualization).\nExposure to financial systems (NetSuite, Vena, Adaptive Insights, or similar) preferred.\nExperience with BI tools (Tableau, Power BI, or similar) a plus.\nStrong analytical skills with attention to detail and accuracy.\nEffective communicator, able to explain financial results to both finance and non-finance stakeholders.\nHighly organized and adaptable in a fast-paced environment."
  },
  {
    "title": "Data Analytics Specialist",
    "company": "Central Illinois Radiological Associates, Ltd.",
    "location": "East Peoria, IL 61611",
    "salary": "$65,000 - $94,000 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0DqL-D8NxoHr2oOuZI3SonMwaxXGr9RXKu1YTH2RvLZ9n9UKLmWJ3M5B2PYDQiopfIgHVrufBgxGwXa3c3B6CUtB_ufrcWVLZTI1ZTbxMkCUeBXRCuq_vwNcdb-7QTmGWRlcSbijIjGOZ7tI1PVi2XNAFO0izrxjDMAPzQlREisd5kwQJjbrqMhZNEI0v9HtwzEEF6Jh8WSigmQtsIEmSuStPe4D7bjN_JAs2MCNge4j1aNGWRB2uwSZDqyVPW3dTEUfcPz2xrBkoHYFfcnQ7HgKwoML_K83PiJkh398ILEpol4Sh8vORB78Epa5d-6pW8YWpZoTrRcB3vWWcMz0FqSeO2HxS72nB_5eN1EdNf6zInotePuyf6PKoi_xqvnE2HDD_pvQM6BVh009eLWEenRGg1ASAygxZ0ACqna0IIpI-Qa198S2YxLjXLBNcG4ojivN_-hqgbKY3pHPEwxbq96e7uFSBWH1b1nHMXmcjL4Q4fy7acOaznkU8qLpAH0Pb0r-8r2pmU8CYn-czp_h-kR0zBPphcYQV7FMwok0SQwByTByWHJa0KqXiI0807pFRnB3LXP6Sh2xvNIH9bOBBan0IZevk8i5s_TuqDoY-YQlWkOGqD3qSsO7QYAWJtKHXIFfBu5NBkk32VSpBo-KKqS9NUS8hp7UQE=&xkcb=SoDe6_M3sjYv-D0HpJ0KbzkdCdPP&camk=UoKtGZLa3XIgxLBuvUB74A==&p=1&fvj=0&vjs=3",
    "description": "Central Illinois Radiological Associates (CIRA) is a private radiology practice with 100+ physicians providing radiology specialty services to ambulatory facilities, clinics and hospitals throughout Illinois. We are currently recruiting a full time Data Analytics Specialist to join our team.\nDuties & Responsibilities Include:\nCollaborates with the team to understand the data needs within CIRA to enforce data integrity to help drive decision making and improve organizational performance.\nParticipates in the design, build, testing, implementation, and maintenance of the architecture and technical specifications for clinical informatics within CIRA.\nAssesses the accuracy of new data sources and effectiveness of data ETL procedures.\nAnalyzes and interprets data to develop database models specific to clinical and revenue cycle data sets.\nDevelops, implements and maintains CIRA's informatics engine.\nAssists in the creation of policies and procedures for data acquisition.\nDevelops dashboards, reports and presentations as needed.\nQualifications:\nBachelor's degree in computer science, information systems, mathematics, data science or related field; minimum of one year related experience or equivalent combination of education and experience.\nPrevious experience working in healthcare a plus.\nExperience in data management and normalization.\nExperience in SQL.\nFunctional understanding of data lifecycle and clinical workflow as it relates to normalization, data analytics and clinical applications, clinical data standards including HL7 and DICOM and revenue cycle management and data sets.\nExperience in general purpose and data processing programming languages such as C++, Java, Python and R.\nGood interpersonal, communication and customer service skills to effectively interact with internal and external customers through written or verbal form.\nDetail oriented and ability to multitask ensuring tasks are completed in a timely manner.\nAdaptable to changing criteria and situations in a flexible manner.\nMaintains strict confidentiality.\nJob Type: Full-time\nPay: $65,000.00 - $94,000.00 per year\nBenefits:\n401(k)\nDental insurance\nEmployee assistance program\nHealth insurance\nHealth savings account\nLife insurance\nPaid time off\nVision insurance\nAbility to Relocate:\nEast Peoria, IL 61611: Relocate before starting work (Required)\nWork Location: In person"
  },
  {
    "title": "Data Analyst",
    "company": "PangeaTwo",
    "location": "Birmingham, AL 35243",
    "salary": "$60,000 - $75,000 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0DNW2r_g_L4iYlqGxiHKsZQ9YGI4uo45ioTMb5HFAR8n6iDGHO1VjmvlIPbblnpE7aDaxXhKqAPS5cyCdfgDnR_LThtKf82wslkENW8b7MdkRXrB44ybAcLH52wzObR23TAvX69MLatak5CDOP_dwRtlS7n4ThZ2Dy4LvDX0wi_JDLZafYU9LsCKId8K3Lsq2jkrkMc0XBbFwVJRyMEmempSly03kF66i7Uz9CKy4zVce2ENzJOsYBuRYzeYpHzSS_caURU3YP5NUEBwJUgyzHNwkjm0P6OJkx9SMXrSJ6XNda0nWOXI1quRnIMbAQT-ulbyeaS4sA90MQCpdCmpdirdaZmfcK9zDmvjjCvuRU_-aEySPFonbCTJwnJECyGC34WWTpdBh_h8dGii68Ite1EfcKz60-xefo1zdQ9IC9tOYZ3sYpCoNUAl6XySZsuZzAP_NGp9giIz6ME0p6C7aDUP2K33gcXyEq1_LMI4uqc5oT7_TLznnaI0M_w0MMClm-QsNWOArl6B7nw2EeJ-W03zaYMBDH5JPfvOT8Jue0Af-cIs0ttU9gO-zyZFfXvbmYRa3Zov6LB6Bt-gabylKcqEU9C7BCCq71OnxBvD5JaOxDGF8yCebKqHOnKAoRMjndsYlabtUN19IHD9Z8mn_sC&xkcb=SoB56_M3sjYv-D0HpJ0PbzkdCdPP&camk=NFVmwABINBKdjrNu29s2UQ==&p=4&fvj=0&vjs=3",
    "description": "Data Analyst - Hybrid\n$60,000 - $75,000\nBirmingham, AL\nOur client is seeking a Data Analyst to join their team. This position plays a key role in ensuring the accuracy, consistency, and integrity of product data across the organization. The ideal candidate will be highly analytical, detail-oriented, and able to communicate effectively with both internal stakeholders and external partners.\nKey Responsibilities\nCreate, input, review, approve, and distribute product master data using established tools and workflows.\nPartner with vendors and third parties to collect and update product information.\nSupport business processes, product launches, and integration activities by managing data requests.\nEnhance data quality through cleansing, auditing, and implementing best practices.\nProvide input into the design of PIM data templates and process workflows.\nAct as a data steward, collaborating with teams to align business needs with accurate product data.\nIdentify opportunities to improve efficiency, automation, and data quality.\nPartner cross-functionally to deliver data outputs and troubleshoot any issues.\nContribute to continuous improvement projects and other duties as assigned.\nQualifications\nBachelor’s degree in business, operations, marketing, or a related field (or equivalent experience).\n0–2 years of related experience in data analysis, operations, or product information management.\nProficiency in Microsoft Office Suite (Excel, Word, PowerPoint, Outlook).\nStrong analytical and problem-solving skills, with a drive for process improvement.\nExcellent written and verbal communication skills.\nKnowledge of workflow methodologies (Lean Six Sigma, Kanban, etc.) preferred.\nExperience with PIM platforms (Stibo, Salsify, inRiver, Oracle, etc.) a plus.\nFamiliarity with business intelligence tools (Power BI, Tableau, Qlik, etc.) strongly preferred.\nPositive, collaborative attitude with the ability to thrive in a team environment.\n\nAt our clients’ request, only individuals with required experience will be considered.\n\nPlease note - if you have recently submitted your resume to a PangeaTwo posting, your qualifications will be considered for other open opportunities.\n\nYour resume will never be submitted to a client without your prior knowledge and consent to do so.\n\nIND123"
  },
  {
    "title": "Marketing Data Analyst - Portsmouth, NH",
    "company": "Service Credit Union",
    "location": "Portsmouth, NH 03801",
    "salary": "$70,000 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0Com6a9ojxt1oRlmgL2Shl1-WKh044MUkO0Pz1RmdWqfjYPpJ-9Q2Ea6Ng6-kZlSS3UfE8INoN-_sJtq9GmnkxM1ZXpGWfUV4CwVL1PQ-YFEjXBhtNsJuV1g3r5oYSj1hhQZAkFABbgSvDSCR0AXTbm-4O_QXWkY4Gp9jlfnHRJ-2HCDImxf0hhG-UN__4OCC7RRXxOxPuOrlnbC92Rhlhm3uR3JriPxIaaxG64Q0cJpR6xLw2SOvCl8lO2MWQsldH8R4CIrZ4th6nZSPe__iyRWiupHnkZM_1l9NQyqwWMEc_l3Nm5SSXf-Rn9w2_emQU6JRqq1zVDyLYVrTlFtiusSUxvtozmfVd10SpWNZhgjv-KTYaNMle6osXzgP7tDED-tsoY98SXTSC-2Qo9ZC6Q-zVKXTFQ4cPeiV9Fa43c6Kndwyxa02qVRN3-kQQY2XKVxeXruUPOE6uMBGqAR_MGGKM4pyo9dDKYYsdFjN2NBudsvizSDfcz14kN2jvWOBBbiLa1bscHRgnN8cxi8k5inPHf48rQrc9lwYzo9DkAYf_L8H-8WJC6ZTrXk2Hs7hXRe84_K1lzdxv6Jq10kipq4Tc_I_4auccRQ-8svm3zO-GCW_lOjzN4yKGUJshTxapEeIm0D-3XHahPWNu-Iqbv8TUMKbnE4wr2KBKZG_qI8Uz0PDmRalK8GcIONHS0-Wf1l-Lrhv7FnA==&xkcb=SoBQ6_M3sjYv-D0HpJ0NbzkdCdPP&camk=4HOcmqOLYrAh_uORGN1ebA==&p=6&fvj=0&vjs=3",
    "description": "Are you passionate about data and love turning insights into action? We’re looking for a Marketing Data Analyst who’s ready to dig into performance metrics, member behavior, and market trends to help shape smarter, more impactful marketing strategies.\nAt Service CU we believe data tells a story — and we’re looking for someone who can help us listen.\nPay: $70,000. Flexible based on experience.\nHours: Full time, Monday – Friday, 8:30 – 5:00\nWork location: Portsmouth, NH\nBenefits Include:\nGreat health and dental benefits starting day one!\nGreat health and dental benefits starting day one!\nPTO, long-term disability, and paid holidays.\n401k with 8% company contribution after one year of employment.\nPaid leave policy after 12 consecutive months of employment.\nFree confidential mental health support program with Talkspace\nFree identify theft protection through IdentityForce\nTuition reimbursement.\nTraining and career growth opportunities.\nThe Day to Day:\nMarketing Insights & Strategy\nAnalyze marketing data to understand campaign performance and member engagement.\nAnalyze marketing channel performance to optimize growth strategies across key channels, such as email, SMS, display, OTT, etc., and identify new opportunities via data-driven recommendations.\nAssist in campaign experimentation and analyses to measure revenue impact of marketing efforts and inform future spend.\nWork with Product and Digital teams to plan, design, and run channel tests to support the successful launch of marketing initiatives\nResearch market and competitor trends to uncover new opportunities and avenues for growth.\nReporting & Visualization\nBuild dashboards and reports that make insights easy to understand and provide up to date tracking and status reporting.\nPresent data clearly to stakeholders using effective visualization tools.\nContinuously improve reporting processes and tools.\nSegmentation & Personalization\nCreate targeted member segments for more personalized, relevant marketing.\nLeverage knowledge of human psychology and consumer behavior to enhance targeting and personalization efforts.\nIdentify opportunities for cross-selling, upselling, and product recommendations.\nMine prospect and member databases, identifying groups and subgroups to enable more-targeted, more-personalized approaches to messaging—e.g. content, offers, products, etc.\nCollaboration & Campaign Support\nWork closely with the marketing, product, and digital teams to plan and execute campaigns.\nPrepare member lists and collaborate with the Data Analytics department and third-party vendors as needed.\nProvide recommendations to leadership to adjust strategies and improve ROI.\nInnovation & Growth\nStay current on marketing analytics trends, tools, and technologies.\nIdentify gaps in data collection and recommend ways to enhance our infrastructure.\nBring new ideas to the table to drive growth and efficiency.\nExperience and Qualifications:\nBachelor’s degree preferred.\nMinimum three years’ experience in a related field.\nStrong problem solving and analytical skills.\nExtensive knowledge of marketing technologies such as Salesforce Marketing Cloud and Segmint.\nExtensive knowledge of Reporting Platforms such as Tableau\nFamiliarity with database reporting and design including SQL retrievals.\nDemonstrate outstanding analytical skills and ability to produce detailed reports for senior management.\nProven market analysis or equivalent skills.\nAbility to work independently and in a team environment.\nExcellent interpersonal, presentation and organizational skills.\nAbility to communicate clearly and effectively verbally and in writing.\nProficient with Excel, Microsoft Outlook, Word, Power point, and various web-based applications required.\nIf you are interested in applying your research and analytical skills to further your career and you enjoy working in a collaborative, fun environment where success is rewarded, Service Credit Union is the place!\nJoin us today.\nEqual Opportunity Employer\nJob Type: Full-time\nBenefits:\n401(k)\nDental insurance\nEmployee assistance program\nHealth insurance\nPaid time off\nTuition reimbursement\nVision insurance\nWork Location: Hybrid remote in Portsmouth, NH 03801"
  },
  {
    "title": "Sr. Data Analyst",
    "company": "Virginia Farm Bureau",
    "location": "Hybrid work in Goochland, VA 23063",
    "salary": "Full-time",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0D4X_QRYS2BmufYYgXxedQUM0t4X2MaWEFYSxZvJIaPTz0zvHo323MLJqYBDneR31NJnN3BeHpJSRSLF2BRavTZXcpeb6hx3Lp-sM2f5vDUOl59u21m1xx1kR2ohB8ZtbrC8-FDZt41UjG8wQfRNviSStQhL71F8ktkTmLW0Kc9rIYeOQfNAB5iXR1Pt5_8Rn_jjGSKDRMAJ5JlP7o7i3RvaZyaEFfRaxfFlblJqaqH5AYf0h4GPQEiwa1VOVcDbmt2sRw4TuQs91Mg0iIVMK-YNOrj_n6ECwSeW8YQV4obDdGzEf1eEKAidPEyfQvnzx40SWvTTHYZtBN3o5fHeDCYLfUVYE6mu2hy07v4-wZeyljy-QfVA0UKsbLL4vo9-wLdT2DJEMDTPVqWL-okEiNoEXo6YcU09GgVd9StsgbWza8uNts_e8LMmSiyXtaOL0vgUqoZiM6i0D6F3wkTFBHbF6oebUH_DvUNCDgLKZGYGFJ8mL38gJutyEMMUihvdT3rERjLPNe8a0JD0-meyhkwu9KNrVbfraQ-DEp3NBIg7BNhJ82wke74cR_gx3Z4aQUNhUGhrKDpe7haLMW_bt7gkiqSE4M1jI46ul4vRMRIKW937lojEW1EbVUmDbb4tm4WDT8R-gAb90s0GKpFj7FNOTWHE1hqgE7mTVop0Fz3mLrsxvCU3_ZaZhU0QxvF6FIhCFmZTIOJI3DhOXnNiRaRFMl_Wi6rgHIcThPvnx3zDL9ZCvUHLVcxQ8YTNWkYFWXcqrEan9uPJoVtvF7i-GCVxB8XT-9U_9KqyaDf2aphy95j3rECEAj-Xw8zZg9pbTkzkUL9nuHMnO_cuwbZX88krex5_4dIDBGQwPF9VpOsR-ozqtnc5aSj9MJ_wRAWA540f_YaBB2KulJwWdXYXzpIwsS1v80ViNjpHihNnYrm3U9IztdKl9px8FKEqSHt_Ew=&xkcb=SoAN6_M3sjYv-D0HpJ0DbzkdCdPP&camk=nUmJqO2E8rhK2m1gcBLLHw==&p=8&fvj=0&vjs=3",
    "description": "POSITION SUMMARY:\nPosition will provide technical expertise to acquire, investigate, manipulate and analyze data in support of Virginia Farm Bureau’s insurance operations. Candidates will research marketplace competitors, develop data-driven strategies, and prepare monthly/quarterly/annual reports\nThis position is based out of our beautiful West Creek Office location, 12580 West Creek Pkwy, Richmond, VA 23238.\nOffice hours: Monday-Friday 8:00am - 4:30pm, hybrid work schedule is offered\nPRIMARY DUTIES\nMonitor marketplace and competitor class plans using a wide range of data sources and report key findings to management on a regular basis\nPrepare data calls for regulators and other parties\nPrepare monthly reports as directed by management\nUse geodemographic data to prepare growth and profitability strategies\nCollaborate with actuarial and IS teams\nImplement internal data process improvement: automating manual processes, optimizing data delivery, redesign/restructure templates for improved accuracy\nOther duties as assigned by the department manager and/or director\nQUALIFICATIONS\nBachelor’s degree (computer science, math, statistics, finance, or similar preferred)\nFive years of insurance industry experience in analytics, data, or similar role\nAbility to articulate ideas in both technical and business friendly language\nExperience in SQL programming\nProficient in MS Word, Excel, and Outlook\nExcellent analytical, problem-solving, and decision-making skills; verbal and written communication skills; interpersonal and negotiation skills\nProven ability to interpret and use statistical data to recommend product improvements\nStrong mathematical skills\nExcellent oral and written communication skills\nExcellent organizational skills\nExhibits high level of initiative and creativity\nAt VA Farm Bureau, we provide an exceptional benefits package, including ongoing job development and support in all roles, paid training and continuing education reimbursement, medical and dental insurance available on your first day, generous employee 401K contribution, excellent Paid Time off (PTO) plan and more!\nVirginia Farm Bureau Companies provide equal employment opportunity in all aspects of employment without regard to race, color, national origin, religion, gender, pregnancy, age, disability, orientation or veteran status.\nVAFB supports compliance with COVID-19 protocols."
  },
  {
    "title": "Sr. Transportation Data Analyst",
    "company": "Novolex",
    "location": "Hybrid work in Lake Forest, IL",
    "salary": "$95,000 - $110,000 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0DXYS0b1cz0iXt9UONGVVSS5xGu93ivi0Jdd53qigW_PEl3HYhw8rpERkZDzIQrsjNBGuSEFJfX_PLuaTpRAV11F1zfnwtTMDqOL83JbhistZDiwLbDxV8dUVXidKLmXLz28MuOI6X0mKrUJ2if7wixZb5_OtlgDJzyG_3amKN8aZZaD4eXtW0cqQRXVXIq9Qcsc5eBo3KmSe9aB2qYXvwmz8c53FhwcetRNp4FzMQYXOHeEezI0UM2brai9qFuMG-C5BS_aYVpm5nCoZ1ZRuEV3pAR7deIdISp4gbokFhA1-vq835GJi4x9yiUKntyz2AgAOTg7cVe2iplsue6ccdEwelx8pHwqvNx8SBd3F1Egy2Qk_FdzpwzRtUswaQ21LEzcQ7w8ktrmmd0A_lOsCYytsJX8HKcKHoehjB--ItJ7n9HziLXJjXc3yVN_ZCEypIHqqPQ7Gw1DHuFGoD385lQicZZklaAvyTLWqNU3eVdIfKJdmwbgln7j-Kqgt0DaM0aXK2nL5HqPVDNgDCHSgJeuJxzYmmlQGXNbrN11p4jPnQVunb1CkMU25YqktLySTph9fCLDQ4GIDGy91xMN1NmzCtTeuYWhotePj-olnz0xTRQsue55XxXAEHY2xqbKXBHRfhuqIlmdVPN0W0fEtnayZdlujDjdUGgNppR3gxByYkKnosN7tw3cwL8t4HHe9n6Ra3o0WWQibaXGh_V93MysiBxZ7-QEoTd1yr2_LLhPh8b1OEfYvvFWP1LRPas-Tzld3M_iUz_kq6SSGihLhV5hq1QgjKygarRYXuKCEopR6NTJABOnv0iBXRIsgX9MWg=&xkcb=SoCQ6_M3sjYv-D0HpJ0AbzkdCdPP&camk=4HOcmqOLYrB-d2RSJGP8Zg==&p=11&fvj=0&vjs=3",
    "description": "Why Choose Us?\n\nNovolex® is a leader in packaging innovation, choice and sustainability. We manufacture products in paper, plastic and sustainable materials for the food, retail, health and industrial markets.\n$95,000 - 110,000 base salary * + annual bonus\nThis is hybrid position with 2 days remote.\nMedical, dental and vision options\nWellness rewards to fund your HRA or HSA\nPaid holidays, time off, parental and other leaves\nFinancial protection benefits such as life, AD&D and disability insurance, and 401(k) Plan with employer matching contributions\nEducation Support (for example, tuition reimbursement, Chairman’s Scholarship, 529 College Savings Plan)\nBroad Based Employee Award Program—value sharing plan for all employees with one year of service\nEmployee Assistance Program and much more!\nThe range provided is based on cost of living/geography and what we believe is reasonable in the market at the time of posting. This role may be eligible for annual bonus and annual merit increase, as well as long term compensation. Some roles may also be eligible for overtime pay, in accordance with federal and state requirements. Actual base salary pay will be based on a number of factors, including skills, competencies, experience, and other job-related factors.\n\nOur Sustainability Commitment\n\nThe Novolex sustainability vision is built upon three pillars: our products, our operations and our people. Each is critically important to our growth and future as a business. These pillars form the foundation of our company-wide commitment to sustainability, helping us achieve our ambitious goals through our wide-ranging initiatives.\n\nHow You'll Perform the Role\n\nThe Senior Transportation Data Analyst will be a key member of the Transportation Reporting and Analytics team, supporting both operational and financial reporting needs. This role requires collaboration, flexibility, and the ability to back up other team members as needed. Key responsibilities include:\nDeliver financial and operational KPI reporting and analytics to the Transportation Procurement and Operations teams.\nDevelop and maintain dashboards and ad hoc reports using Tableau/Power BI.\nPerform data extraction, transformation and loading (ETL) processes to ensure seamless integration and data integrity across systems such as SAP, HANA, and TMS.\nAutomate recurring reports (daily, weekly, monthly, annual) for various organizational levels.\nContinuously improve reporting tools, processes, and outputs to support decision-making.\nSupport budgeting, forecasting, and monthly financial performance reviews.\nMonitor carrier performance and track KPIs against targets, providing root cause analysis for underperformance.\nDesign and enhance reports and dashboards to meet evolving business needs and metrics.\nUse SQL to extract data and support reporting from multiple sources.\nProvide timely, accurate data and insights to support Transportation Operations.\nProactively seek out new technologies and tools to enhance the transportation analytics ecosystem.\nContribute to the exploration, development, and potential support of a centralized data lake to improve data accessibility and scalability across the organization.\n\nWhat We Need From You\n\nEducation:\nBA/BS degree in Supply Chain, Data Science, or Finance. Direct experience in the subject field may be considered in lieu of this requirement at Management’s discretion.\nExperience:\n3-5+ years of progressive experience with Supply Chain or Data/Analytics, preferably in a dynamic consumer packaged goods environment.\nKnowledge/Skills/Abilities:\nProficient in Microsoft Office Suite, with advanced Excel skills including array formulas and pivot tables.\nSkilled in data visualization tools such as Tableau and Power BI.\nProficient in SQL and Excel VBA. Familiar with Alteryx and Python.\nExperience with SAP; familiarity with SAP HANA, Snowflake and Microsoft Fabric is a plus.\nStrong analytical and organizational skills with exceptional attention to detail.\nProven ability to work with large, complex data sets to identify trends, develop metrics, and communicate findings clearly.\nEffective verbal and written communication skills, with the ability to influence across all levels of the organization.\nSelf-directed and able to manage multiple priorities in a fast-paced, deadline-driven environment.\nCollaborative team player with experience supporting cross-functional teams including sales, customer service, logistics, and warehousing.\nBackground in project management and problem-solving methodologies, including root cause analysis.\nFlexible and responsive to time-sensitive issues and shifting priorities.\n\nWhat You'll Get From Us\n\nBenefits\nWith safety as our top priority and a commitment to employee well-being an important focus, we offer comprehensive and competitive benefits that include medical, dental and vision insurance (including Telehealth options) as well as a variety of other well-being resources focused on mental, physical and financial health. Specific benefits and well-being programs may vary depending on where you work.\nCommunity Engagement\nAt Novolex, giving back to the local communities that support us is important. Our Focused Giving Program prioritizes support for organizations whose missions promote sustainability initiatives or address food and hunger needs. We also encourage facility level support of activities in the communities where our employees live and work.\nTraining and Development\nWe offer constant opportunities for advancement. From skills development to advanced education programs, training and development programs and courses are available through Novolex University. Programs include company and industry training curricula, support for formal education through the Tuition Reimbursement Program, and a Learning Management System that supports and enhances employee skills at all levels of the organization.\n#LI-IE1\n\nJob Reference: US05481"
  },
  {
    "title": "Data Quality Analyst – Croatian Language Specialist",
    "company": "Experis",
    "location": "Redmond, WA 98052",
    "salary": "$27 an hour",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0AEFElgJvH0khGA9zFQnp2BxzQ0kZOw7TdbpWENTeb18Hk82MYBYUAFzJZtrl5sxJ4qWHLzmiA0lHsF6ouVitV3zcCGGHD_xe0XZM51euWHbpbrjDUnnBd5ta6S1oEaRIJxOvNK88KYuSgaPZXXqL6zeisUpUUKkDUhwnpub0BQ14TcsYIi1dPJP0-YwYL1v3eIxvYjHQ1v0sp3RoLU48vZb-z6FZ9xNJdkS2c_sbxgTkuQEL_zSTAAZuFNPUfwjN__EouSUSbglcT_VYtHBK_aGhMdG9BALm6l_bniPq9sxYABs6IuAUe1nga6R5ko_ZwTgOxVcdMIU2p8Fog07OVWdbZD7Sae5X275FladkMkIe1b6ERHksL9Jwei3decVUdCIwJYbC1OgQzYw40jwbvtSdTW1J88yW4NypITkhhDx-iQZGlr_VO5o5TpkdtOhhO5GOn_UfLkutCt3MPfh8sWf7mh6rcYyjldtPx0yVn5USIg3JGj8zrI0iAZSSxewFtULpOMp6DmJDN0VTntMpXwl8jTj5a8VBNKrrR8pbO4ZejzgbMp887raVwWvIRMfAeAR2GD6es5Ow4yCp6S-hqpBVxnnSWc92RKwm6NkXTTHq8YRVMxpUWhIcENT_qVC8NYnETzEPUnY2lvDlVBuYpkwMqk-WsVAmw=&xkcb=SoA36_M3sjYv-D0HpJ0FbzkdCdPP&camk=ethIe0s0hedrw3pKnW6CKA==&p=14&fvj=0&vjs=3",
    "description": "We’re looking for a detail-oriented, self-motivated native Croatian speaker to join our Data Quality Analytics team. In this role, you’ll help improve the quality of data that powers global products by reviewing, labeling, and analyzing content in Croatian. You’ll collaborate with cross-functional teams and play a key part in enhancing user experiences worldwide.\nData Quality Analyst – Croatian Language Specialist\n6-Month Contract\nHybrid – Redmond, WA or Burlingame, CA\n(Mon/Fri Remote, Tues/Wed/Thurs Onsite)\n8:30 AM – 5 PM PST\n$27/hour\n\n\nWhat's the Job?\nAuthor and refine guidelines for Croatian-language data collection and quality assurance audits.\nConduct internal research studies involving Croatian-speaking participants, including sourcing, guiding through procedures, and collecting data while maintaining confidentiality.\nPerform weekly quality assurance audits of Croatian-language data collected by internal and external teams.\nCompose weekly reports highlighting trends and issues specific to Croatian-language data.\nProvide ongoing feedback to collection teams to ensure high-quality Croatian data and monitor program performance to identify best practices for data quality improvement.\nWhat's Needed?\nFluency in Croatian (spoken and written) is required.\nSelf-motivated with the ability to manage workload independently.\nExcellent interpersonal and communication skills.\nStrong analytical, research, and problem-solving abilities.\nProficiency in spreadsheet software (Google Sheets/Excel), including formula writing.\nWhat's in it for me?\nOpportunity to work on innovative AR/VR projects and contribute to cutting-edge avatar technologies.\nCollaborate with cross-functional teams in a dynamic environment.\nGain experience in data quality assurance and language-specific data management.\nWork in a hybrid setting with a flexible onsite schedule.\nBe part of a forward-thinking organization committed to diversity and inclusion.\n\nUpon completion of waiting period consultants are eligible for:\nMedical/Dental/Vision plans\nHealth Savings Account\nHealth Flexible Spending Account\nDependent Care Flexible Spending Account\n401(k), Plus Match\nPTO\nWeekly Pay\n\nIf this is a role that interests you and you'd like to learn more, click apply now and a recruiter will be in touch with you to discuss this great opportunity. We look forward to speaking with you!\nAbout ManpowerGroup, Parent Company of: Manpower, Experis, Talent Solutions, and Jefferson Wells\nManpowerGroup® (NYSE: MAN), the leading global workforce solutions company, helps organizations transform in a fast-changing world of work by sourcing, assessing, developing, and managing the talent that enables them to win. We develop innovative solutions for hundreds of thousands of organizations every year, providing them with skilled talent while finding meaningful, sustainable employment for millions of people across a wide range of industries and skills. Our expert family of brands – Manpower, Experis, Talent Solutions, and Jefferson Wells – creates substantial value for candidates and clients across more than 75 countries and territories and has done so for over 70 years. We are recognized consistently for our diversity - as a best place to work for Women, Inclusion, Equality and Disability and in 2023 ManpowerGroup was named one of the World's Most Ethical Companies for the 14th year - all confirming our position as the brand of choice for in-demand talent."
  },
  {
    "title": "",
    "company": "",
    "location": "",
    "salary": "",
    "url": "https://www.indeed.com/viewjob?jk=123456789abcdef0",
    "description": "None"
  },
  {
    "title": "Lead Data Analyst, Specialist",
    "company": "Vanguard",
    "location": "Dallas, TX 75244",
    "salary": "",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0BWQs_M7ZA8XLbIFWVw-PYcVVEPryqVLyWhKaEKPskHy2YkbHyHJDwB_nHc5A6JaMTwWURZI9AW_tvtisl-anVnJqvzvKGLk0ZY47VULPmCXOfqIMP89VijTxq0pwZu-Q4LFuVaZr-BV_ikcu94LxwbgDGt7CeXOtWb7XM0IpQ78R9lGYbwbUFadC13RH-faFcU7fk_dOaWFZ-5J3QN81h8RnqKBHtMW3dU4jbiC7Ue8uS3R8blOVzTu0qzEJdGNO39M1Q3oSB3D3s7LWHyN5geWMThi8dhwaByBKE_fKoo8O68yJKeLTITh3JwvgYEY2ChxDS_1FNLRk26bbFLXnbS1aefasyv7AHAwllL8gpjk_kR9jR9GHewvAHZBAzguhjvKHNjRAIp8k1F4dYzUcd59UaIuNEVUBs58h_zHNIU-LQZ57hiRWBucRT5zLQBDXAmj2aY_TM14GqeL7I_DYdKpuzA7RRMIpRfw0Ahje75qldugvy9NDRpNRuhX3TXArnduu0Ri-cPNNgekDqGf0CMB-id1F0tRohcMVxkVRcebmhFFW5yaBaud7A_QSY22J-wty-lNM5ZrF6zezNm6eleBEZrc5DT2YReizJ5JOTL1bEAHaOBxm06Yg7yeSkyg_YLpRrNYNtI1MI6kPcOrxoGrxqfrso7O7WLonkI1nCj2V3mAP92T5SNI_S5COAvluF5lSwQP2sz8tOEN3NuqzDjVU4fj5yDQ6Kvg9FEnofqhIMovJWQLTaStF1a-dj_r8rDEJ9wG1DDi5S1pCjuQS4EgUBSoAB7Bk_ZRDPzkbYlccfssD9i_oNsWwppssqfMX7OKiUpSBLMcGoDMizcEM61eYTThBowl0bU650sXql_wZMTWj9wCky2Evw3qVWl-2tpcfNwtAdyk18_vCAVOfItNqMQoCwXV-eFg1rrcumxVWnoqVeu7ChMR4pHfCpmOsi7MsNHz1g6kCba46wGtMFGlueUQdgeYzdi9BDi1D0DT2-Lf_hDJ27gZW0sK5Ea_wvSJZSRAZD3U50mRX3XGDhV7GXG8xDeHN1ew3qk81oDigFPlr2B4OSK6P1GXaYxGeU8b8j_tW1wScc95LSzYllmwNaPorbk3gcJSNvmW_PJgfz1X4jNKwWDAoxCihe67J-U_eUcve2XAVuStuLUip9n_3rz2u2a4GbXSyFJcfo7WHecFvzRTvSqYqvpSyfa0-z6e096JzH7otYJADDz5Wa2x0RFqCUhFGt1XhApIduoKnvDqV7XeYmc565fvp7XlLgEc65gImBUjJTeLTKNuzwVwcjQ3l-_4knzoG_A6cyxhQ==&xkcb=SoDr6_M3sjYmMjUHpJ0FbzkdCdPP&camk=G42KULXkIwN4Jhi8z6A3Ow==&p=13&fvj=0&vjs=3",
    "description": "This Lead Data Analyst will support Vanguard's Global Risk and Security division to help make informed risk decision through data!\nGlobal Risk and Security (GR&S) at Vanguard enables business strategy, protects client and Vanguard interests (e.g., assets and data), and stewards a strong risk culture. Our teams leverage enterprise-wide insights, deep expertise, and trusted advice so that across Vanguard leaders and crew drive faster, stronger, risk-informed decisions.\nThe vision of the Enterprise Resilience Office is to enable Vanguard to stay open and serve our clients in any scenario, no matter what happens in the physical, digital, financial, and extended enterprise worlds, through operational resiliency planning, independent points of view on preparedness, and being the catalyst for continuous improvement. The ERO is critical to maintaining Vanguard’s essential business services, determining what scenarios are most likely to disrupt the delivery of those services, and ensuring that we are prepared to respond.\nEnterprise Resilience Office (ERO) has the following three primary focus areas.\nBusiness Continuity: Overseeing crisis management and incident response.\nTechnology Risk Management: Offering risk advisory support to IT and Improving Vanguard’s ability to recover from a cyberattack.\nThird Party Risk Management: Stewarding the third-party risk lifecycle and reducing extended enterprise risk.\nERO has the vision for integrated reporting across these primary focus areas.\nThe Lead Data Analyst, Specialist is vital to accomplish the mission and the vision of our ERO. The Lead Data Analyst, Specialist analyzes data, assesses trends and develops actionable insights and recommendations in support of large strategic business initiatives. Actively develops the analytics community at Vanguard by coaching others internally and participating in external events.\nCore Responsibilities\nEngages with internal partners to understand business strategy, questions, and goals. Brings structure to business requests, gathers & defines the requirements, translates requirements into an analytical project approach, and leads complex projects through completion. Delegates tasks and provides tactical and strategic guidance to peers. Serves as the analytics expert on cross-functional teams for large strategic initiatives.\nDefine, engage, and involve in developing Data Strategy Vision, Mission, and Roadmap for the Data Analytics team.\nShould have a holistic understanding of data warehousing and involve in BI and Data architecture discussion and consultation.\nDefining the project’s schedule and scope with timely and regular value deliveries, organizing & leading projects, and project status meetings.\nDriving and delivering Agile projects that offer outstanding business value to the users.\nAcquires and compiles structured and unstructured data and verifies its quality, accuracy, and reasonableness.\nMust turn the raw data into information and insight, which will be used to make business decisions.\nPerforms analysis of historical data to surface trends and insights using advanced analytical methods. Validates analytical techniques employed by other analysts.\nPrepares and delivers expert level visualizations and internal presentations that translate analytic insights into tangible, actionable solutions for business partners to implement.\nDevelops, owns, and manages recurring analytic or reporting processes.\nActively develops the analytics community at Vanguard by mentoring, coaching, and connecting others with resources and training. Participates and presents during scheduled analytics seminars.\nParticipates in special projects and performs other duties as assigned.\n\nQualifications\nMinimum of ten years of related work experience.\nUndergraduate degree or equivalent combination of training and experience. Graduate degree preferred.\nPython and Advanced SQL coding\nExpert level proficiency with Tableau, along with Tableau certification is required.\nData engineering skills and knowledge are required.\nRobotic Process Automation skills are preferred.\nFamiliarity with Figma is preferred.\nExcellent written and oral communication.\nMust be familiar with business analysis frameworks and methods such as BABOK, Agile, or Scrum.\nNice to have:\nNice to have Risk domain knowledge.\nNice to have AWS cloud experience.\nSpecial Factors\nSponsorship\nVanguard is offering visa sponsorship for this position.\nAbout Vanguard\nAt Vanguard, we don't just have a mission—we're on a mission.\nTo work for the long-term financial wellbeing of our clients. To lead through product and services that transform our clients' lives. To learn and develop our skills as individuals and as a team. From Malvern to Melbourne, our mission drives us forward and inspires us to be our best.\nHow We Work\nVanguard has implemented a hybrid working model for the majority of our crew members, designed to capture the benefits of enhanced flexibility while enabling in-person learning, collaboration, and connection. We believe our mission-driven and highly collaborative culture is a critical enabler to support long-term client outcomes and enrich the employee experience."
  },
  {
    "title": "Lead Data Analyst (Marketing)",
    "company": "Vanguard",
    "location": "Malvern, PA",
    "salary": "",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0BWQs_M7ZA8XLbIFWVw-PYcVVEPryqVLyWhKaEKPskHy2YkbHyHJDwB_nHc5A6JaMQfBNqB37d1u_HS05juPZP3cC1pMKre05IeQ3YDRYTxfxUCG9PL9kLxEKkUQgrrjH6UbY5ipNFc-3ZFK8fgoMR2Ni_WOiPyYu9b7CdDjFiE8HSq5GQ-TKxvI9BbxjrNmSLDXsXnKQxhGW17-XxnBBiQ0nZc7f-zDLKqlF2jquF6E5aaOWskkf_U7g_dCVStjRn2KikwnkrCzE54oltZsj4Waojj0plRQ4bSv9EE-tq_dxz6quMQKjmAUQ9xhqpCpq57pHt-pDn4Nd1AU0q6nS_OU1sikbqFgSWy_LifYbfMsg1jRlfsgNJc9qWfLujAhEt8WqRcg3vCwPqfVlFmOORaSo88tfGGz74jtVxnBkz-0qAMgJA7KtM9iT9skFySzDpoBe_zgBrEqrFtBHPuD8qy1MeCbEJN5gj0SxBU7eF5jw3oQUN1AeWv0wPwmxJvdOs9J9p8BtRYkydYoVM6KLKbtsJ7_OZ1zNOuVNA70ZijIVsZDkuuzqs1hYQcNRCegeaAEIcDQrDDU0loZ47oHsqdK6Miw0mRaFHlhIeAxTdyCuEHH0yWtdk7oK7hzUW311jKw6JDdgQyCOdMBAiMiEuSR1dli6wv50crK27jyGNGDDMq6NwPZCHybi4HcVD4TmiRRPRJ_BmBAGLUKjIfVcZtsHNdrvakU5R6JeqgtTozYutijDebz2hjHjGt4tbD1291ulP1dnWwycuffELdgvPLGUGapCThn8DiVQXpANji2Kw-LEVtC37lDTVdBi2b_YVcxWHq1rfq5Vn-mFMkjm5n61OpEW5e4Vt5WBAIgpIqYuRgL2VB5Pwx49-GH7flMeGiVarWJKABYfcAJnPb7m8Jv2ZQnxR9eudUXS3QxhrcY_e99bxuZ3wEFhMW5mzfnYUuuDlMv0cAaKGUuNOIIvHmkOiaAi5m7qsF_2zIOyUrateiK4uKdgNpZ1hrMEzlQO2zDxWPajZ-bxfny2RV7_rrSbptxXyId4tm5ig7batlMpe6TMfQLe9TdDkf594LVfjdrVYFXlkrkPPnVW9XmSWZFuX_myjuNf6X-E0x1IjyTjfR-VIZX9mrhnJUcHXH_FIo_Sx-PxkeyjwW24W28eu9f3IBzFXMMIc-T5eOBaYki__VFAU3MNOhBdnt6gK-Ns2MtL8GrDp2BxantvIxTndz_ekfHNmFlJaAea0lf7yFYwyUGb7jn0zwaIBitw-uDGcLDmKgXqUwbcTFbzqizBvnubAHq4cI1GC25dJGShwjHQ==&xkcb=SoCf6_M3sjYmMjUHpJ0JbzkdCdPP&camk=G42KULXkIwN4Jhi8z6A3Ow==&p=1&fvj=0&vjs=3",
    "description": "The Self-Directed (SD) Marketing Analytics team is seeking an experienced lead analyst to join us on our analytic journey. Please reach out to Leonard Pollard to learn more!\nThe Self-Directed (SD) Marketing Analytics team is seeking an experienced lead analyst to join us on our analytic journey. We support the Personal Investor Marketing team in various business activities, including audience targeting, client journey analysis, marketing channel usage, and content creation. Our work encompasses data wrangling, reporting, dashboard development, strategy formulation, and advanced modeling. Collaboration with cross-functional teams is essential, as we partner with various analytics and marketing support teams.\nRole Responsibilities\nData Management and Analysis\nAcquire and compile structured and unstructured data, verifying its quality, accuracy, and reasonableness.\nPerform analyses of historical data to surface trends and insights using advanced analytical methods.\nValidate analytical techniques employed by other analysts.\nDevelop expertise in key subject areas (e.g., audience targeting, client journey, marketing channel usage, and marketing content).\nReporting and Visualization\nPrepare and deliver visualizations and internal presentations that translate analytic insights into tangible, actionable solutions for business partners to implement.\nDevelop, own, and manage recurring analytic or reporting processes.\nProject Management and Strategy\nEngage with internal partners to understand business strategy, questions, and goals.\nBring structure to business requests, translate requirements into an analytical project approach, and lead projects through completion.\nDelegate tasks and provide tactical and strategic guidance to peers.\nProactively identify opportunities within the business to contribute to its growth and success.\nParticipate in special projects and perform other duties as assigned.\nMentorship and Knowledge Sharing\nMentor and coach junior analysts to elevate technical and storytelling capabilities.\nFoster a culture of continuous learning and innovation in analytics tools and methods.\nProactively expand knowledge of business and analytics, share best practices, and document them.\nServe as a subject matter expert for the team and the analytic organization.\nCross-Functional Collaboration\nPartner with teams in Marketing, CXD, Engineering, and Finance to deliver integrated insights.\nParticipate in cross-divisional data projects and resolve operational challenges.\n\nQualifications\nExperience: Over seven years in analytics, data science, or business intelligence.\nEducation: Bachelor's degree in a relevant field; master’s or PhD preferred.\nTechnical Skills: Proficiency in SQL, Tableau, Python, PySpark and cloud platforms like AWS and Snowflake.\nCommunication Skills: Strong skills in communication, presentation development, and stakeholder engagement.\nData Visualization: Experience with tools like Tableau and Power BI.\nMarketing Knowledge: Strong understanding of marketing principles and strategies (e.g., A/B, multivariate, multi-armed bandit).\nSpecial Factors\nSponsorship\nVanguard is not offering visa sponsorship for this position.\nAbout Vanguard\nAt Vanguard, we don't just have a mission—we're on a mission.\nTo work for the long-term financial wellbeing of our clients. To lead through product and services that transform our clients' lives. To learn and develop our skills as individuals and as a team. From Malvern to Melbourne, our mission drives us forward and inspires us to be our best.\nHow We Work\nVanguard has implemented a hybrid working model for the majority of our crew members, designed to capture the benefits of enhanced flexibility while enabling in-person learning, collaboration, and connection. We believe our mission-driven and highly collaborative culture is a critical enabler to support long-term client outcomes and enrich the employee experience."
  },
  {
    "title": "Data Analytics Lead in Financial Crimes",
    "company": "Vanguard",
    "location": "Malvern, PA",
    "salary": "",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0BWQs_M7ZA8XLbIFWVw-PYcVVEPryqVLyWhKaEKPskHy2YkbHyHJDwB_nHc5A6JaMSjLaf0s_bT0E18o-lH_reemqDKB0rbnOIld-fmun4auMYBFSciXzu5D7rfdS3Ybu4ROrt5KbJHNefmZTdx_Pp6akTCjyPvJkNmJK27bhX4lFGEjiWem7w2ftAqU0hmN28S0-9twcwqGM5n0QXqvApCRx0An3VlsAqo8MHKYgPFaVFppasYBLZMGu_umJBdRxCm-sWK-B2KUbDfvAo7_cIAAzvkLqO1kMgyot1Ii0E6qkveFy2j8XabLD24NYbRCZxqPpcqKCkvXNy-9pWWsjwVI_fF6CbrpxqQJPzRxBSnDInQjSRirA6sNmlSubfNTPX3oTAsIybNMRhFhXkvZfrK6_9SHrAdn0vRsbkHGjb-tajByjWv2OqZByNRH0UavS2umuzwsCTfpqvreqPmD3w75mcQwItADZ1GhQrNNrAGWhx88n8cgd5RIATMBpGwpFDCO6es91xAGED27eC7KVTyeEMHm21gyfDrimZWMUboRSuGsNAN9LiXrkx_nl52MnDogFbRgFkDB--HlcfwHNGSKv5ta9E0bT9tw5e3IxSnNBjgov3SQdgfy8O7R4mPsh9dsvkVdsd1JpVgba3TvMNpEC0EJjneRpci8M_sKgSTnMjXVS9fu2qKIwW6uCuVWYa2GxOKpqcp4y-Vw3LeuA-U3bDeYrbr8iQNlL_0YTvAn2kqXU0h0HanBFnD9YQ7993GEF-vo0slRNpMXVrFXXtsVxvPSRp1146kBKTJth_Ut2q_xRtc6f8SQw2viEJst6Rl5xT4z25ZatKAa06KJVD5-ZzweHOew59JKjU2xX5GTQBWJWAHr1ItvKNNy3VzyXHtiVKKhBYkWeP9GxTQIlYSgcuQmp4R1LoeWElONdIHPgk2VyA5BHfsJwmnOshiciU7avLO12CjaubAor7_humJBHk2kr4UCZfpvsQuVkye0ZEkbJOCauiYLBFE9if2vEIAAdrKa2XChQCBLwLbggUx5dvlwJKLG5U8gkxfu2t7tZ_6odU8W7v45Lf2iyjQoYmCNWfhAYQcGNCGPnVXEMXFogSrg5WAonqEA18jSgWMUx4o-E8a8VN_GrjAQ2jcf6ZLcJYHfcSry1EP-FRkNuFo1Lulg87XKO59IC7CrC_4HxwlRAPKHObV4lLX3C2Hf_pCBGsiqicWxMxG0FQym4fSIdlMS_FbxqF0mSDafQqR752JMmgAUkX6zmqXmUoGSo7zfPILJ2IdzijQBVUCFdQBRBv35QD45wM8LJl4uYRtYZlRv-e3jBeLQkLA6F3MQLIQSLN4wkzR4ot6O8WUfexO&xkcb=SoAr6_M3sjYmMjUHpJ0IbzkdCdPP&camk=G42KULXkIwN4Jhi8z6A3Ow==&p=2&fvj=0&vjs=3",
    "description": "Analyzes data, assesses trends and develops actionable insights and recommendations in support of large strategic business initiatives. Actively develops the analytics community at Vanguard by coaching others internally and participating in external events.\nWe are seeking a strategic analytics leader to join our Financial Crimes and Code team, responsible for developing analytical strategies to identify risk and crime trends. This role transforms complex data from the OGC 360 Data Lake into compelling stories and actionable insights that support financial crime prevention, enhance risk detection, and deliver measurable business value.\nThe role requires a blend of advanced analytical skills, strategic thinking, and leadership capabilities. The ideal candidate should possess expertise in advanced analytics, experimentation, proficiency in generating actionable insights, and experience with data visualization tools to create impactful reports and dashboards. Strong communication skills are essential for effectively interacting with senior stakeholders and conveying complex data insights in a clear and concise manner. Additionally, the ability to prioritize projects and maximize value delivery is crucial. Key responsibilities include designing executive-level dashboards, delivering advanced analytics, and fostering a data-driven culture through strong stakeholder engagement and data governance.\nAs a Data Analytics Lead in Financial Crimes, you will\nDrive strategic initiatives that enhance analytical capabilities to detect and mitigate financial crime and risk\nOptimize data-driven solutions for financial crime prevention and risk intelligence,\nStrengthen analytics infrastructure to support financial crime detection and risk management.\nElevate the strategic use of analytics in combating financial crimes and assessing risk exposure.\nRefine and scale analytical frameworks for financial crime insights and risk evaluation.\nDrive innovation in analytics to uncover financial crime patterns and emerging risk trends.\nModernize analytics platforms using AI tools to improve financial crime surveillance and risk forecasting.\nDeploy targeted analytics to support proactive financial crime intervention and risk controls.\nTransform raw data into actionable intelligence for financial crime and risk operations.\nIntegrate advanced analytics into financial crime strategy and enterprise risk oversight.\nKey Responsibilities\nDevelop and implement analytical strategies to identify financial crime patterns and risk trends.\nAnalyze large datasets from Data Lake to uncover insights and support decision-making.\nCreate compelling data stories to communicate findings to stakeholders and leadership.\nDesign and deliver executive-level dashboards and reporting frameworks.\nCollaborate with cross-functional teams to align analytics with business goals.\nUtilize Bloomberg and Morningstar for industry insights and benchmarking.\nFoster a data-driven culture through relationship management and stakeholder engagement.\nEnsure data quality, governance, and compliance across all analytics initiatives.\nSolve complex and ambiguous problems with innovative analytical approaches.\nQualifications\nProven experience in data analytic. Experience in financial crime analysis is highly desired.\nStrong relationship management and stakeholder engagement skills.\nAbility to solve big and ambiguous problems using data-driven strategies.\nExperience with Bloomberg and Morningstar for industry insights.\nExcellent communication and storytelling skills.\nStrong ability to influence and collaborate with senior stakeholders to drive strategic initiatives and achieve business objectives.\nStrong understanding of marketing mix modeling techniques, including multivariate regression and time-series analysis.\nAbility to analyze large datasets from various channels to understand the impact of different financial crimes activities and other key performance indicators.\nProven track record in developing and maintaining advanced statistical models to estimate the effectiveness of marketing tactics and predict future performance.\nExperience with tools and technologies such as Tableau, Power BI, Python, SQL, Redshift, AWS.\nSpecial Factors\nSponsorship\nVanguard is not offering visa sponsorship for this position.\nAbout Vanguard\nAt Vanguard, we don't just have a mission—we're on a mission.\nTo work for the long-term financial wellbeing of our clients. To lead through product and services that transform our clients' lives. To learn and develop our skills as individuals and as a team. From Malvern to Melbourne, our mission drives us forward and inspires us to be our best.\nHow We Work\nVanguard has implemented a hybrid working model for the majority of our crew members, designed to capture the benefits of enhanced flexibility while enabling in-person learning, collaboration, and connection. We believe our mission-driven and highly collaborative culture is a critical enabler to support long-term client outcomes and enrich the employee experience."
  },
  {
    "title": "Revenue Data Analyst",
    "company": "Intermex Wire Transfer",
    "location": "Miami, FL 33156",
    "salary": "",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0BiYnqdC2BUhASMq2TXhmMyl1nzeP1S87dqQPMgfNpTx8CyZ7-pL8_ouxLySYGKBckQf0OF7VVHgnq2NMAubf2Gsfeby3-lz2P3BvtKAdWhdqWWjbqCosUqCA-YvJHLapqmiU9VfPj_6SyW93jHI6EmooFvWqa7eA4ocQIWzxk0rxjKHAcA5IuBrrlbcmzpXouDPTNlhosCSnIvFzY106Xn7hJAJrD1jZ7p99fNx1Yucw5qWVMR2Lc0Ks8qlpWiPdGHUCmSRM1fBLcg5EsgDDZzAYoZHtw-ylfW_A8zHetEuF8TdAKR4jg6NPQlLBr19ecYJthE07167cRYrcAcUoN1fQnp-cYTmcLN8Iybgheh6UZRr6ChSb0oK8eij3GwCgMFXz39AUwvbsKFlF_KJMngLg3FqhLC3iyD5K4S5MWLtB4yswX0rstVH21vmi-KUJjjcqEgb098BMte18ZAOWla49vIxuupA45y8gwlz6PXpN7v_8gGqJhyypdMsAYL6exi30hEZ3GJUF9QUtKMX00iezIK5OKKLUTGoZE880Fs8_XbG4oYhHeqBEtQoKo7zV9fO0TlqxcKikc7tOvC19L0R1vcXdV--aSfVj7g-Cpvmg==&xkcb=SoA46_M3sjYmMjUHpJ0MbzkdCdPP&camk=nUmJqO2E8ri6pbRH7mVuxA==&p=6&fvj=0&vjs=3",
    "description": "About Us\nIntermex Wire Transfer is a dynamic, fast-paced, and innovative fintech specializing in remittances and financial products for underrepresented consumers. Since 1994, we have been a leader in the money transfer industry, connecting thousands of people with their families and communities. With a trusted network of retail locations and convenient online transfer options, we ensure our customers' money arrives exactly where and when they need it. At Intermex, we help consumers save while caring for what matters most.\nSales Data Analyst\nThe Sales Data Analyst is responsible for providing data-driven insights to drive sales strategy and performance at Intermex. This role is critical in helping the sales team optimize revenue opportunities by analyzing sales data, identifying trends, and recommending actionable improvements. The ideal candidate will have strong analytical skills and a passion for driving business growth through data.\nYou Will\nAnalyze sales data to identify trends and patterns around pricing, transaction growth, and market penetration levels that will highlight opportunities for company growth.\nWork closely with sales leadership and the COO to provide insights and recommendations for strategic decision-making.\nCreate and maintain sales execution dashboards against opportunities identified to highlight progress toward strategic milestones.\nSupport the sales team with ad hoc data requests and analysis to drive day-to-day sales operations.\nYou Have\nBachelor's degree in Business, Economics, Data Science, Statistics, or a related field.\n3+ years of experience in sales analysis, business analytics, or a similar data-focused role.\nStrong proficiency in data analysis tools such as Excel, SQL, and experience with data visualization tools like Power BI or Tableau.\nSolid understanding of sales metrics, reporting, and sales cycle analysis.\nExceptional analytical and problem-solving skills, with the ability to interpret complex data and translate it into actionable insights.\nAbility to work independently and manage multiple projects simultaneously.\nStrong communication skills, ability to present data and insights clearly to both technical and non-technical audiences. Gravitas to work with and interact regularly with C-Suite members at the cutting edge of their industry.\nPreferred Skills\nHigh level of curiosity, entrepreneurial spirit.\nAbility to work with systems and system owners to access data.\nFamiliarity with CRM software (e.g., Salesforce) and sales pipeline management.\nExperience in the fintech or financial services industry.\nBilingual in English and Spanish a plus.\n#IMXIHQ\n\nIntermex Wire Transfer LLC. is an equal opportunity employer that is committed to diversity and inclusion in the workplace. We prohibit discrimination and harassment of any kind based on race, color, sex, religion, sexual orientation, national origin, disability, genetic information, pregnancy, or any other protected characteristic as outlined by federal, state, or local laws.\nWhen accepting employment with Intermex Wire Transfer LLC., you authorize Intermex to conduct a background check as part of the hiring process. This includes a review of your criminal history, education, and employment history. You have the right to receive a copy of the background check report if you request it. This authorization is in accordance with the Fair Credit Reporting Act.\nThis policy applies to all employment practices within our organization, including hiring, recruiting, promotion, termination, layoff, recall, leave of absence, compensation, benefits, training, and apprenticeship. Intermex Wire Transfer LLC. makes hiring decisions based solely on qualifications, merit, and business needs at the time.\nCalifornia Consumer Privacy Act"
  },
  {
    "title": "Senior Data Analyst (Contract to Hire)",
    "company": "Compass Tech International",
    "location": "Marysville, OH 43041",
    "salary": "$40 - $44 an hour",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0DtRdfOEeg42v5FpkuIxPBlZN2sDRtcjekevy3__RvJX6bySfvyhZTAprXtQWEQ7m8e0qvdVm8bqKmlEdfR_3J90fi1iG-YYk-pgTPmcpWBSth1rgD7JjN-UX6Y9VxEmSzMrilkp8cBBKjpZ3lVEYoW10rn3nwfosxobLs-jNBgirWaxCdVeDJs3lREVAFCl4sGvfxF2DsQjlwne1gQGu9-x_Iue9wfdj8Ja5gN8YACP2Zc4sqeWhlqPOy7budHhtw11FTCTR-uBXUEpx0Lea924_-MFlWyZWKHYp3st6jVlRI4Pn-yFhdvg9ixzkSIdmBdWgRYMDpxbucl5VKl-MxXE-loLvF6I4JnhXTZW62ZQcoIyal0qG3ZQrSk4shEzmiLFWRb1pg0zpfz9dGSVHxe3UMnx0kFGJyb09iKLqZj4TOk6NIv6dcLB3ZcCZ3Cv4cXMkuLyfsSOkcHNYBD7NxztRutsGjuSCW0xa9I9iFpsYEbqzH-T0zVXxarEVNAhxIW82vBNRb5DNSkguUulynppf7EvcG89MGnbge2SKp-npqXV8SFMwTtY7f8i_LaAcOFySYxodNM7SXV2toQG2UgUruny8akEW3CSUyAAudVsw_lWNmSgvIaUOIm_OD1739XUU7orH4dd9pXJ9T7zTpdPMGHl96hJoVyG1-KPkMWRQ==&xkcb=SoCM6_M3sjYmMjUHpJ0NbzkdCdPP&camk=ethIe0s0hefM_EBuLLsT-Q==&p=5&fvj=0&vjs=3",
    "description": "Data Analytics & BI Sr Analyst 6 Month Contract to Hire\nGreater Columbus, OH area\nWe have a 6-month contract to direct hire Data Analyst role open with a\nPosition Summary\nMarket Information Unit’s mission is to identify and resolve field quality problems quickly to ensure customer satisfaction and maintain quality competitiveness. Our Data Engineers review multiple data sources to evaluate, summarize and draw conclusions to identify trends that lead to countermeasure activity.\nKEY ACCOUNTABILITIES\nUse engineering fundamentals to identify problems through various data sources - 30%\nLook for data trends not previously identified through deep understanding of the data - 20%\nSupport cleaning data to ensure proper classification of market problems - 15%\nTransform data using SQL, Python, etc to identify trends that lead to actionable problems and defend analysis to promote for countermeasure activity - 15%\nGenerate groupings to support identification and classification of market problems - 10%\nUtilize modelling, statistics, and trend analysis to forecast future failure rates for known problems - 10%\nComplete multiple investigations monthly through deep analysis of data related to market problems identified as exceeding quality triggers.\nFinding problems worthy of a full market investigation\nCompleting investigations and achieving consensus with MQ on next steps.\nJob Requirements\nBS in Engineering, Data analytics, Mathematics, Economics or Computer Science, with strong engineering aptitude or equivalent experience\nMinimum of 5 years in data analytics or information analysis\nStrong problem-solving skills to ensure data is correct and defend your data analysis to guarantee the responsible areas accept the results.\nStrong communication skills (written, verbal and visual) to ensure your analysis is clearly understood.\nExcellent attention to detail and proficient using query languages such as SQL.\nExperienced in Microsoft Excel (Pivot tables, VLOOKUP, etc.)\nPrioritization skills to manage workload and make sound decisions\nExperience with common data science toolkits such as R, Python & NumPy\nKnowledge of data gathering, cleaning, and transforming techniques\nBusiness intelligence (Qlikview, Qlik Sense, Power BI) programming (desired)\nApplied statistics skills such as distributions, statistical testing, regression, etc. (desired)\nAbout CTI: Compass Tech International (CTI) is dedicated to providing the highest quality Staffing, Recruiting and Managed Services to our customers nationwide, to create greater efficiencies, better results and effective communications to improve their talent access and worker effectiveness while finding solutions for workflow and process improvement.\nTalk today to your Compass Tech recruiter. If the immediate job opportunities from our 100+ active client companies is not readily apparent, CTI’s team will stick with you to find the right opportunity, or guide you to improve your process to find success. And via that, a brighter career path.\nJob Types: Full-time, Contract\nPay: $40.00 - $44.00 per hour\nBenefits:\nDental insurance\nHealth insurance\nHealth savings account\nPaid time off\nVision insurance\nExperience:\nData analytics: 5 years (Required)\nSQL: 5 years (Required)\nPython: 2 years (Preferred)\nAbility to Commute:\nMarysville, OH 43041 (Required)\nWork Location: In person"
  },
  {
    "title": "Data Quality Analyst – Bengali Language Specialist",
    "company": "Experis",
    "location": "Redmond, WA 98052",
    "salary": "$27 an hour",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0AEFElgJvH0khGA9zFQnp2BxzQ0kZOw7TdbpWENTeb18Hk82MYBYUAFzJZtrl5sxJ4qWHLzmiA0lC5AsAxDCpBw1up6oikFdPjQsbNKicZHtvgBizuorvDoWHC8l1rziUp5yuOxQH-n9J4hdrd0Vn7mNXVt9r7MZGrjiXQ2rKaC7NWMcTOD0ESi1_ORXqEGIC3PC03dpRtBZmfGSuangWj6y9E1eSgMiAMxAOezhRBEPcbwUfmL1Dv8FxYDtqTtFbq4lAqrzx7EvrrmAIZeSjgrCoIkeyzkbHdo69rklqET4yqktgD-eUI5Y4Jt96zmZtoa-ASC6umExAeobsKJFkMMCLGQ6frdKfGUsi4BBdPW4gp2N-MwGOkOvMpk1CT8eLOSunpSROIIjpERsDcqE0l6264in8RTrnq48YSkSnz3Iub4oP6sFZyoF6PPT5bRFyG1F6foZpBEFeTWPjQ21UTC122aAlBP5w68kMwzk_ApB8v-Pt4R9bEW7EV-Yl_QbbIujNMdDMSvsZiuJhu066YbjeWCnYAReTfKomntzWx0RQwr4uMc-5tibnxgCwaa2D20MHpS8tqbCqpOoZJMsIxbRQP0Yp8ewQhIZ8bkPn-cwof3-6qO0ZmxcVTplN7FoUJTPQT7MatSY59gtWyTBOPi8cpaLBju_eQ=&xkcb=SoBM6_M3sjYmMjUHpJ0AbzkdCdPP&camk=ethIe0s0hedrw3pKnW6CKA==&p=10&fvj=0&vjs=3",
    "description": "We’re looking for a detail-oriented, self-motivated native Bengali speaker to join our Data Quality Analytics team. In this role, you’ll help improve the quality of data that powers global products by reviewing, labeling, and analyzing content in Bengali. You’ll collaborate with cross-functional teams and play a key part in enhancing user experiences worldwide.\nData Quality Analyst – Bengali Language Specialist\n6-Month Contract\nHybrid – Redmond, WA or Burlingame, CA\n(Mon/Fri Remote, Tues/Wed/Thurs Onsite)\n8:30 AM – 5 PM PST\n$27/hour\n\n\nWhat's the Job?\nAuthor and refine guidelines for Bengali-language data collection and quality assurance audits.\nConduct internal research studies involving Bengali-speaking participants, including sourcing, guiding through procedures, and collecting data while maintaining confidentiality.\nPerform weekly quality assurance audits of Bengali-language data collected by internal and external teams.\nCompose weekly reports highlighting trends and issues specific to Bengali-language data.\nProvide ongoing feedback to collection teams to ensure high-quality Bengali data and monitor program performance to identify best practices for data quality improvement.\nWhat's Needed?\nFluency in Bengali (spoken and written) is required.\nSelf-motivated with the ability to manage workload independently.\nExcellent interpersonal and communication skills.\nStrong analytical, research, and problem-solving abilities.\nProficiency in spreadsheet software (Google Sheets/Excel), including formula writing.\nWhat's in it for me?\nOpportunity to work on innovative AR/VR projects and contribute to cutting-edge avatar technologies.\nCollaborate with cross-functional teams in a dynamic environment.\nGain experience in data quality assurance and language-specific data management.\nWork in a hybrid setting with a flexible onsite schedule.\nBe part of a forward-thinking organization committed to diversity and inclusion.\n\nUpon completion of waiting period consultants are eligible for:\nMedical/Dental/Vision plans\nHealth Savings Account\nHealth Flexible Spending Account\nDependent Care Flexible Spending Account\n401(k), Plus Match\nPTO\nWeekly Pay\nP.S: No third party or C2C. Candidate needs to be based in USA.\nIf this is a role that interests you and you'd like to learn more, click apply now and a recruiter will be in touch with you to discuss this great opportunity. We look forward to speaking with you!\nAbout ManpowerGroup, Parent Company of: Manpower, Experis, Talent Solutions, and Jefferson Wells\nManpowerGroup® (NYSE: MAN), the leading global workforce solutions company, helps organizations transform in a fast-changing world of work by sourcing, assessing, developing, and managing the talent that enables them to win. We develop innovative solutions for hundreds of thousands of organizations every year, providing them with skilled talent while finding meaningful, sustainable employment for millions of people across a wide range of industries and skills. Our expert family of brands – Manpower, Experis, Talent Solutions, and Jefferson Wells – creates substantial value for candidates and clients across more than 75 countries and territories and has done so for over 70 years. We are recognized consistently for our diversity - as a best place to work for Women, Inclusion, Equality and Disability and in 2023 ManpowerGroup was named one of the World's Most Ethical Companies for the 14th year - all confirming our position as the brand of choice for in-demand talent."
  },
  {
    "title": "Data Quality Analyst – Hungarian Language Specialist",
    "company": "Experis",
    "location": "Redmond, WA 98052",
    "salary": "$27 an hour",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0AEFElgJvH0khGA9zFQnp2BxzQ0kZOw7TdbpWENTeb18Hk82MYBYUAFzJZtrl5sxJ4qWHLzmiA0lPXeNolaZgTivl4lX8DitEBvz3p_53tkFo1gApaRmMnLYqsYUNvBc0a97Wqf-ldKpZELuAuhI95lcVWH-EdFwoLwiQypUKt77NDAl5k8d1qhqacbiiByn_dVryTpKpgchL3hLADOxb59Vj8Ehq2_c-dfCUludp6Yly_OV6gTN26BvSvc1cnryRVn3vJfNopS-JeJor10ubpX1V_D_c-Ae_RiHNSNcJ5uGzl5A2KM5Mh2xSXkOd_CytqFCWPrU79OxhLW-kiVMMKRMLqJRxlmIqaDFsp_FzerUKJ5PSxUszULeng1SYNBqLuAdTmD6lwn2iWKxhCklcujZeWdUrwY0BeDw7NsKmBn4SlOrqwqE0Q45BtM2HRmflxSmCfr0fg67Iq2gySvHXpKn5C1MSk4q51QIZTDLTFP__MxyCupc05kbU0TAB8T9vMv7ih4QiRKOBrU2abIlAJWtjkt_JHLVrn-XPlLusGh4lHgPwndnQoYcGGlUvkYM_JLR8KiKotGLt8_08eAXgFG6-rmDa-cyEqp7VO-plTwc8ZyB8OL8vhtDdWJSzWPCxZWjkAYRSi-pN9zBVh3wDlkWxLsQwBhisY=&xkcb=SoDC6_M3sjYmMjUHpJ0HbzkdCdPP&camk=ethIe0s0hedrw3pKnW6CKA==&p=11&fvj=0&vjs=3",
    "description": "We’re looking for a detail-oriented, self-motivated native Hungarian speaker to join our Data Quality Analytics team. In this role, you’ll help improve the quality of data that powers global products by reviewing, labeling, and analyzing content in Hungarian. You’ll collaborate with cross-functional teams and play a key part in enhancing user experiences worldwide.\nData Quality Analyst – Hungarian Language Specialist\n6-Month Contract\nHybrid – Redmond, WA or Burlingame, CA\n(Mon/Fri Remote, Tues/Wed/Thurs Onsite)\n8:30 AM – 5 PM PST\n$27/hour\n\n\nWhat's the Job?\nAuthor and refine guidelines for Hungarian-language data collection and quality assurance audits.\nConduct internal research studies involving Hungarian-speaking participants, including sourcing, guiding through procedures, and collecting data while maintaining confidentiality.\nPerform weekly quality assurance audits of Hungarian-language data collected by internal and external teams.\nCompose weekly reports highlighting trends and issues specific to Hungarian-language data.\nProvide ongoing feedback to collection teams to ensure high-quality Hungarian data and monitor program performance to identify best practices for data quality improvement.\nWhat's Needed?\nFluency in Hungarian (spoken and written) is required.\nSelf-motivated with the ability to manage workload independently.\nExcellent interpersonal and communication skills.\nStrong analytical, research, and problem-solving abilities.\nProficiency in spreadsheet software (Google Sheets/Excel), including formula writing.\nWhat's in it for me?\nOpportunity to work on innovative AR/VR projects and contribute to cutting-edge avatar technologies.\nCollaborate with cross-functional teams in a dynamic environment.\nGain experience in data quality assurance and language-specific data management.\nWork in a hybrid setting with a flexible onsite schedule.\nBe part of a forward-thinking organization committed to diversity and inclusion.\n\nUpon completion of waiting period consultants are eligible for:\nMedical/Dental/Vision plans\nHealth Savings Account\nHealth Flexible Spending Account\nDependent Care Flexible Spending Account\n401(k), Plus Match\nPTO\nWeekly Pay\n\nIf this is a role that interests you and you'd like to learn more, click apply now and a recruiter will be in touch with you to discuss this great opportunity. We look forward to speaking with you!\nAbout ManpowerGroup, Parent Company of: Manpower, Experis, Talent Solutions, and Jefferson Wells\nManpowerGroup® (NYSE: MAN), the leading global workforce solutions company, helps organizations transform in a fast-changing world of work by sourcing, assessing, developing, and managing the talent that enables them to win. We develop innovative solutions for hundreds of thousands of organizations every year, providing them with skilled talent while finding meaningful, sustainable employment for millions of people across a wide range of industries and skills. Our expert family of brands – Manpower, Experis, Talent Solutions, and Jefferson Wells – creates substantial value for candidates and clients across more than 75 countries and territories and has done so for over 70 years. We are recognized consistently for our diversity - as a best place to work for Women, Inclusion, Equality and Disability and in 2023 ManpowerGroup was named one of the World's Most Ethical Companies for the 14th year - all confirming our position as the brand of choice for in-demand talent."
  },
  {
    "title": "Clinical Research Data Analyst",
    "company": "Amphastar Pharmaceuticals Inc.",
    "location": "Rancho Cucamonga, CA 91730",
    "salary": "$25.90 - $32.90 an hour",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0AEqQrBOQyrxHzlVCFW84z_sTwXlMWWWXHFNB2VIP6KdStZUE7ftc1E6D1IqlU48BR2G2jywiakDOe0ZlkxDnkhvqQSKW-OEK7D7nBWNeXa_j4eQ2RTpN4iBfUFlQ5dIoCEsHw1bz8rScc6pXqcbJLax2yl7XC4lxRRxYaUJ_vreLhqkh4mB1PgFGJYQ2EVK_LXW5gERZd3CKYOqXVk7Wo38mxRVx2p4QXPsMiCp-gfSwkUc6C_qwkeJ-2jsUTI0W4h1kBIKQ9vdo7XHMecWU5vy7iokw0mkXLCNfqxrtAL0z3005PTek7-38sCXFjeLDYjI3jOc_t2B5esYg8Unvgx0P_GOK4pjrFjq6kVgiKYcp6aIM3_Noi6RB0DrdaSDvemf_GJZz4Mgod1uqVdoyLk-2iJ00SdcLoBf76S7hV6upc4mvSTrbYsEGs4Do8yveR18z7kHEWwdRw7qBfLzBe_-ZsdSDQcS61gNCbeefQHcSL8yNxIJ_lCA9w8d7LB8eXscsZUPP9_R0l7TZWah5XJaCE4UGmFw-hzMrPmpB05ZAqYDboTwAWPbD4yGzAzexAKEMA--q7_Qytro_QO5GHLimNW5CGxROAQDuPjgpx59i4B1XVLyINW1Mdq4R4VT5lclrTzfTUA1ibXinYajbYbQKq9FGLiycU=&xkcb=SoD46_M3sjYmMjUHpJ0BbzkdCdPP&camk=4HOcmqOLYrDwgi7Dy4a-Bg==&p=9&fvj=0&vjs=3",
    "description": "The Clinical Research Data Analyst evaluates, analyzes, organizes and maintains study data and any related documents.\nESSENTIAL DUTIES AND RESPONSIBILITIES include the following. Other duties may be assigned.\nReview clinical trial protocols for understanding of data requirements\nPrepare and plan timelines for data analysis either during or after clinical trials\nReview case report forms (CRFs) templates for data entry format.\nExecute dual entry of study data and any tasks associated with data entry\nReview and flag the study data for any out-of-normal values, out-of-window time points, questionable entries, blank entries, etc.\nHandle and maintain data queries generated during the data evaluation process\nCompare study database against CRF entries and data queries\nMaintain communication with monitoring team regarding data quality and/or questions\nAssist clinical research associates with any data related tasks\nReview the statistical analysis reports for accuracy against the study data and data queries\nPrepare submission materials for the statistical analysis report and/or clinical study report and review the statistical analysis report and/or clinical study report prior to submission\nEDUCATION AND EXPERIENCE: Bachelor's of Science (or Bachelor's of Art) in life sciences or other science related field (i.e. biology, chemistry, microbiology, engineering, etc.) or higher degree; at least one year related experience and/or training in data entry or analysis; or equivalent combination of education and experience.\nSunshine Act\nAmphastar reports payments and other transfers of value to health care providers as required by federal and state transparency laws and implementing regulations. These laws and regulations require Amphastar to provide government agencies with information such as a health care provider’s name, address, and the type of payments or other value received, generally for public disclosure. Subject to further legal review and statutory or regulatory clarification, which Amphastar intends to pursue, reimbursement of recruiting expenses for licensed physicians may constitute a reportable transfer of value under the federal transparency law commonly known as the Sunshine Act. Therefore, if you are a licensed physician who incurs recruiting expenses as a result of interviewing with Amphastar that we pay or reimburse, your name, address, and the amount of payments made currently will be reported to the government.\nEEO & Employment Eligibility\nAmphastar is committed to equal opportunity in the terms and conditions of employment for all employees and job applicants without regard to race, color, religion, sex, sexual orientation, age, gender identity or gender expression, national origin, disability, or veteran status. Amphastar also complies with all applicable national, state, and local laws governing nondiscrimination in employment as well as work authorization and employment eligibility verification requirements of the Immigration and Nationality Act and IRCA. Amphastar is an E-Verify employer.\nAmphastar is an equal opportunity employer and complies with all applicable equal employment opportunity legislation in each jurisdiction in which it operates.\nJob Type: Full-time\nPay: $25.90 - $32.90 per hour\nExpected hours: No less than 40 per week\nBenefits:\n401(k)\n401(k) matching\nAD&D insurance\nDental insurance\nDisability insurance\nHealth insurance\nHealth savings account\nLife insurance\nPaid time off\nRetirement plan\nWork Location: In person"
  },
  {
    "title": "Compliance and Data Support Analyst",
    "company": "Nebraska Public Power District",
    "location": "Columbus, NE 68602",
    "salary": "$6,288 - $11,673 a month",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0DmtQJu1Ufj9_oSoKe6P3w-hjZhjUJqMK_SkCk3PGKj9Jucl-N6hYizIm1DUrdohIZXqoeTC60DzrEYFZXz_UkG2pIkcc3W40EomyxworNvy7g9px6_zE69c3hvIfzTAwJc4JZc2JHI3s9w8y0DdL2zYKTlJ9Hm4VbSmeJmcOMkCMbEJnKNTdp85jYb-PDA1RchwexmiWituwk3bY7zqVyhCbC6Q65QgM-9SsfSH2m7MyBDugeU9Sil8X-0reW4Z3h3JDdjNFRomLoR_xBrlc19eYg8_t6p9wpyxKzIDUzDO6Fvr2sua_Y6R6DG4Sg_oSeAH61Bq3vboo2ZftZuaRODj4hjqJKeM-to7VskZd-eAiuiDvH56Obs_XM6LTU_RMQ2-JYXhLXwgC2fVpuUVQFpFhP5tUzxY8Ns51ZMVNDkV3bWvMI8A2H1DnKaV5VIW7JoMmqxrJ73pKIfYEA9l25Do2f8r1aQHBajOCaCyNwZZGu6Ci2bFZQBxH-rKS77_gZDOThwotsV-TvBbqS5WHXiVGSAYTbGb6bTDQSpGaOCrN8HEc2Up4boSeya1B3IqEguKffe12_V7no8SOLaXLX2JfE9i7AfUMLusv6QcCLkU0NPWpKsrp8kgiqHHWRbrhQ_nhBzf7fWeajkCwMoQsvG55pcAxc_mOuqdBsVsOnTulUdLwrWQhC1bAj2IqQIXKFo-q_XzBh9fV-OOa7VnfunAaJilSYT7P3AOAkm4vUTaPmlXfUj0SrIVdEzHW35oXc=&xkcb=SoDR6_M3sjYmMjUHpJ0DbzkdCdPP&camk=nUmJqO2E8rjK6UE3lXs72w==&p=7&fvj=0&vjs=3",
    "description": "Location - Columbus (preferred), Kearney, Doniphan, or York, Nebraska; This is not a remote position and will be required to report to the designated office on a daily basis.\n\nEmployment Type: Full-time\n\nPosting Date: 9/26/2025\nClosing Date: 10/26/2025\n\nAre you hard-working and eager to make a meaningful impact in the ever-emerging energy industry? Come join us!\n\nBy joining the Nebraska Public Power District team, you’re becoming part of a close-knit community that embodies the values and traditions of the state. More than generating and delivering power, we empower our employees to thrive both personally and professionally. With safety at the helm, we have created a supportive and inclusive work environment that fosters innovation and growth. Here, you’re not just an employee; you're a valued member of a family that respects and supports each other.\n\nOur power grid has been consistently ranked one of the most reliable and resilient, but our reputation for excellence extends beyond our customer service to our employee satisfaction. Many of our team members have built lifelong careers here, advancing through the ranks thanks to our robust training programs and opportunities for professional development. With us, you’ll find a place where your efforts are recognized and rewarded, where you’re making a deep impact on the communities around you, and where you can truly power a career that you can be proud of.\n\nGet to know us more here\n\nPosition Summary\n\nNPPD is seeking a detail-orientated and motivated individual to join our team with a focus on data support and compliance. This role is ideal for someone with foundational database knowledge and a strong interest in data integrity, process documentation, and regulatory compliance, particularly NERC CIP standards. The day-to-day operations will support compliance documentation, data tracking, and reporting processes that adhere to critical infrastructure protection requirements.\n\nThis will include a variety of traditional Information Technologies (IT), and Operations Technologies (OT) systems that support and protect the electrical grid. It will also include working with personnel from various groups including generation, substations, telecommunications, physical security & cybersecurity.\nEducation, Training and Experience\n\nTechnical Analyst: Bachelor's degree in Computer Science, Information Technology, or a related field (OR) Associate degree and a minimum of three (3) years technical IT experience, including specific experience as listed below (OR) High school diploma/GED and a minimum of five (5) years technical IT experience, including specific experience as listed below.\n\nSystems Analyst: Bachelor's degree in Computer Science, Information Technology, or a related field and a minimum of four (4) years technical IT experience as listed below (OR) Associate degree and a minimum of six (6) years technical IT experience including specific experience as listed below (OR) a high school diploma/GED and a minimum of eight (8) years technical IT experience including specific experience as listed below.\n\nSenior Systems Analyst: Bachelor's degree in Computer Science, Information Technology, or a related field and a minimum of eight (8) years technical IT experience as listed below (OR) Associate degree and a minimum of ten (10) years technical IT experience including specific experience as listed below (OR) a high school diploma/GED and a minimum of twelve (12) years technical IT experience including specific experience as listed below.\n\nExperience\nAbility to work independently and in cooperation with others on multiple activities with flexibility to manage competing demands and changing priorities.\nExcellent communication, interpersonal, and organization skills.\nExcellent analytical problem-solving skills.\nMust be customer-service oriented and adaptable to ongoing change.\n\nPreferred Technical Skills and Supported Products\n\nIdeal candidates will have experience with some or all of the following:\n\nProcess Support\nFollow standard operating procedures (SOPs) for data handling and compliance workflows.\nAssist in updating SOPs and training materials as needed.\n\nDatabase Maintenance\nInput, update, and maintain records in internal databases (e.g., SQL, Access, Excel-based systems).\nPerform routine data quality checks and resolve discrepancies.\n\nReporting & Documentation\nGenerate basic reports using queries or templates.\nMaintain logs, checklists, and compliance documentation.\n\nCompliance Monitoring\nAssist in tracking and documenting compliance with internal policies and external regulations.\nSupport audits by preparing reports and gathering documentation.\n\nCollaboration\nWork closely with internal staff to ensure data accuracy and regulatory alignment.\nParticipate in team meetings and contribute to continuous improvement discussions.\nMaintaining OT Cybersecurity best practices and documentation.\n\nOther Skills\nCybersecurity asset and vendor risk assessments.\nSystems administration of Windows, endpoint protection, and logging.\n\nLicenses and/or Certifications\n\nSecurity Clearance: Incumbent may be required to satisfy any existing and future District security clearance or background check requirements for access to key NPPD locations and/or supporting sensitive business applications.\n\nObtain and maintain intermediate to advanced technical certification aligned with key business system platform(s) used at the District (for example, SAP, Microsoft Certifications, and Security related best practices) as applicable.\nEssential Duties & Responsibilities\n\nTechnical Analyst:\n\nAnalyze, design, develop, configure, maintain, troubleshoot, and provide direction and support for complex systems, applications and databases in support of the District's computing environment. Provide technical architecture recommendations and apply best practices in system design, development, and testing. Collaborate with/advise/coach other ET/Corporate Security and business unit analysts to ensure understanding of business and technical work processes, tools, and best practices.\n\nEvaluate, create, document, and test complex system-related interfaces and integration.\n\nMaintains efficient and effective management of vendor contract service relationships pertaining to technical services.\n\nProvide 24/7 system support, as needed.\n\nSystems Analyst:\n\nIn addition to being proficient in all duties of the Technical Analyst, the Systems Analyst will also be responsible for the following duties:\n\nLead special task groups, trouble-shooting efforts, and integration and/or improvement project teams.\n\nLead the development and implementation of training and communications plans/materials.\n\nEssential Duties & Responsibilities\n\nSenior Systems Analyst:\n\nIn addition to being proficient in all duties of the Technical and Systems Analyst, the Senior Systems Analyst will also be responsible for the following duties:\n\nProven understanding of key NPPD business unit activities and successful application of ET/Corporate Security technical solution design, development, and responsive customer support and service.\n\nWork closely with ET/Corporate Security management to oversee and lead resolution of complex technical challenges and new business system initiatives.\n\nAccountable for other duties as assigned.\nCore Competencies\nCustomer Focus\nEmployees & Teamwork/Diversity & Inclusion\nIntegrity/Excellence\nPublic Service/Environmental Stewardship\nSafety\n\nSalary Information - Nebraska Public Power District offers a competitive starting salary with opportunities for growth. In addition to the base salary range listed below, NPPD employees may also be eligible for our Annual Incentive Program (AIP) that may supplement total compensation at a level above and beyond the stated salary range. Successful applicants will be provided more information regarding the incentive program at the time of an interview.\n\nTechnical Analyst - Pay Grade - 12 Monthly\nTypical Pay Grade Starting Salary Range: $6,288.00 - $7,860.00\n\nSystems Analyst - Pay Grade - 14 Monthly\nTypical Pay Grade Starting Salary Range: $7,979.00 - $10,173.00\n\nSenior Systems Analyst - Pay Grade - 15 Monthly\nTypical Pay Grade Starting Salary Range: $9,155.00 - $11,673.00\n\nTravel Required: Up to 25% (With no or minimal overnight stays, less than 3 per month, typically within state of Nebraska) Travel required may fluctuate by business need. This is an estimate and will be discussed further with candidates that receive an interview.\n\nNebraska Public Power District offers a competitive starting salary and an excellent benefits package including medical and dental insurance, 401K retirement plan, paid holidays, paid vacation, paid medical, training opportunities and more.\n\nIf you are an individual with a disability and would like to request a reasonable accommodation as part of the employment selection process, please contact Human Resources at Nebraska Public Power District.\n\nNebraska Public Power District is an Equal Opportunity Employer\n\nWe are an Equal Opportunity Employer who values the contributions of its diverse work force. We are only legally able to hire persons who are 1) a United States citizen or national, 2) a lawful permanent resident of the United States, or 3) an alien legally authorized to work in the United States.\nBenefits\nCustomers around the state know what to expect from NPPD — quality, reliability and performance excellence. Our values also extend to the way we take care of our employees and their families. We remain on the leading edge by providing competitive benefits that respond to the diverse lifestyles of our people in an ever-changing world.\nSalary\nNebraska Public Power District offers a competitive starting salary with opportunities for growth. In addition to the base salary listed in posting, NPPD employees may also be eligible for our Annual Incentive Program (AIP) that may supplement total compensation at a level above and beyond the stated salary range.\nRetirement Savings\nNPPD employees may participate in two retirement plan options – a 401(k) plan and a 457(b) plan. Both plans allow for pre-tax or Roth contributions. After the first six months of employment, the 401(k) plan includes a generous matching contribution from NPPD. The five-year vesting period begins on an employee’s hire date. Our retired employees are eligible for retiree healthcare benefits as well as a life benefit paid out to designated beneficiaries upon their passing.\nHealth & Wellness\nAt NPPD, we care about the health and wellness of our employees. We offer new teammates two competitive hospital / medical plan options to fit their lifestyle and family needs. We also make an annual contribution to employee Health Savings Accounts, which can be used to offset out-of-pocket expenses. Employees and their spouse are invited to participate in a variety of wellness initiatives offered throughout the year as a way to enhance their wellness, reduce health risks and promote healthy lifestyles.\nOther Benefits\nEmployees earn vacation on a schedule commensurate with their years of service. We also offer paid holidays as well as personal and family medical leave, including birth mother recovery leave and parental child bonding leave. All full-time employees receive a life insurance policy equivalent to two times the participant's annual salary at no cost to the employee. NPPD also offers dental and vision insurance as well as personal accident, accidental death and dismemberment, critical illness, hospital indemnity, long-term care, pre-paid legal/identity theft, and short-and long-term disability insurance plans. Additional benefits include college tuition reimbursement, relocation assistance and complimentary access to an Employee Assistance Program.\nApply now »"
  },
  {
    "title": "Data Quality Analyst – Gujarati Language Specialist",
    "company": "Experis",
    "location": "Redmond, WA 98052",
    "salary": "$27 an hour",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0AEFElgJvH0khGA9zFQnp2BxzQ0kZOw7TdbpWENTeb18Hk82MYBYUAFzJZtrl5sxJ4qWHLzmiA0lHvBDqY-_ZewhFFz5WbPPGSZus3ee9uHC6XnJIlU9_aYXt3mzTVaExVHZCeX6M3jXKE_-i-mVoWI3z9sjYqqJuBpsCACZ1ZEre4wvWsf0DNGiA6gymx0x3SiBE5Qg2kW4U5RWPmVxZ4zKdub4hrM3mBZeRg5i_DhfjlANbeYm3DQAmrGku9OFjd55JBK5X5m5E1-SxlAlzLmOqSP_GvZ9QKl7cA-05wAU8J04eOJLzuvyidd91l0iyBzlYpJ6TJ4a_-C0RqOX17pmwoV0wPcZ1pN_37rvRttpvdhRYF7A0kfla3I00osNcJYrWb21UmW5scgiGi3y1STxncMMEa74iVKoVLvKbrOxziZU-Kk7xSHmU-nGv2aHDypYWuVQYZmTyvywkgIm9n7eXUN9WaknViwuptnQQmmuuX7nwXl5LljjLcsobXAiTqmeYBf_YjVhspM84Ws4eCVQPU8AkhaCGkOvxZS-1iTkXZo70HMswKhe8ZvSKs0ogt9GUwvY-a83aZ8_VGmFtVIQiQf8N2pciNry_Knd0agapjXaMAOslOKRiliLGX2dRBUzpIlNiAVHxZUJ5UTWGJ9ChhVjCFV7jU=&xkcb=SoB26_M3sjYmMjUHpJ0GbzkdCdPP&camk=ethIe0s0hedrw3pKnW6CKA==&p=12&fvj=0&vjs=3",
    "description": "We’re looking for a detail-oriented, self-motivated native Gujarati speaker to join our Data Quality Analytics team. In this role, you’ll help improve the quality of data that powers global products by reviewing, labeling, and analyzing content in Gujarati. You’ll collaborate with cross-functional teams and play a key part in enhancing user experiences worldwide.\nData Quality Analyst – Gujarati Language Specialist\n6-Month Contract\nHybrid – Redmond, WA or Burlingame, CA\n(Mon/Fri Remote, Tues/Wed/Thurs Onsite)\n8:30 AM – 5 PM PST\n\n$27/hour\n\n\nWhat's the Job?\nAuthor and refine guidelines for Gujarati-language data collection and quality assurance audits.\nConduct internal research studies involving Gujarati-speaking participants, including sourcing, guiding through procedures, and collecting data while maintaining confidentiality.\nPerform weekly quality assurance audits of Gujarati-language data collected by internal and external teams.\nCompose weekly reports highlighting trends and issues specific to Gujarati-language data.\nProvide ongoing feedback to collection teams to ensure high-quality Gujarati data and monitor program performance to identify best practices for data quality improvement.\nWhat's Needed?\nFluency in Gujarati (spoken and written) is required.\nSelf-motivated with the ability to manage workload independently.\nExcellent interpersonal and communication skills.\nStrong analytical, research, and problem-solving abilities.\nProficiency in spreadsheet software (Google Sheets/Excel), including formula writing.\nWhat's in it for me?\nOpportunity to work on innovative AR/VR projects and contribute to cutting-edge avatar technologies.\nCollaborate with cross-functional teams in a dynamic environment.\nGain experience in data quality assurance and language-specific data management.\nWork in a hybrid setting with a flexible onsite schedule.\nBe part of a forward-thinking organization committed to diversity and inclusion.\n\nUpon completion of waiting period consultants are eligible for:\nMedical/Dental/Vision plans\nHealth Savings Account\nHealth Flexible Spending Account\nDependent Care Flexible Spending Account\n401(k), Plus Match\nPTO\nWeekly Pay\n\nIf this is a role that interests you and you'd like to learn more, click apply now and a recruiter will be in touch with you to discuss this great opportunity. We look forward to speaking with you!\n\nAbout ManpowerGroup, Parent Company of: Manpower, Experis, Talent Solutions, and Jefferson Wells\nManpowerGroup® (NYSE: MAN), the leading global workforce solutions company, helps organizations transform in a fast-changing world of work by sourcing, assessing, developing, and managing the talent that enables them to win. We develop innovative solutions for hundreds of thousands of organizations every year, providing them with skilled talent while finding meaningful, sustainable employment for millions of people across a wide range of industries and skills. Our expert family of brands – Manpower, Experis, Talent Solutions, and Jefferson Wells – creates substantial value for candidates and clients across more than 75 countries and territories and has done so for over 70 years. We are recognized consistently for our diversity - as a best place to work for Women, Inclusion, Equality and Disability and in 2023 ManpowerGroup was named one of the World's Most Ethical Companies for the 14th year - all confirming our position as the brand of choice for in-demand talent."
  },
  {
    "title": "Statistical Process Control Statistical Quality Control Data Analyst",
    "company": "Matheson Tri-Gas, Inc.",
    "location": "Irving, TX 75060",
    "salary": "Full-time",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0C1ihjj1FYx73_02yGTS96r3SNeUtc-9S9zmnK0ry7bjnQ6Jf2s4KR_7BSE-wQz5x_AmhfTAiTks-yJCIbxBv1SBz7VIGd6_mv-XspP1K-_UVEJuJpq4Kxg_-a0MdlkxYre9FquJHhDQIaBnzRC7hzodZXXAL40gueIZD4qUe6MFo_aRAY1Iw9lydmqErVhfnHmWvHnJSNZCN5b_t7nqkBw4u4QIwDLpPmaGPFpuiAUJwx3NNgg-kwDTdMVSxwHdurIjj69hDbiVu3JaD_hmDJqn0zfZTilZlnwxJiuvcX3159bxoqHNQBlEObqHDetdT_uDI99xmVLRnjV1_KKpV9XAB3TmlK3JSLKZUsnPGRcCXST823J3nIPYqP3nVVennYkhZZhrrPjWbmyF1GgE2tTyyWY34omk48d6RmuCeW8NOzQ_Qn1bZJz1PleQg5fFlfYREqTbYji-GTbh8QfSiFUzexxNrChK8q8WXw5Ww78ODx5xqxpE9epYCHHXRxcg6F3PVPh91a3LIx75NALSxI_2HyheXgqNe9E7YD4f2FRbZ2RCU9t3r1AxhLUuNJLO_D7CqHTCNMLBXMAAEn9CdILt6ZUO2YBv8eXwDP-6yADLoo-yBdn7EjluDFwYVxrVLlnAI32nvjSQjKsjoXg48SSZLN6kIu0tHw=&xkcb=SoBl6_M3sjYmMjUHpJ0CbzkdCdPP&camk=UoKtGZLa3XLGJ1QJWibkvA==&p=8&fvj=0&vjs=3",
    "description": "Statistical Process Control/ StatisticalQuality Control Data Analyst - New Johnsonville, TN\n\nData Analyst Role\nInvolves collecting, cleaning,processing, and interpreting data to derive actionable insights that helpMatheson make informed decisions, improve performance, and solveproblems. Key responsibilities include performing statistical analysis,identifying trends, creating data visualizations, and communicating findingsthrough reports and dashboards to Operations, Sales, Product Management andSenior Management. Data analysts use tools like SQL, Excel, and NWA orMinitab statistical software, and their findings support strategic planning andoperational improvements.\n\nCore Responsibilities\nData Collection & Acquisition: Gathers data from various primary and secondary sources.\nData Cleaning & Preparation: Cleans and processes raw data to ensure accuracy, consistency, and readiness for analysis.\nData Analysis: Conducts statistical analysis and uses various methods to identify trends, patterns, and relationships within datasets.\nInsight Generation: Translates complex data into meaningful, actionable insights for business stakeholders.\nReporting & Visualization: Creates reports, charts, and dashboards to present findings to internal teams and senior stakeholders in an understandable format.\nDatabase Management: Sets up and maintains databases and data infrastructure.\nCollaboration: Works with technical and non-technical teams to understand business needs and present data-driven solutions.\n\nKey Skills & Tools\nTechnical Skills:\nProficiencyin SQL, Excel, and data visualization software (NWA, Minitab) is essential fordata manipulation and presentation.\nAnalytical Thinking:\nAbility toanalyze complex data, identify root causes, and draw meaningfulconclusions.\nStatistical Knowledge:\nUnderstandingof statistical techniques like regression analysis to interpret datapatterns.\nCommunication:\nStrongskills in communicating findings to both technical and non-technicalaudiences.\nProblem-Solving:\nApplying data analysis to solve specific businesschallenges and identify new opportunities.\n\nPurpose of the Role\nThe primary goal of a data analyst is toconvert raw data into understandable information and insights and effectivelycommunicate it to the stake holders. This enables businesses to:\nUnderstand customer behavior and market trends.\nImprove business processes and operational efficiency.\nCommunicate factual evidence rather than assumptions so that strategic decision can be made.\nIdentify areas for growth or areas that require improvement.\nAt Matheson, we're proud to stand at the forefront of theBig Data revolution. Using the latest analytics tools and processes, we're ableto maximize our offerings and deliver unparalleled service and support. To helpcarry us even further, we're searching for an experienced data analyst to joinour team. The ideal candidate will be highly skilled in all aspects of dataanalytics, including mining, generation, and visualization. Additionally, thisperson should be committed to transforming data into readable, goal-oriented reportsthat drive innovation and growth.\nObjectives of this role\nDevelop, implement, and maintain leading-edge analytics systems, taking complicated problems and building simple frameworks\nIdentify trends and opportunities for growth through analysis of complex datasets\nEvaluate organizational methods and provide source-to-target mappings and information-model specification documents for datasets\nCreate best-practice reports based on data mining, analysis, and visualization\nEvaluate internal systems for efficiency, problems, and inaccuracies, and develop and maintain protocols for handling, processing, and cleaning data\nWork directly with managers and users to gather requirements, provide status updates, and build relationships\n\nResponsibilities\nWork closely with project managers to understand and maintain focus on their analytics needs, including critical metrics and KPIs, and deliver actionable insights to relevant decision-makers\nProactively analyze data to answer key questions for stakeholders or yourself, with an eye on what drives business performance, and investigate and communicate which areas need improvement in efficiency and productivity\nCreate and maintain rich interactive visualizations through data interpretation and analysis, with reporting components from multiple data sources\nDefine and implement data acquisition and integration logic, selecting an appropriate combination of methods and tools within the defined technology stack to ensure optimal scalability and performance of the solution\nDevelop and maintain databases by acquiring data from primary and secondary sources, and build scripts that will make our data evaluation process more flexible or scalable across datasets\nPerforms other duties as assigned\n\nRequired skills and qualifications\nThree or more years of experience mining data as a data analyst\nProven analytics skills, including mining, evaluation, and visualization\nTechnical writing experience in relevant areas, including queries, reports, and presentations\nStrong SQL or Excel skills, with aptitude for learning other analytics tools\n\nPreferred skills and qualifications\nBachelor's degree (or equivalent) in mathematics, computer science, economics, or statistics\nExperience with database and model design and segmentation techniques\nStrong programming experience with frameworks, including XML, JavaScript, and ETL\nPractical experience in statistical analysis through the use of statistical packages, including Excel, NWA, and Minitab\nProven success in a collaborative, team-oriented environment\n\nMatheson is an Equal Opportunity Employer that complies with the laws and regulations set forth under EEOC. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or protected veteran status. EOE AA M/F/VET/Disability."
  },
  {
    "title": "Data Analyst, Specialist",
    "company": "Vanguard",
    "location": "Charlotte, NC",
    "salary": "",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0BWQs_M7ZA8XLbIFWVw-PYcVVEPryqVLyWhKaEKPskHy2YkbHyHJDwB_nHc5A6JaMQOCIRlFIPDacRbE3TGRxsHgtKRZ-sCK1_Mbx3euyFYXInjkjS_za7qnte8ZyaYmJuDeFAd30WTVp_VdxoO9_GoMBG0mXYNa7wJuhn26dnPJxBcGq6RauzzmLgGJDCFGXDh9J89fFLcB0CqHSQqs-XoCLLGenMUegjKpuQbRFkwBq6e6XyWnR2H3QHaaZ2bAPfPyHP9Kan3XyDMniD6K3JtSrFG-LjgYHNlNk9Mev5krDRsNcExfgD---3G99ZJB-y7Y-J1HXro0Ru3NkCCJ5Oo4ehM2V0L_F5WxYQo2Jg4EAzlqg7uPnKIulULY5VVN8rUvmIQ_TCEebKTqwmMdjZbTSE8QOitdNxzBdf6cVZzLpOjScV4vMTQcKdlG94yEmwVuF6ugEMG-OHK1RO6I-QacnvRVxMam-DktYe1n6rqW0rpVKD_dzXxKljViAilQx4L5QULSpLvxvZXxUH2hyaN2MfTiXa0saUSGjoh0WxMJMgrvrCfGkEb8xVCUWnmeJo7Wz2mruyAob0kH4AC0-t7ztlIZhsxRZi42RMYg_cnRkOKoIWS6bbw4VzgECtsm_uogNlDOGitp0TElWk0e-GcEnD3tR2IFBXCGfkNLBgvsWi5Ovw6_H4HOnXyL8YpNzLEtFsoRQKWKvV4rSu9URtwbqBk_s4ccQdAaTDn31IWjJ4OrbJbvEncq6ZgU_uKTli8GelfIYdRSsbD-JxmFyhOI4s42oXEdHuyHCR1fQieM6S8UwokMPM28wT9Im4L4-KrXk3fc-2H0Dq8VN7H5MbD3W4lEGlScv8vuy0lHEWtcFydZ6xTV-1L8aJLGgi_dD3yxwqI1Coa7In4uoH8Q-qGpzy6m9A1pgwvhXW9vOVGUwMTx5jz-SYcQsv5OKHmAJSU1vC8saTJh5LAePir6fTr6MrhS45OrTXCr5KT1uJ2wnP2qz5OtTjA9a8gKQvenJzZVmB2NfbQrISZCCHK256wQXDP-vVQFP0L1AhuLljXf5uuRnX-RdMC4_OCqx_FStKHcD_-QV6ZxTbgKChpLCgE4hyW6AZJ8P4epG2_dDFOVimV1g9Vp3zv3pClqMOV9QB9iz8WbuwTGDMNrihTFxsBzt7fenG0gcStS8Awa7ZaqL0JI--gXveM4iCYv5BrT44thpzb83C90IJ73cYyX2NnuDuUU4crksfJGBdLPNK5or_DsmEOjwX-1LMdGXPgAnuGGIjOZ9Hva3N6q_eNzSXj&xkcb=SoAC6_M3sjYmMjUHpJ0KbzkdCdPP&camk=G42KULXkIwN4Jhi8z6A3Ow==&p=0&fvj=0&vjs=3",
    "description": "At Vanguard Personal Investor Marketing, we’re on a mission to help individuals achieve financial well-being by connecting them with our world-class investment products and services. Our team plays a critical role in shaping how we engage with prospects and clients—bringing the power of Vanguard’s trusted brand to life through data-driven, personalized marketing. To elevate our impact, we’re building a next-generation suite of marketing attribution models that will transform how we measure success, optimize resource allocation, and drive smarter marketing strategies. We are seeking a Lead Analyst to drive the strategic use of these attribution products—including Marketing Mix Models (MMM), Multi-Touch Attribution (MTA) models, and Experimentation frameworks. This role is ideal for someone who thrives at the intersection of marketing strategy, analytics, and data science, and who can translate complex business questions into scalable, actionable analytic solutions.\nResponsibilities:\nExecute flawlessly on marketing attribution products to build analytic insights that shape marketing strategy.\nPartner with marketing, data science, and data engineering teams to define and deliver attribution solutions that drive business impact.\nTranslate marketing and business questions into analytical approaches, ensuring alignment with data availability, modeling capabilities, and business goals.\nEvangelize attribution methodologies and experimentation best practices across the organization.\nRun monthly marketing performance assessments and “what if” scenarios.\nBuild consensus and influence senior stakeholders to gain confidence in methodology and drive towards a solution.\nEnsure attribution products are scalable, accurate, and actionable across digital and offline channels.\nParticipate in special projects and perform other duties as assigned.\nQualifications:\nDeep understanding of digital marketing ecosystems, including channels, platforms, and measurement strategies.\nProven experience with Marketing Mix Modeling (MMM), Multi-Touch Attribution (MTA), and A/B testing or causal inference frameworks.\nStrong technical fluency in data, analytics, and modeling concepts; ability to collaborate effectively with data scientists and engineers.\nExceptional communication and stakeholder management skills.\nMinimum of eight years of related work experience with five years in advanced marketing optimization\nUndergraduate degree or equivalent combination of training and experience.\nSpecial Factors\nSponsorship\nVanguard is not offering visa sponsorship for this position.\nAbout Vanguard\nAt Vanguard, we don't just have a mission—we're on a mission.\nTo work for the long-term financial wellbeing of our clients. To lead through product and services that transform our clients' lives. To learn and develop our skills as individuals and as a team. From Malvern to Melbourne, our mission drives us forward and inspires us to be our best.\nHow We Work\nVanguard has implemented a hybrid working model for the majority of our crew members, designed to capture the benefits of enhanced flexibility while enabling in-person learning, collaboration, and connection. We believe our mission-driven and highly collaborative culture is a critical enabler to support long-term client outcomes and enrich the employee experience."
  },
  {
    "title": "Associate Analyst - Master Data",
    "company": "Energy Transfer Partners",
    "location": "Dallas, TX 75231 \n(Lake Highlands area)",
    "salary": "Full-time",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0CpySXpyTWX4IOrLbTPoPji8IGSR4fgG4NUycGp0ucePuJ1gdSI5Ob2hi3ck7rIXO9XE4aB9beoUZZ_IkWkXkAn2UxPjhQEyWn-SFi9zXGzV7xp-8ePQZzzB3r1RWw2E06ngu9FpTGFqSF2O5i_-nOr-e3_BXxIdAzTIAWOzPcXQqCeHmd-LoczDW4vTZ2MekOaTIBUhumrS6AHqoF9qYf4lI7uIke9MYlr93icTaNY0HLhwBTez3BBGursyyrV5EwW5N9es4oKJNLsmn-ckvHNaE6z_KJhQZrLmS8yFv9Zq4CIlNuS3eomzQbSOJSkZeQZln8lLy-DnQ1FlbylKkDw4Rb-sMtn3QFM8zmA-vFeDJ5wyvqahT0echLV63JJioR6rZGZV4LOGYuHOaBtjqVZu3aMWxpqD1skxcY4ArV8J5oDaJM9QdLVdp-e5-e-CgewhFnHrHrjo4VcGZi-yf-_50MEdhlaNlH6gmdCK_L-Ly---MObLAtYVBuOtxeRSqjIyNwCPHYGcRRUKiDvqvJuGLpGBpSI-OMYjPGkJDYHgac4Rtt1jxNF7wbBzNdFnCYOqQTWwK3i6Y_al_Xkf8dwXWLvofdkfYqufRAA3Yl8jIH1sgRrEOQkgJ4cLbenxj-07JKuv-DhlvhXJ_NnifTh3ODuII0wrZfF07xEIAiWnp2tvksO4PX7MG2LjKMliat6ogLMjpTyaB9KppBAfBGyC_WW1W_ldVnouVk9nBHxaQ==&xkcb=SoCl6_M3sjYmMjUHpJ0PbzkdCdPP&camk=nUmJqO2E8rhvH70H0MOXrw==&p=3&fvj=0&vjs=3",
    "description": "Are you interested in joining our team? Chat with our digital assistant to learn more about our company and apply right from your mobile device!\n\nText ETP to 25000 to get started or apply through this web posting if you prefer.\nEnergy Transfer, recognized by Forbes as one of America's best large employers, is dedicated to responsibly and safely delivering America’s energy. We are driven to inspire our employees to create superior value for our customers, our investors, a sustainable future and giving back to the community where we have long-standing commitments to causes including MD Anderson Children’s Cancer Hospital, The Salvation Army, The American Red Cross, Ronald McDonald House and many more.\nWe value all of our employees who make our growth and success possible. We are proud to offer industry leading compensation, comprehensive benefits, 401(k) match with additional profit sharing, PTO and abundant career opportunities.\nCome join our award winning 12,000 strong organization as we fuel the world and each other!\nPosition Summary:\nThis position will be responsible for customer and vendor master data analysis for the Business Partner Support team. This involves knowledge of essential business partner requirements. This position will also assist with researching current master data to determine the best course of action for requests to add and change business partner profiles, annual BP clean-up projects, SAP S/4 Hana integration/acquisition projects, and payment return requests.\nEssential Duties and Responsibilities:\nFunction as an alternate for customer/vendor SAP audit review.\nMaintain a completed audit report repository.\nAssist with customer and vendor data scrubbing/analysis for SAP S/4 Hana integration and acquisition projects.\nComplete analysis for customer and vendor de-duplication and consolidation efforts.\nProcess ACH and wire payment return requests.\nProcess mass customer/vendor upload requests for integration projects.\nComplete mass customer/vendor change requests in SAP and Cherrywork.\nTroubleshoot customer/vendor related issues from the Cherrywork application.\nExtract and analyze blocked customer/vendor master data due to name and Tax -ID changes.\nAssist with annual W9 Project.\nParticipate in accounting automation projects as necessary.\n\n\nEducation and/or Experience, Knowledge, Skills & Abilities:\nTo perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements for this position are listed below:\nBachelor's degree or equivalent work experience in lieu of degree\nExperience in SAP preferred\nOffice Suite experience, especially Excel; proficient level\nAble to manage multiple tasks simultaneously with changing priorities and deadlines\nPossess proficient organizational, oral and written communication skills\nExhibit strong communication and interpersonal skills, ability to apply judgment, and professionally challenge and question activity and assumptions\nEnergy Industry experience a plus\nRequired experience is commensurate with the selected job level:\nThe Associate Specialist/Analyst level requires a Bachelor’s degree or equivalent experience and 0-2 years of relevant job related experience\nThe Specialist/Analyst level requires a Bachelor’s degree or equivalent experience and 2-5 years of relevant job related experience\nWorking Conditions:\nThe work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job.\nUsually, normal office working conditions.\nMust be able to remain in a stationary position 50% of the time due to prolonged periods of sitting or standing.\nOccasional overnight travel may be required.\nOccasional visits to industrial/manufacturing settings, which may include exposure to various materials and chemicals, as well as extreme temperature conditions and loud machinery, and require appropriate personal protective equipment.\n#LI-CK1\n\n\"An equal opportunity employer/disability/vet The Partnership is an equal opportunity employer and does not discriminate against qualified applicants on the basis of any actual or perceived legally protected characteristics under federal, state, or local law. The nature and frequency of the above working conditions and requirements may vary depending on individual operational circumstances. Where feasible, the Partnership will make reasonable accommodations to qualified individuals with disabilities to enable them to perform the essential functions of the job. DISCLAIMER: The statements listed in this job posting, which are subject to change, are intended to describe the general nature and level of work being performed by people assigned to this job. They are not intended to be an exhaustive list of all responsibilities, duties and skills required of personnel so classified. \""
  },
  {
    "title": "Business Intelligence Analyst (Power BI, Tableau, SQL)",
    "company": "Resolution Technologies",
    "location": "Peachtree City, GA 30269",
    "salary": "",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0D15-dBmK3VJFii87dhBCyRDplt2eAS04ycY7_y5uRkuUKxLa9w-2j8zoQa8Ekkpkk4iSM09DBIvBfeLJf3xa6bpHEc6K4799AMhFDzkTkS9a0eGOWXntXUdP-wxVWINIsgjxgwASEgWilKSfiTEY6kqyOaRkvQ9ivAqKrnrNf8wuA_dGsCiSaNfPuqiiLczojh1ggK_2GezB0XAeRjFXdM6HEf6U-m3E5xdCuETokiXMxXwO8S_Q4BSkXxhB4TUV2hSaG0Cl-6cT5ClD_HIdodCyP1VvYENkwwJI6_IKoqaz1Bd2_6Wz0zVNWX-J8zlI5RgWY0yFFHx08JsjawztcJ0xcBEEvauiRDArgtdL7aUQcNi5DEkMXurHfjuWUBh8IHuOsp0NE2fPSoqXqErSqbWH5XFGzITTmOa1W3rGyfGYj1xrW0STCdK87MsDuI_7Egf772biwj2IFcQWUM3T2JEAgTEj9wdrCyf9gwZSNFO5Vzb6cqxCdXF_F6RQGDlTkoGq700xQO-HRYbuPs-pMwvdeKCthDODJTv5rcwyizmambcbYwkzcTySgI2IKUIdHbWPC9GIi_wXU1UI6fRxZJ92q9CNxky-ne3M3oW-Sl8MfBCElPuT16A2VU2hEmZ3p2eIsItzJFkLNFLYp68klv3EyaVRDNDanE6MvHt92dn41rhuL3rhe8tyM42dx4K4n__vnWvnNn3sHG-mOuM8T1ceOcI-Y5YC1lflq95Iq-Da9E4samslbiVg1qFX5233o6jArHrcxfzCwp6aVpxC_c8H3lqcMfxO00lb7BpZNY3v99B2fidXU3&xkcb=SoAR6_M3sjYmMjUHpJ0ObzkdCdPP&camk=CaPcp5JXW8Kb0CwS25nmZg==&p=4&fvj=0&vjs=3",
    "description": "Business Intelligence Analyst Career Opportunity\nThe Business Intelligence Analyst is responsible for the creation and maintenance of various BI reports, presentations, data models and analytical tools to provide analytical data and reporting to support various functional areas within the business. The primary focus is to interpret and analyze data that the business generates and provide insights and reporting to support informed decisions. This position requires partnering with people across the company to support the continued growth and success of the enterprise working within a robust and cohesive team. This person has a passion for data visualization and has already acquired a high level of technical expertise. To be successful, the Business Intelligence Analyst will need to demonstrate both business acumen and technological insight to execute the global data strategy. The position works closely with business users to design, develop, test, and implement visualizations (reports, dashboards, interactive analytics) that go beyond requirements and deliver real business value. In addition to project work, this position will also provide support for the existing environment.\n\nBusiness Intelligence Analyst Key Aspects of Role\nData Analysis: Performing in-depth analysis of large datasets to extract meaningful insights, including identifying trends, correlations, and anomalies.\nRequirements gathering: Understanding business needs and documenting specific requirements for projects or system improvements.\nReporting and visualization: Creating clear and concise reports with data visualizations to effectively communicate findings to stakeholders.\nStakeholder management: Collaborating with cross-functional teams to gather feedback, align reporting needs, and ensure successful delivery of data visualization.\nPredictive modeling: Utilizing statistical techniques to forecast future trends and potential outcomes.\nBusiness Intelligence Analyst Role and Responsibilities\nServe as a visualization expert in Power BI and Infor Birst using data visualization best practices to guide team and business members in creating sustainable and scalable solutions.\nLead and participate in discovery and requirement sessions to document business knowledge with the ability to translate into development features, stories, and tasks.\nAbility to design and develop multiple visualizations in parallel keeping stakeholders informed and delivering efforts on time.\nUnderstanding of how to design data sets to accommodate the needs of different visualizations.\nUtilize experience to propose and recommend new visualizations and analytics to drive business insight and data analysis.\nDevelop trusting relationships with the internal and external team members while keeping a positive and collaborative mindset.\nProvide support to existing dashboards in parallel with project work.\nBusiness Intelligence Analyst Required Skills and Experience\n3+ years of experience as a Visualization Engineer or BI (Business Intelligence) Report/dashboard designer on large scale data warehouse and/or analytics initiatives utilizing enterprise class visualization tools (Power BI, Tableau, Qlik, Infor Birst).\n2+ years of experience designing, developing, and implementing visualizations in Power BI.\n1+ year of experience with visualizations utilizing Cloud-based platforms and data sources.\nStrong SQL (Structured Query Language) knowledge to view and understand data from common data base systems and applications (SQL Server, Infor ERP).\nGood understanding of data warehouse and data lake solutions such as Microsoft Fabric.\nDemonstrated ability to remain effective and productive in a fast-paced and changing environment.\nSuperior analytical and problem-solving skills.\nExperience with agile style project management techniques.\nAbility to work independently or in a group setting.\nExcellent verbal and oral communication skills with both technical and non-technical colleagues from geographically distributed teams on all organizational levels.\nBusiness Intelligence Analyst Required Education\nBachelor degree in computer science, mathematics, statistics, or related field.\nMBA or master degree in a technology related field preferred.\n#RT\n#DICEJOBS\n\nBusiness Intelligence, BI Analyst, Power BI, Tableau, SQL, Reporting, Dashboards, Data Lake, Data Warehouse, Data Mart, Infor ERP, Microsoft Fabric, Databricks"
  },
  {
    "title": "Senior Data Analyst (Real Estate Lending Systems)",
    "company": "Navy Federal Credit Union",
    "location": "Vienna, VA 22180",
    "salary": "$96,900 - $141,600 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0C1zplEsFktHkQc7kOOwm4rInMAlFzAoLIRfcwaDPIGgu8jCB8VseTUYObc-C-PZ6hofJ4Bqh457idUZJOjR1FeQFI_Wodk-pePYwWkk2qoNCc147ujZU8j886n4qUoNuHEnnJxkRO46vfF42A6ffwDmtcSzPhG695v5qcHs9_Q4MQw8PWnv2xnGud4QMxN0-Vf3EJJA9CWbK-dbhNe8-VkL7EJA2RppffqekVRKfBZu6nY28QcRoq_3cdLb4wEGxG3XWW0koneThaeAMB096AR2gAsOT-SMUeAg5Ld0j1Wvz8W_ejttYP9bV-4_jvURm9QIPHguS0b8qmdBAXCvGRJzh33KQzYFbz5nDtP6aY1AGYEfGba60nyipNHg_m_nBSEW9eB0FYI_VjsMOeHCMMydxcIyGQcHbUuHKcemLfRQyQPy3Q-8mY1lzd5aFCaAnqgmkxSVMNmp1dFU61yxqYEdZhRFy55J1EteIobALqkYovP36i1Bmn3MSHioJb1nxhbgVRmmXZuSaObLvtWWy082WOtrIYyhBRYq9d2J1l14smJys5zL-PJly0Yq10ifHRCz6fh7Q3C_ndkte0GHlQlA9Q0to7wtIjVcSLEHjcEg0-7QFeu4bP-CNdT8QPeZgUsdxfs6s-7tzu2cSmZ7ClUH5EiJDXHx5FMLIGoo3MV4PFTeEWLf86FaK_3896RVyBXBptMZ31ILChHK5kL6GaAf-_Oas3ThE8NiKMBRbrh18TcP55_rqqCVquF3Ynm71wMzRWXKr2deoT0Y1hyGcC27YtHtsFXpwq0Lpaomiiq_oE24f0J9vd1oP7s5SUj2-P9TyC7bIxm3IqJLCcmGUbslkjuz9wwK1FH_E0b-neQagVqNRw_fBMVsaPsKgTaBvQZd0JD0FFEYpRh6Xb9JyFmcERvRypAt8u2htuW3j9BP6666mUMZkw93QR4n-X9bMsmCiTqx9Fh2W80GVS54yeQ9oU38VNJArtFM5oySfSyYw==&xkcb=SoBf6_M3sjYmMjUHpJ0EbzkdCdPP&camk=H-lBaXMUocIkCzA3tsgB0A==&p=14&fvj=0&vjs=3",
    "description": "Overview\nPartner with business stakeholders and other analysts to understand business data needs, capture data requirements, and perform data transformation, integration, and storage. Provide inputs for complex data architecture and perform ETL on large data sets to support departmental and organizational objectives. Work under minimal supervision and use complete understanding of business needs and objectives to support projects that have impact on the achievement of operational goals. Advanced skill set and proficiency with data transformation practices, query languages, script languages, ETL pipelines and analysis techniques.\nResponsibilities\nDevelop and maintain data pipelines, workflows, and APIs using Data Factory, MongoDB, and SQL Server Integration Services\nWork with leadership to help determine data framework and architecture for efficient and optimized processes\nUnderstand data governance concepts to help tag metadata, secure personal information and comply with regulations\nUnderstand and be familiar with REL specific data sets\nWork with technology organization and business end-users to understand data and analysis needs and develop technical requirements including data definitions, business rules, and data quality requirements; conduct data UAT, and data accuracy, validation, integrity research\nEnsure compliance with deliverable reporting requirements by performing quality data audits and analysis\nIdentify and compile data sets using a variety of transformation tools to help predict, improve, and measure the success of key business-to-business outcomes\nAnalyze and resolve complex data quality issues, utilizing advanced data profiling, cleansing, and monitoring techniques to maintain data integrity and reliability\nClean and organize raw data and generate data tables in support of business intelligence and data science projects\nBuild working relationships with team members and subject matter experts\nLead small projects and initiatives\nQualifications\n5-7 years of experience in data analysis and reporting\nComplete knowledge and understanding of business area/specialization\nSkill in data manipulation and scripting languages such as SQL, Python, or R, as well as advanced data cleaning and preprocessing techniques and tools\nSkill in data transformation tool such as Data Factory and SQL Server Integration Services\nSkill in data architecture frameworks such as SQL Server, Azure, Cosmos and MongoDB\nProficiency in Data Governance best practices and policies\nEffective skill with ETL tools and techniques, data cleaning, and other analytical techniques required for data usage\nAdvanced skill interpreting, extrapolating and interpolating data for statistical research and modeling\nKnowledge of various data structures and ability to extract data sources (e.g., PySpark, PowerBI)\nStrong understanding of data governance principles and practices\nBachelor's Degree in Statistics, Mathematics, Computers Science, Engineering, or degrees in similar quantitative fields\n\nHours: Monday - Friday, 8:00AM - 4:30PM\nLocations: 820 Follin Lane, Vienna, VA 22180 | 141 Security Drive, Winchester, VA 22602 | 5510 Heritage Oaks Drive, Pensacola, FL 32526\nAbout Us\nNavy Federal provides much more than a job. We provide a meaningful career experience, including a culture that is energized, engaged and committed; and fierce appreciation for our teams, who are rewarded with highly competitive pay and generous benefits and perks.\n\nOur approach to careers is simple yet powerful: Make our mission your passion.\n\nBest Companies for Latinos to Work for 2024\n\nComputerworld® Best Places to Work in IT\n\nForbes® 2025 America's Best Large Employers\n\nForbes® 2024 America's Best Employers for New Grads\n\nForbes® 2024 America's Best Employers for Tech Workers\n\nFortune Best Workplaces for Millennials™ 2024\n\nFortune Best Workplaces for Women ™ 2024\n\nFortune 100 Best Companies to Work For® 2025\n\nMilitary Times 2024 Best for Vets Employers\n\nNewsweek Most Loved Workplaces\n\n2024 PEOPLE® Companies That Care\n\nRipplematch Recruiting Choice Award\n\nYello and WayUp Top 100 Internship Programs\n\nFrom Fortune. ©2025 Fortune Media IP Limited. All rights reserved. Used under license. Fortune and Fortune Media IP Limited are not affiliated with, and do not endorse products or services of, Navy Federal Credit Union.\n\nEqual Employment Opportunity: All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected Veteran.\n\nDisclaimers: Navy Federal reserves the right to fill this role at a higher/lower grade level based on business need. An assessment may be required to compete for this position. Job postings are subject to close early or extend out longer than the anticipated closing date at the hiring team’s discretion based on qualified applicant volume. Navy Federal Credit Union assesses market data to establish salary ranges that enable us to remain competitive. You are paid within the salary range, based on your experience, location and market position\n\nBank Secrecy Act: Remains cognizant of and adheres to Navy Federal policies and procedures, and regulations pertaining to the Bank Secrecy Act."
  },
  {
    "title": "",
    "company": "",
    "location": "",
    "salary": "",
    "url": "https://www.indeed.com/viewjob?jk=123456789abcdef0",
    "description": "None"
  },
  {
    "title": "Regulatory Reporting Analyst, Assistant Vice President",
    "company": "MUFG Bank, Ltd.",
    "location": "Hybrid work in Tempe, AZ 85281",
    "salary": "$87,000 - $137,000 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0DmIoLEfx3e5FKWdzPrCZVymN6nI1W4eX3Ta9yHxbrh7Z6MLI9BAa00FN1xVWj62EXwA5_I_6UMFFdSnINCe_KvWOjdajedI0CjL4qaSIJdXZeKZYJ60NfLYfKqxG9SHeW27vBi1ibKafFXyIvxEg8KACWwrKRm1e5dQoeqHMlzJ4xp_fn4VYmw-GGhsDgZkWBpybR0Uc0ZulxPWrzGO3JDHvDR6wZNw3kyuBrSYfFLUL9IJ1GIHpTP4Sq25UjescM7QGBrO4Wi4y8ti0ZgUp3ZSR2TPzncaeUlJg3m9fHIOuY8ez1JFI3NdYtqOyR1MF9IIm-r7j9U5lXtDFpq3cZI2nnwjQLHoRNgKjhDLTrll-Riq991ZmavrhGuOBBKdOCL9hc9rCbuwnzzIoN4LugFYxlcVq3wFf0vn-DutbvGJlfX1_DZiAekQtoWBmNG3hwbfsX_ubuLI07FkzH1mYsVsrHmo0d_2Jyv8E0H0jFZQgpl-ahR2fzE-irsNqvz6M1uwbAJUXemFzONLVIoETstDbd9EwF6unmSLqRALygcmVMFpWm2zp531W2yAZ8uoJRRVJDpducR1TmlXWxD9MJzm0JTp5cTWc2a_5DhzaFTV5bJjQQ2G4ao87pfmV8Q81JARZN-zFNYIHeyPGNfDifekzAwbOC8Y5B72QmFbl1iMrUGOZB8lwFDM7Bz3N9vUgYC7rlYRZ3Ed7-CNbujEWTH1niniLmX2Cr_GvRpoiyFq2vH_x5KjwkondYyBaRoiRWllaaYaSgFFtFv41OcaspUaSG62kSiUTfDnvreiqMGmI4QROPyYkivmcIT8yb4232RaWQN9Xh2VA==&xkcb=SoCX6_M3sjY8J_xUJJ0GbzkdCdPP&camk=H-lBaXMUocLAI308-PEWMg==&p=13&fvj=0&vjs=3",
    "description": "Do you want your voice heard and your actions to count?\nDiscover your opportunity with Mitsubishi UFJ Financial Group (MUFG), one of the world’s leading financial groups. Across the globe, we’re 150,000 colleagues, striving to make a difference for every client, organization, and community we serve. We stand for our values, building long-term relationships, serving society, and fostering shared and sustainable growth for a better world.\nWith a vision to be the world’s most trusted financial group, it’s part of our culture to put people first, listen to new and diverse ideas and collaborate toward greater innovation, speed and agility. This means investing in talent, technologies, and tools that empower you to own your career.\nJoin MUFG, where being inspired is expected and making a meaningful impact is rewarded.\nThe selected colleague will work at an MUFG office or client sites four days per week and work remotely one day. A member of our recruitment team will provide more details.\nJob Summary:\nThe Liquidity Regulatory Reporting Analyst is responsible for the production and submission of multiple regulatory filings in compliance with legal and regulatory requirements, the Bank’s policies and procedures, and generally accepted accounting principles.\nMajor Responsibilities:\nPerform production process for Liquidity Regulatory Reports, including, but not limited to, the FR 2052a, LCR, NSFR reports under mentorship of production manager.\nWork cooperatively with various groups to perform pre-submission analyses of reports.\nConduct detailed review, recommend procedural changes, identify controls to address and anticipate issues, to ensure accuracy, completeness and timeliness of reporting.\nPerform reconciliations of U.S. Liquidity reports versus other regulatory reports.\nBuild and maintain process and control documents which enforce the Bank’s framework.\nParticipate on multi-function teams in the development and implementation of regulatory/accounting changes.\nSupport ad-hoc requests.\nAdditional Information:\nBachelor's degree in Finance, Accounting, Business or related field.\nMinimum of three years of related work experience in liquidity regulatory reporting and financial services industry experience.\nPrevious direct experience in the preparation of the FR 2052a Liquidity Regulatory Report\nWorking understanding of U.S. Basel III rules/regulations and other banking regulations\nDirect experience in the use of regulatory reporting applications such as Axiom ControllerView and Oracle OBIEE\nProficiency in Microsoft suite of products, especially Excel\nExperience in User Acceptance Testing of applications and system changes\nExperience in the interpretation of rules and regulations\nWorking understanding of U.S. Basel III rules/regulations and other banking regulations\nStrong presentation and written communication skills.\nProblem resolution experience requiring strong analytical skills, good judgment and ability to work effectively with technical and non-technical partners.\nExcellent time management skills and the ability to work under time pressure and handle several tasks/projects at the same time.\nSolid understanding of banking products.\nExcellent analytical and problem-solving skills.\nStrong capability of working both collaboratively and independently to meet tight filing deadlines, and flexibility in handling moving targets.\nExcellent communication skills (both written and verbal) and interpersonal skills\nProficient in Microsoft suite of products, especially Word and Excel\nThe typical base pay range for this role is between $87K - $137K depending on job-related knowledge, skills, experience, and location. This role may also be eligible for certain discretionary performance-based bonus and/or incentive compensation. Additionally, our Total Rewards program provides colleagues with a competitive benefits package (in accordance with the eligibility requirements and respective terms of each) that includes comprehensive health and wellness benefits, retirement plans, educational assistance and training programs, income replacement for qualified employees with disabilities, paid maternity and parental bonding leave, and paid vacation, sick days, and holidays. For more information on our Total Rewards package, please click the link below.\nMUFG Benefits Summary\nWe will consider for employment all qualified applicants, including those with criminal histories, in a manner consistent with the requirements of applicable state and local laws (including (i) the San Francisco Fair Chance Ordinance, (ii) the City of Los Angeles’ Fair Chance Initiative for Hiring Ordinance, (iii) the Los Angeles County Fair Chance Ordinance, and (iv) the California Fair Chance Act) to the extent that (a) an applicant is not subject to a statutory disqualification pursuant to Section 3(a)(39) of the Securities and Exchange Act of 1934 or Section 8a(2) or 8a(3) of the Commodity Exchange Act, and (b) they do not conflict with the background screening requirements of the Financial Industry Regulatory Authority (FINRA) and the National Futures Association (NFA). The major responsibilities listed above are the material job duties of this role for which the Company reasonably believes that criminal history may have a direct, adverse and negative relationship potentially resulting in the withdrawal of conditional offer of employment, if any.\nThe above statements are intended to describe the general nature and level of work being performed. They are not intended to be construed as an exhaustive list of all responsibilities duties and skills required of personnel so classified.\nWe are proud to be an Equal Opportunity Employer and committed to leveraging the diverse backgrounds, perspectives and experience of our workforce to create opportunities for our colleagues and our business. We do not discriminate on the basis of race, color, national origin, religion, gender expression, gender identity, sex, age, ancestry, marital status, protected veteran and military status, disability, medical condition, sexual orientation, genetic information, or any other status of an individual or that individual’s associates or relatives that is protected under applicable federal, state, or local law."
  },
  {
    "title": "Senior JDE Business Systems Analyst",
    "company": "G&W Electric",
    "location": "Bolingbrook, IL 60440",
    "salary": "$96,555 - $150,000 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0DX51ESKWmNOnbBD4PT8jDUCQNQWjWcxfHf-QlezqyYBpRDpge4KRf-oAA4KEgLIolQCy2JX1Y7HUXmh_msHJr5xSxktwmaM_BiFyX-T1t9YHK3iP7IQBs0-kFN86YPuprT3uICT4XtHk9o9W7sQEkbSrcsG_20KLhERtcguHhlajp9q6-28maxg7g7DC5JlKGtQJyVyRzvjqNQfI1HJie9ZvbYwsWez43yfV9RAjPS8BYxCburleVZCr0O9RPmA_y_OfAm_lfvElPV_s4XtDHJWTmpq5x9qUZMpwYKQtA7Vx3u1Shb3e8_UaZUqooeeKScyXPx8r2hDOgCBHFizyb_MqMPwAJwTt4d38EA2d4FIEbDsZQgdjR96g0cFCFLyvA22KEAoDsWyd8joDCqIOEg6z4Cy5ol7NfiKBE77qLBwSUoEaK2d29zGuxpyyhiusZ19P9eFKNAVIDiHylchujDYY8qf5jmnLo6HlRufxDjWFIxKU0AOKSCQdCsl70vdtT1IOd4GgCGUoV_fScDc8ndNZT7umdV8Xw5Y8Q2f_Pnu6awlXu4WrBmpIohl8RiV8ByRYkzuGnnyEuhlYFPsH3gIm8H5qutdDaWeqPrIhqv_ssZk2kaoNTGdY_0bm3ZkXIvEdVE0VwOgGIgbjeL6Bnr2P25DEnfrqbX_e2iNSFNsg==&xkcb=SoAZ6_M3sjY8J_xUJJ0BbzkdCdPP&camk=UoKtGZLa3XJnRwidG3GqwA==&p=10&fvj=0&vjs=3",
    "description": "Senior Business Systems Analyst\n\nThe Sr Business Systems Analyst leads business and technology teams in designing and implementing JD Edwards EnterpriseOne solutions. Responsible for system architecture, project leadership, vendor management, advanced troubleshooting, and strategic process improvements.\n\nAs a Senior Business Systems Analyst you will:\nPartner with business leaders to identify opportunities for process optimization and system enhancements.\nDevelop project charters, define scope, and lead implementation projects.\nManage vendors for third-party solutions and system integrations.\nLead the development and execution of test plans, ensuring business alignment.\nDrive root cause analysis and implement long-term solutions for system issues.\nOversee documentation, training, and knowledge transfer for system changes.\nResearch and evaluate emerging technologies to enhance business capabilities.\nManage and prioritize change requests within ServiceNow, balancing business impact and technical feasibility.\n\nWe are looking for someone with:\nA Bachelor's Degree in Computer Science, Engineering, Business, or a related field.\n7+ years of experience with JD Edwards ERP in Finance, Manufacturing, or Supply Chain.\nStrong expertise in enterprise application implementations and process integration.\nA proven track record in leading cross-functional teams and managing complex projects.\nThe ability to develop business cases and estimate cost and effort for solutions.\nExcellent problem-solving, communication, and stakeholder management skills.\nExperience mentoring junior analysts and driving best practices in business systems support.\n\nWhat we offer you:\n\nTypical pay is $96,555 - 150,000 annually.\n\nPlease note the pay information shown above is a general guideline. Pay is based upon candidate skills, experience, and qualifications.\n\nThis position is eligible for participation in our Quarterly Incentive Pay Program\n\nG&W Electric offers a comprehensive benefits package that includes:\nMedical, Dental and Vision Insurance\nShort and Long-Term Disability\nLife Insurance\nHealth club membership program and reimbursement\nEmployee Assistance Program\nTuition Reimbursement\n401 (k)\nAnnual Profit Sharing\nVacation\nAir-conditioned/heated state-of-the-art manufacturing facility\n\nAbout G&W Electric\n\nInnovating since 1905, G&W Electric has grown into a global leader in engineered electrical power grid solutions. Working with us means joining a worldwide team of passionate manufacturing professionals striving to continually improve the technologies the world depends on to deliver safe, reliable electricity. Our culture is focused on employee success, so we foster an entrepreneurial environment that encourages everyone to thrive.\n\nLearn more about our company by watching this video: https://www.youtube.com/watch?v=DMtAhsdYeUQ\n\nG&W Electric enjoys a long reputation for product quality, innovation and world-class customer service to the power industry. We have established this reputation by believing that our greatest asset is our employees. We owe our success to the initiative and talents of highly skilled individuals within our team-based organization. Our goal is to set the standard for customer satisfaction by ensuring a superior level of service, performance and innovation. As a global organization and industry leader, we are committed to cultivating an engaging work environment that embraces our core values and develops our talent. Our continuous focus on growth and innovation means that you become part of a company that provides challenging opportunities, rewards excellence and combines your individual expertise to achieve a higher level of shared success. As part of our organization, you also help power the world!\n\nG&W Electric is proud to be an Equal Opportunity Employer. All employees and applicants will receive consideration for employment without regard to age, color, disability, gender, national origin, race, religion, sexual orientation, gender identity, protected veteran status, or any other classification protected by federal, state, or local law. G&W Electric participates in the E-Verify process for all new hires.\n\nG&W Electric participates in the E-Verify process for all new hires.\n\nVEVRAA Federal Contractor"
  },
  {
    "title": "Canadian English - Data Quality Analyst",
    "company": "HCLTech",
    "location": "Reno, NV 89511",
    "salary": "From $40,000 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0Bgcb4g1dHQydGb3_iP017zD1ZUZ-jQFvp2Q1ohgyajfpup0QsuOR9tMIjjpziOCKNp6givGf9Go8643lRQu7hllCJ-peL_FouDVhVJns98nsy9DxnY1Dq_AjT6SFIKIvTotfpj45YY0RxHmK9q6IJkjrkCqnx0-lMHWDfQQuWX67GZSnxGFvRXMwoqa4-Aeu815zAhLqYLMsdJ85Nc61aJzRl04gey0xukaA8EljCffjTmjaVclKun4BLf5l9l4K5SYwR2f-Sj0DXmMxjy57M6Ye7gh7oER5RtADYnJ3V7-8_5ZP8wjoLKZOwJ8zn2aDQ9o0mLly4-08HR14JLP8wfNRM5tT1eCNFezneLSkwpb2Vr66XqwYh37qHn9txX9toFz-W-T-Y2ZU6Lelxi1BB4gogoQbb74q2FkofeygTdghrII_7QAHTrI9YBlhZlXfK2bf7Gj6ctgELEDFUHDS-bBPoBLgK5I58Y6sdArCV2Q-sYYxTrVoiEIgRpVDMKIl_ylrIPnYEpiwAIbFUOgMfq0knEOsP_YaAhZ3rBx0Mu-79XC_TMUJ0U5-8aodZos0HCfHZ6hQmZfDeYpjzs1nYjMDG_pMxg8KEsK6WUPR10Pndp8_jVgAb7tJIGctvsCCpbA5cUoh3b9eBBGLkY65y3Pxzxl7sbYAwbbcJSAnhpkQLDiLK6bL_Ux9zBArGomzpZVhYnT-bSUV6QhFgfNNwh&xkcb=SoBX6_M3sjY8J_xUJJ0LbzkdCdPP&camk=ethIe0s0hed9IrLPh7wBpw==&p=0&fvj=0&vjs=3",
    "description": "** Candidates MUST speak CANADIAN ENGLISH and be located in Reno, NV or surrounding areas. ** Relocation assistance will be considered, if needed.\nJob Title: Annotation Associate - Canadian (Native) English\nLocation: Reno, USA\nExperience: 0-1 Years\nPosition Overview: As an Annotation Associate/Data Quality Analyst, you will be responsible for manually annotating and labeling data items for our client in the Data Annotation space. This role includes supporting various streams that are part of the team/project. You will provide day-to-day support to the project leads and the teams, ensuring the accuracy and reliability of data sets.\nRoles and Responsibilities:\n· Manually annotate and label data items.\n· Verify the accuracy and reliability of data sets.\n· Create targeted sets to evaluate and improve judgment quality.\n· Annotate search results based on how well they satisfy user needs.\n· Verify annotated data and correct any errors.\n· Maintain records of completed work.\n· Ensure consistency in data annotation.\n· Provide feedback to improve data annotation processes.\n· Collaborate with team members to meet project objectives.\n· Analyze test results to identify areas of weakness and make recommendations for improvement.\nSkillset:\n· Native Canadian English language C2 level proficiency.\n· Excellent communication skills, verbal & written.\n· Experience with data labeling and categorizing.\n· A keen eye for detail to ensure accuracy in annotation.\n· Strong research skills to analyze the possible intents behind user search queries.\n· Ability to manage time effectively and meet deadlines.\n· Ability to analyze data and follow complex instructions.\nMinimum Skills to Hire:\n· A bachelor’s or master’s degree.\n· Ability to aggregate and analyze data in Excel.\n· Experience with data labeling and categorizing.\n· Listening to content and transcribing the content (Listening, Speaking, Reading, Writing).\nPreferred Qualifications\n· Understanding of the domain relevant to the annotation project (Ex: Audio, Text annotation, speech recognition, Natural language Processing.\n· Experience with annotation tools and platforms.\n· For certain projects, proficiency in specific languages may be required.\nBenefits:\n· Competitive salary and benefits package.\n· Opportunity to work on cutting-edge technology projects.\n· Collaborative and inclusive work environment.\n· Professional development and growth opportunities.\nPay and Benefits\nPay Range Minimum: $40,00.00 per year (or $19.23 per hour)\nHCL is an equal opportunity employer, committed to providing equal employment opportunities to all applicants and employees regardless of race, religion, sex, color, age, national origin, pregnancy, sexual orientation, physical disability or genetic information, military or veteran status, or any other protected classification, in accordance with federal, state, and/or local law. Should any applicant have concerns about discrimination in the hiring process, they should provide a detailed report of those concerns to secure@hcltech.com for investigation.\nA candidate’s pay within the range will depend on their skills, experience, education, and other factors permitted by law. This role may also be eligible for performance-based bonuses subject to company policies. In addition, this role is eligible for the following benefits subject to company policies: medical, dental, vision, pharmacy, life, accidental death & dismemberment, and disability insurance; employee assistance program; 401(k) retirement plan; 10 days of paid time off per year (some positions are eligible for need-based leave with no designated number of leave days per year); and 10 paid holidays per year.\nJob Type: Full-time\nPay: From $40,000.00 per year\nBenefits:\n401(k)\n401(k) matching\nDental insurance\nEmployee assistance program\nEmployee discount\nFlexible spending account\nHealth insurance\nHealth savings account\nLife insurance\nPaid time off\nReferral program\nRetirement plan\nTuition reimbursement\nVision insurance\nApplication Question(s):\nAre you capable of listening to content and transcribing the content (Listening, Speaking, Reading, Writing)?\nAre you aware of the salary range for this role?\nEducation:\nBachelor's (Preferred)\nExperience:\nData analysis skills: 1 year (Required)\nData Labeling/Categorizing: 1 year (Required)\nComputer literacy: 1 year (Required)\nLanguage:\nCanadian English (Required)\nLocation:\nReno, NV 89511 (Required)\nWork Location: In person"
  },
  {
    "title": "ERP Business Analyst (Epicor)",
    "company": "Advanced Ground Systems Engineering",
    "location": "Cincinnati, OH 45215",
    "salary": "$100,000 - $125,000 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0BRs-5IjTNObx1H7bb1TVYzEo1h2vJ6jYIhQy7Z9S5BpCzcxVXNBNOfFWBlJ8GAteWUx3szsZLpbGTYsZsuxubum3AlgBO0Pqyc764gcdq-ydQZd7_zb-fsHz3cB9GSSSlVN4QQ4W3o-C52oTRzz2oIEB_neq8H8Em6auho8Uq9_26yNrC_iITLcAkufNLmfYXJ3OnnvLdgSHF0v8CR6ji6pyL60q4lADIcxAByltXI9GVIHLo8f7VyyC61TkIWZxcS-NmNpbipbJPtvAnLg9kLLecmIuvybu9TpmVi7fmwhJGZEKLIAR-Fq4vritUMKGzkePueIJuM0n_vlLw3bujgcCnIqzJDbUivX896k1HiSsjAsXUj2iwnhofs_nZaPd1-bwUs2kSQ2OXJgSrry0INdHGTiH5jbIHBL8SC8qRw-jwam7Jt5yIMC3UfIJ05ywBDgcibMTMMhlsVBXVpPW06I37F9s0pNDABr14o0CufYJcdGwVqkgwsNq18UAtuTxG9YZ4o5j5RQscuJGi1frms-JhUPvoj8W56itIIbk7JRblSTMLRPwlseP96w3ikCU8xGu7ojQHWl13WLx_ox9VmsXQYD4aQdfBIAP6SxQPYm1KDoWykDE_LYxcPLZ_Y19yR2FUggEJ3PBqk36J9EY49IwwwFHS-dCc=&xkcb=SoAw6_M3sjY8J_xUJJ0DbzkdCdPP&camk=ethIe0s0heeAydRZojxhJg==&p=8&fvj=0&vjs=3",
    "description": "JOB SUMMARY\nWe're searching for an ERP Business Analyst to translate business needs into functional and technical requirements for our new ERP system implementation. This person will analyze existing processes, gather requirements from stakeholders, and design/implement ERP solutions that align with organizational goals and support long-term strategic objectives.\nJOB DUTIES AND RESPONSIBILITIES\n· Requirements Analysis and Functional Design:\no Understands the overall business needs.\no Gathers information from various stakeholders, existing systems, and business processes.\no Analyzes and prioritizes these requirements based on importance and feasibility.\no Documents requirements in a clear and concise manner, ensuring stakeholder agreement.\no Translates requirements and designs ERP implementation.\n· System Configuration: Configures the ERP system to meet AGSE's specific requirements, including custom setups.\n· Testing and Validation: Tests the ERP system to ensure it functions correctly and meets the specified requirements.\n· Troubleshooting: Identifiesand resolves functional, performance, and user-related issues with the ERP system.\n· Training and Support: Provides training and support to end-users on how to use the ERP system effectively.\n· Process Improvement and Optimization: Analyzes existing workflows and recommends improvements to enhance efficiency and productivity.\n· Data Migration: Assists with data migration from legacy systems to the new ERP system.\n· Collaboration: Collaborates with technical teams, business teams, project managers, and end-users to ensure the ERP system is integrated with other systems and meets overall business objectives.\nJOB REQUIREMENTS AND MINIMUM QUALIFICATIONS\n· Required education and experience:\no Bachelor’s degree in business administration, information technology, computer science, or related fields.\no 5 years of related experience. EPICOR experience preferred.\n· Able to commute on-site role at Cincinnati, Ohio facility.\n· Business Acumen: Understanding of business processes and how ERP systems can support them.\n· ERP System Knowledge: Thorough understanding of specific ERP systems (e.g., Oracle, SAP, Microsoft Dynamics 365). EPICOR experience preferred.\n· Business Process and Functional Requirements:\no Ability to understand and analyze various business processes and identify opportunities for improvement.\no Demonstrated expertise in translating business needs into functional specifications for the ERP system.\n· Analytical Skills: Ability to analyze complex data, identify problems, and propose solutions.\n· Problem-Solving: Ability to troubleshoot technical issues and identify solutions.\n· Technical Proficiency: Familiarity with ERP systems, data modeling, and related technologies.\n· Technical Skills: Familiarity with database management, system administration, and other technical aspects of ERP systems.\n· Communication: Excellent communication and interpersonal skills to effectively collaborate with clients and internal teams.\n· Project Management Skills: Ability to oversee project tasks and ensures the ERP implementation by preparing project plans, oversees implementation, and maintenance within budget and lead-times.\n· Industry Knowledge: Understanding of industry-specific regulations and best practices.\n· Excellent oral and written communication skills, including detailed reporting abilities.\nPHYSICAL REQUIREMENTS & WORKING CONDITIONS\nWhile performing the duties of this job, employees are regularly required to sit, walk and stand; talk or hear, both in person and by telephone; use hands repetitively to finger, handle, feel or operate standard office equipment; reach with hands and arms; and lift up to 25 pounds.\nSpecific vision abilities required by this job include close vision, distance vision and the ability to adjust focus.\nThe work environment characteristics described here are representative of those an employee encounter while performing the essential functions of this job. Reasonable accommodation may be made to enable individuals with disabilities to perform the essential functions.\nEmployees work under typical office conditions, and the noise level is usually quiet to moderate. In certain assignments, an employee may work near moving equipment and be exposed to toxic or caustic chemicals, biological hazards, airborne fumes, outdoor weather conditions and loud, prolonged noise.\nJob Type: Full-time\nPay: $100,000.00 - $125,000.00 per year\nBenefits:\n401(k)\n401(k) matching\nDental insurance\nFlexible spending account\nHealth insurance\nLife insurance\nPaid time off\nTuition reimbursement\nVision insurance\nApplication Question(s):\nAre you willing to undergo a background check, in accordance with local law/regulations?\nAre you willing to take a drug test, in accordance with local law/regulations?\nAre you legally authorized to work in the United States?\nAre you comfortable working in an onsite setting?\n• How many years of EPICOR ERP implementation and process optimization within manufacturing environments do you have?\nWhat is your highest level of education completed?\nPlease list your degree(s), major(s), and the school(s) where they were earned.\nAre you legally authorized to work in the United States?\nWill you now or in the future require sponsorship for employment visa status (e.g., H-1B)?\nAre you willing to work on-site in Cincinnati, Ohio?\nEducation:\nBachelor's (Required)\nExperience:\nEpicor: 5 years (Required)\nLocation:\nCincinnati, OH 45215 (Required)\nWork Location: In person"
  },
  {
    "title": "Lead Data Analyst (Marketing)",
    "company": "Vanguard",
    "location": "Malvern, PA",
    "salary": "",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0BWQs_M7ZA8XLbIFWVw-PYcVVEPryqVLyWhKaEKPskHy2YkbHyHJDwB_nHc5A6JaMQfBNqB37d1u_HS05juPZP3cC1pMKre05IeQ3YDRYTxfxUCG9PL9kLxEKkUQgrrjH6UbY5ipNFc-3ZFK8fgoMR2Ni_WOiPyYu9lKQa42dG4wsoUjMI1y3AmcPk22Pco1W3QkzfPUxc9DQxADC0vfFlN8UzFWqTVnOh-7_NRpY9xTLZgpR7HdsMpqTOHIZUTn03ASz1GKaezoqdfV7CNHuNppzGcGILykRl-Wq7NXxgsWQkcAzplJrn-5gukm27ttoSiEueYTyHNQ4ZUFRV7ru5DaW6E1SXiXLc5yXo-1uqA6lUl2__G3kLdNHqd8BSstijFKwPp5X6r8Fcoep-_9q9UEfV8fdCWcw1_yqxexlH9NDSL48W_-mtH4ANcVriCJxtcJbL3jxdz0v01sBXIdM0_orahVzLKBx0HfSRQQD51O1un_FiuGyoFY30zTjUOVw4J-y3rGmMHyG8hCUku3YNb-IFtLvVgkumCQf0oIwzzrrER_ZUfzjYbqrBJLvGURgKFfmlQcEGPWBw1JbSg_pYDFH3E90-WGdlZMRhgug-OjtvR73_szi_Zs_ZB9l-BdPb2mrm3xp-xLmFYqh1AkZmgNJOIEOZGVFQjrAyRlcYsaNB9gzIhgbvRjvjlshlG74CaVhhDX2eKJMCN-V-iH9c-SkRqa-o4WP1qTpP1ICJiDje6Bxh4rPbVf6kbk3SY39SmL1e4Hfjw1krgmu1TTH309hUXa0ASc5T5Quvtbows7y8mLrwACeXwtWKrSKBIdx-_H3bigO6uP9BudzBw5I_tO0_tOR6WTBw_x5W5mZ2tEqyfSe5NM4Sl2O8kpgZa1frHkNvcZ7TkX2OARDwzccmevjW9kCj6c1xKYkJuxOuOyrjkBjyFPxk2tPtqtN61Ccz141fpFJWoJVv4cAa3MSN7W2-qTMvrfiaOr86j5-thSfgph_3DQ2WUppQebgjITts2Ya1vYAXZuQGQK-Ot8csqSKPeKpbbbhWRyaC7OONmd-jq5ETnbNWnwXqNaRI-Ebfc9qOp1G-Fa7liv5jbhhcr-BTPIsz_f90TtCXqLVl8IC1lhjBMaqgFQbGykjCQ_CthjAKTPM9isAQvi2TV4A7mpX39TE3WKCb_5UxAd8CYj7QR4XdJBf__0yPgsdE-cuePf3H3qU5ppdkJ1xQjXa74tHin2v0_mbqG6USVOJQSh3afwa7XC23Hy247gWjks7A7jcX5k1KXH29l3d_EvFYUca6kCM3YpYlf8OgoAhnw2g==&xkcb=SoDj6_M3sjY8J_xUJJ0KbzkdCdPP&camk=G42KULXkIwN4Jhi8z6A3Ow==&p=1&fvj=0&vjs=3",
    "description": "The Self-Directed (SD) Marketing Analytics team is seeking an experienced lead analyst to join us on our analytic journey. Please reach out to Leonard Pollard to learn more!\nThe Self-Directed (SD) Marketing Analytics team is seeking an experienced lead analyst to join us on our analytic journey. We support the Personal Investor Marketing team in various business activities, including audience targeting, client journey analysis, marketing channel usage, and content creation. Our work encompasses data wrangling, reporting, dashboard development, strategy formulation, and advanced modeling. Collaboration with cross-functional teams is essential, as we partner with various analytics and marketing support teams.\nRole Responsibilities\nData Management and Analysis\nAcquire and compile structured and unstructured data, verifying its quality, accuracy, and reasonableness.\nPerform analyses of historical data to surface trends and insights using advanced analytical methods.\nValidate analytical techniques employed by other analysts.\nDevelop expertise in key subject areas (e.g., audience targeting, client journey, marketing channel usage, and marketing content).\nReporting and Visualization\nPrepare and deliver visualizations and internal presentations that translate analytic insights into tangible, actionable solutions for business partners to implement.\nDevelop, own, and manage recurring analytic or reporting processes.\nProject Management and Strategy\nEngage with internal partners to understand business strategy, questions, and goals.\nBring structure to business requests, translate requirements into an analytical project approach, and lead projects through completion.\nDelegate tasks and provide tactical and strategic guidance to peers.\nProactively identify opportunities within the business to contribute to its growth and success.\nParticipate in special projects and perform other duties as assigned.\nMentorship and Knowledge Sharing\nMentor and coach junior analysts to elevate technical and storytelling capabilities.\nFoster a culture of continuous learning and innovation in analytics tools and methods.\nProactively expand knowledge of business and analytics, share best practices, and document them.\nServe as a subject matter expert for the team and the analytic organization.\nCross-Functional Collaboration\nPartner with teams in Marketing, CXD, Engineering, and Finance to deliver integrated insights.\nParticipate in cross-divisional data projects and resolve operational challenges.\n\nQualifications\nExperience: Over seven years in analytics, data science, or business intelligence.\nEducation: Bachelor's degree in a relevant field; master’s or PhD preferred.\nTechnical Skills: Proficiency in SQL, Tableau, Python, PySpark and cloud platforms like AWS and Snowflake.\nCommunication Skills: Strong skills in communication, presentation development, and stakeholder engagement.\nData Visualization: Experience with tools like Tableau and Power BI.\nMarketing Knowledge: Strong understanding of marketing principles and strategies (e.g., A/B, multivariate, multi-armed bandit).\nSpecial Factors\nSponsorship\nVanguard is not offering visa sponsorship for this position.\nAbout Vanguard\nAt Vanguard, we don't just have a mission—we're on a mission.\nTo work for the long-term financial wellbeing of our clients. To lead through product and services that transform our clients' lives. To learn and develop our skills as individuals and as a team. From Malvern to Melbourne, our mission drives us forward and inspires us to be our best.\nHow We Work\nVanguard has implemented a hybrid working model for the majority of our crew members, designed to capture the benefits of enhanced flexibility while enabling in-person learning, collaboration, and connection. We believe our mission-driven and highly collaborative culture is a critical enabler to support long-term client outcomes and enrich the employee experience."
  },
  {
    "title": "Data and Business Development Analyst",
    "company": "Asaar Medical",
    "location": "Boca Raton, FL 33431",
    "salary": "Full-time",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0BZVqHRS7DKAvFSxUVajitLpy1E1AwZltUOmKBpZ5mYE5i3aIOX5ZYvguqMI_fsTob55_gwE-z__UK7hIcaLKE3ikixMLKWP9gZQwklF1Ymf8OcQAcX3Zp3I0Uc7Gwci9-9nE3_muZTCxw4W3B0NxkN_Ryz0iSF-XwNkODsw_bsz65-9xn_KqJIVzCs3O0lUpWpEl-QjjzoYlLjxsdWplsEMEqxM5xdEtRkFUjg5LFok3v-V42qAuIdOHtj4bytu0INkbT7yOxxHu88QN2smWXJs89P7OvIv1Di_xYlsSwUV7U74pSTRagBa7lGWzzc5ZsJ8uOZU8kru_bhZfoHXBT_d38C_2Rwb6O8wmUKdjS3accLUCAhMByd-FT3pEUqqqSP7GfcqTcAylC5kmpuD1fNV4Td-wEElsO0A1RxUDqBnqj97lTc_FfWlNHFREj6ne7KWOxN5U4nMP0Oc4SuUa6-L-mtCyMkAwbwRrIrsSLcoIN_F6CXGGpmwgMly14DSK0e7sbkIL8PVtv4f-d63Ec2CXrkdkwHoaqCY7iIOuNN7m1sTfqQP6igPEo9hBY5-pCarnF4SnCQ8lvfkdqvMIVQ52Giy0OUiV4gsp4yO1jc5UX2e5YQR7W3YSoCivEKQbrHkFY5MRrNaQyFrtavSKvUqrIYJAnmSEuPjSOVuIKYEu3U3dVFYZoF&xkcb=SoBE6_M3sjY8J_xUJJ0PbzkdCdPP&camk=UoKtGZLa3XI9PHL_n7LIUg==&p=4&fvj=0&vjs=3",
    "description": "About ASAAR Medical\nASAAR Medical is at the forefront of value-based care through the ACO REACH program. We partner with top-performing physicians nationwide to drive better patient outcomes, greater transparency, and financial sustainability in healthcare. As we continue to scale toward our 60,000+ lives target, we are seeking a key player to join our team—someone who thrives at the intersection of business development, data, and operations.\nThe Role\nWe are hiring a Data & Business Development Analyst to be the right hand of our Director of Business Development. This person will serve as the central connector between sales, operations, data, and actuarial teams—keeping workflows tight, accurate, and scalable. You will manage large data repositories, optimize CRM (HubSpot) performance, and translate complex actuarial data into clear insights for leadership and providers.\nThis is not just a “spreadsheet” role. You will be expected to own the architecture of data flows, troubleshoot CRM workflows, and create intuitive models that directly drive physician engagement and organizational growth.\nKey Responsibilities\nBusiness Development Support\nServe as the direct partner to the Director of BD, ensuring business development strategies are backed with clean, accurate, and actionable data.\nSupport provider demos and presentations by generating predictive models, reports, and real-time insights.\nAct as the HubSpot “go-to” person—managing imports, automations, workflows, and integrations.\nData Management & Analysis\nMaintain and reconcile large healthcare datasets (100k+ NPIs) with 100% accuracy.\nApply advanced Excel (or comparable tools: Power BI, Google Sheets, etc.) formulas and workflows to clean, filter, and analyze data.\nCollaborate with actuarial firms (e.g., Wakely, Falcon, CareJourney) to validate benchmarks, risk scores, and performance metrics.\nBuild intuitive dashboards, visualizations, and models to track shared savings, lives aligned, and provider performance.\nCross-Team Integration\nAct as the linchpin between sales, ops, data, and actuarial teams, ensuring smooth handoffs and clarity of priorities.\nTroubleshoot CRM/data issues in real time, especially when external vendors or offshore teams are offline.\nSupport care management, contracting, and provider relations with accurate data and reporting.\nQualifications\nStrong experience with HubSpot CRM (Salesforce experience also considered if adaptable).\nAdvanced Excel / Power BI / Google Sheets skills (pivot tables, lookup functions, complex formulas, large dataset management).\nFamiliarity with healthcare data (NPIs, TINs, benchmarks, risk adjustment, shared savings, etc.) preferred.\nExperience working with actuarial data, underwriting, or financial modeling a plus.\nKnowledge of AI tools, automations, and prompt engineering strongly preferred.\nAbility to communicate effectively across levels—executive leadership, coders, actuaries, and providers.\nHighly organized, detail-oriented, and comfortable managing multiple priorities under pressure.\nWho You Are\nA systems thinker who thrives on connecting dots across business development, operations, and data.\nComfortable being the “engineer behind the engine”—making sure every workflow is precise and scalable.\nA problem-solver who can anticipate issues and resolve them before they become bottlenecks.\nExcited about working in a high-growth, mission-driven healthcare organization where precision and execution are critical.\nJob Type: Full-time\nBenefits:\n401(k) matching\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\nExperience:\nHealthcare Datasets: 2 years (Required)\nHubSpot Management: 2 years (Required)\nBuild automation: 2 years (Required)\nAbility to Commute:\nBoca Raton, FL 33431 (Required)\nAbility to Relocate:\nBoca Raton, FL 33431: Relocate before starting work (Preferred)\nWork Location: In person"
  },
  {
    "title": "Configuration Analyst",
    "company": "Santa Clara Family Health Plan",
    "location": "Hybrid work in San Jose, CA 95119",
    "salary": "$111,168 - $172,310 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0C2uBa-nsw0_UHScgm0fR7oFuHwogAB0G5YVcR9HhHqQjKjwdmxjj__SPKzcUzeKlPC8FZLe-P0BmY-5OAV16zks1NsXqbiEIrOeiSkLbINJnyI4jU0F4ydqMuuz8tiipq6r6GbmYJPtRxIUzpsao5aUs-AaIbIO1l1jtXsAQSr033K8h-lOKPcYv9bk6OX8e0m2YW29uOulP6heYe7WfAYjwsdrOOO9mjDm3SM71SeNl1lJr5-e5l4UWw_l7rSKoLXTsWZSSOftl9gpnl06TVrkxMJIUS-qx0eGtnohdamV7tUVhk_JeNqzUJz_ssSvfKcgEpJW4X8ICpZlEio1mrPzPJebRDxCbPRcalF_HcLXDH7lkQkG-s5FnUVk-2FbC3KQWGmBqR_h5FvYvagnr4jK02I4o4rcjTQtcHJgXfdqWAuSoJBUMHQsg5yY3Frt34NR_PoIOGCXu1o7cJGcDa9Fb0NtrwSYQynlHMZ_8wBCK-QBD7XbpYl-wTe0wjBclG4-GcyeTW_-tqSUdU1dAXyNVI3kfiw8vsVJv4gl1953jGERsw39Cc5auOGQAH4ScmjURqGzep8OPHuaaJERo9PXeE2Q8IDXx2onF3pLEZYZCCIU_1poxB3-nDKLWBa7iLl4J8PmWjkox1bMtRChMLIkgsNAOlyYWkVloVZUNqzez8-HQlZRfomG81BRb5C9a0=&xkcb=SoDZ6_M3sjY8J_xUJJ0MbzkdCdPP&camk=4HOcmqOLYrDJ4MgMDvnBoQ==&p=7&fvj=0&vjs=3",
    "description": "About Us:\nSanta Clara Family Health Plan (SCFHP) is a local, community-based health plan dedicated to improving the health and well-being of the residents of Santa Clara County. Working in partnership with providers and community organizations, we serve our neighbors through our Medi-Cal and SCFHP DualConnect (HMO D-SNP) health care plans.\nAbout the role:\nThe Configuration Data Analyst is responsible for system configuration, implementations and conversions of SCFHP’s core systems. This position is responsible for the accurate interpretation and associated configuration of regulatory federal and state guidelines. along with business contractual agreements impacting benefits, contracts, millions of dollars in claims payment, case management, and/or grievance and appeals within core systems. The Configuration Data Analyst must have the ability to meet with internal and external business units and peers to gather requirements, independently analyze and mine data, draw sound conclusions, configure, test and implement the data structures that support SCFHP’s managed care information system (s) required to meet business needs, regulatory compliance, and vendor contractual obligations.\nDay to Day:\nComprehensive understanding of capitation models in order to setup within our core system to support multiple delegate contracts averaging approximately 50 million dollars in monthly capitation payments, based on accurate setup and configuration.\nComprehensive understanding and ability to interpret simple and complex provider contracts and amendments in order to setup within our core system reimbursement for, but not limited to, hospitals, provider groups, ancillary providers averaging approximately 1 million dollars in weekly claim payments, based on accurate setup and configuration.\nComprehensive understanding and ability to interpret federal and state government (DHCS and CMS) guidelines, and eligibility and enrollment process in order to setup core systems for claims, case management, and grievance and appeals\nCombine in-depth analysis of business unit requirements and comprehensive understand of core system capabilities, knowledge of claim processing, provider and vendor setup, authorizations and business processes in order to determine optimal core system setup to process claims, case management, and grievance and appeals with a high degree of accuracy and auto-adjudication.\nServe as a subject matter expert for multiple core systems including but not limited to QNXT, Essette, Beacon, Zipari, NetworX, Optum CES (Claims Editing System), etc.\nroubleshoot small to large scale, basic to highly complex business and system production issues by thoroughly reviewing the issue, researching within internal and external documentation such as regulatory publications, and system user guides, performing analysis and critical thinking and testing in order to identify a root cause, document findings, and recommend solutions\nPerform basic to highly complex system configuration and maintenance of system rules including but not limited to benefits, authorizations, contracts, fee schedules, DFRs, capitation, letter templates, etc. in order to fix production support issues, or support business needs and regulatory requirements in multiple system applications (such as QNXT, Essette, CES, etc.) for multiple lines of business.\nCoordinate the loading, validation, and testing of third party software updates, rate changes, and code changes (CPT, Diagnosis, etc.) with business units and outside vendors, as needed.\nCombine in-depth analysis of application configuration and data, information gathered through independent research, knowledge of system capabilities and interdependencies, and business processes to determine the best configuration in order to ensure overall accuracy and efficiency of system processing\nProject and task management for small to large scale configuration projects including but not limited to: Attend meetings with business units to gather requirements, track actionable items, send regular communications, escalate identified risks, recommend, implement, and test configuration changes.\nAbout You:\nBachelor’s Degree in Healthcare, Information Systems, or related field, or equivalent experience, training or coursework.\nExperience in healthcare\nMinimum three years of experience performing the above responsibilities or a minimum of 5 years Claims processing or application vendor experience in a managed care environment. Other additional qualifications may be used to substitute for a required experience.\nAbility to understand technical requirements and configuration logic to ensure systems are properly configured to meet business needs.\nAbility to meet deadlines, multi-task, troubleshoot, and problem-solve.\nMust be able to utilize analytical skills to conceptualize and envision impact of changes, and recommend resolutions for business or system issues and gaps.\nAbility to audit implemented changes to detect and resolve discrepancies to ensure work is accurate and precise.\nGeneral understanding of health care data sets such ICD9/10, CPT/HCPCs, provider contracts and benefits, authorizations, etc.\nPlease review the full job description on our Career’s page:\nhttps://phf.tbe.taleo.net/phf04/ats/careers/v2/viewRequisition?org=SANTCLAR2&cws=38&rid=3096\nJob Type: Full-time\nPay: $111,168.00 - $172,310.00 per year\nBenefits:\nDental insurance\nEmployee assistance program\nFlexible spending account\nHealth insurance\nLife insurance\nPaid time off\nRetirement plan\nTuition reimbursement\nVision insurance\nWork Location: Hybrid remote in San Jose, CA 95119"
  },
  {
    "title": "Senior Manager, Enterprise Insights",
    "company": "ITAC Solutions",
    "location": "Birmingham, AL 35209",
    "salary": "$130,000 - $150,000 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0CBcAKkMzvCCr3nbIFWZL1QEvzVdjPQKoc8nhQ-JuLQpxzqVVUHoHuUUuWjWLNA8-gJQu_1IRMriRdBFuQRzMq-T1zCJpuY8mWIiyX09AlCdrIidYYupxZUtN_rmi0MlnBQ1G5ObJYzJKxewyVoLehafKY88EwsGZ83t1MqyLkf7x06i39wUl9E7ok7KYGBqUQytqg5jeG5iPrSiHttMyI6dqRwxeWOeZnkkdki5i3iZ4FVY4E-L-9o6q1szUuXb1QAUS7CtGMyh8nGl2f8vT0gDpgjTZ7DDN9yKhyDbKIxAyADw-g1L20T0UIsWLhvxDlBQsaiVX98MyvlqyKI9PTce74dNhEnInYBOE5CMj-XGeuz1Uo8VEx6AfFgB4I2mbuIJkeJ4ZtJS9nVh-yQAAl3f4FI58sXl4E61FydDDWoirYl_OZtz7pJ93u2zbmeHYF1zOBjJUN6N2-564GLnu4wb78PHzGL80F6HscEZgR8o6--1HLKqXVAa1SEdN9TrQdILqVrT8-PqpFC4d1wx1FPhpXKDNuhjQRIuXnXyiF7jyuI_Nr3IrOGLUQ-WV0wjdOMqjrev1xwG2fbNJY6gRshzh6K7mDOn_k0FSb4RVwp_XWolRpkTA9_5AMBZp5eMX1VVwzIh4QANJEy6INm0bYxDd-jbCZbezw=&xkcb=SoAK6_M3sjY8J_xUJJ0FbzkdCdPP&camk=CaPcp5JXW8K7ou5DN24PEQ==&p=14&fvj=0&vjs=3",
    "description": "Step into a high-impact leadership role where data meets strategy and drives enterprise-wide transformation. Our client is seeking a dynamic Senior Manager of Enterprise Insights to lead a high-performing analytics team, solving complex business problems across recruiting, HR, operations, finance, and technology. If you're passionate about turning raw data into actionable enterprise strategy—this is your stage.\nC2C is not an option with this job opening and all applicants should be able work for any US Employer without sponsorship. Sponsorship is not provided and this person will not need to require sponsorship in the future.\nBenefits & Extras\nCompetitive salary with upward mobility and long-term growth potential\nHealth, dental, vision insurance + 401(k) with company match\nGenerous PTO and company-wide holidays\nCompensation\n$130,000-150,000\nWhat You’ll Be Doing\nLead and mentor the Enterprise Insights team across multiple business lanes\nBuild BI dashboards, reports, and tools that inform executive strategy\nUse SQL, Excel, and Python to develop data-driven recommendations\nEnsure data accuracy and proactively enhance system integrity\nPresent findings to senior leadership and collaborate across departments\nManage vendor relationships to expand analytic capabilities\nBuild automation pipelines that reduce response time from insight to action\nWhat You’ll Need to be Considered\nBachelor's degree\nExperience leading enterprise-scale analytics across multiple departments\nExceptional Excel skills and advanced proficiency in SQL and Python\nProven success building automations and BI tools that drive decision-making\nStrong understanding of cross-functional org dynamics (HR, Ops, Tech, Finance)\nExperience developing analysts into high-impact business partners\nBackground in tech, retail, or healthcare analytics preferred\nINDIT"
  },
  {
    "title": "Intelligent Workflows Analyst",
    "company": "Kitsap Credit Union",
    "location": "Bremerton, WA 98337",
    "salary": "$77,992.80 - $85,000.00 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0C46_tdczt0hvlnEQ9WlaoCau4hyigQGezqs5aSts8N2LMHLsODMqUDjzc_xD3zemY-zeNcabrSmv3zjifzNQSr4aq4a1wj3JzWVnMldYTD7JiRieul3BPWnoW5Pjofnu6377uM9XMXHPNt8pQdjScdMoxMPX-iZ4NTZHiNfow4jlB-89hAEDG6as4iZMxePvGj99s8_sYp0NWrJvevWnt1y0Q2Z0hHGeYGssbHYxq-9Gw7DVXgg_vAPCfKfLi1cXP8gE7LJhx3Koc_LcKSe2FM81jOZpQYkGkTjnn-uP3ziAucJ52l-Owe6ySd6uAJJ08vgaGi9FbZfCpih3Tn_GOn3fINjrBJMQCk-fbjiHAw-nJgOM0n5A7kDcsYMMeSdEAiXd3_qkNj0gVuX_CVWTOKoN0m3Y-5NKn0FBUD47jhTONmu6O7txNmjJeKPqQbkQt1BGttmCGHKV1P-6wEj0NM3X8bvDeIQGlVO9C9IGPL7SCDC-GyWI_HIZexByNfHXgj1l_Dffs20VSM486E6ZbsaiXSEHvh8a6QHGFUQ6MEqsZRimDp70KuUDYHH98a6lxZL-RwjgRxLzQyM5WXD274dLx43uKQqZ9BD-nCqaBOfDKDFSibRs7KN_IUm9tI90rUAjsWWdIGXPjjxVqyU6JIRA-1GeTXaEaqeSWRxVlBDx_zmVpfI8TBxbsAJ9mvD9ghrPR7B9_uSsj-UjZhGR2CHcnTzS46vLESjef8x58XFPszJzr1IWc56mP5JnvcrWYwxXxQUd0fhEDMaC065yEaomGjCfWLsCaMkPDYQpW2qmyz_2f8QIqmEUSm5eykAoqJ30a5FCp5bhAHTqFevJpP6moBWcw1XST4USmaem3vFU0PMi1kqMLUZq7FNTjU_Fgfp6fMIe3oVrlhu0bb5p5kkl2DY5EjHmBPaHWwn_W-tA==&xkcb=SoAj6_M3sjY8J_xUJJ0HbzkdCdPP&camk=NFVmwABINBKIDIyXVOmdJg==&p=12&fvj=0&vjs=3",
    "description": "About Us\nKitsap Credit Union is a not-for-profit, member-owned financial cooperative with more than 300 employees and 14 branches throughout Western Washington. We have a passion for making a positive difference. As a $2 + billion-asset credit union, we are deeply committed to our members’ financial wellbeing and the prosperity and quality of life in the communities we serve. We are proud to be led by individuals with the experience and skills to drive our organization towards our goals for strategic growth and operational excellence. Our KCU Cares Foundation program focuses on providing resources and support for those struggling with homelessness or hunger and improving the financial well-being of the people in our communities. And beyond monetary efforts, we have provided thousands of hours in staff volunteerism and in-kind support.\nAt Kitsap Credit Union, our success is built on trust-based relationships and personalized service. We understand our employees are key to our success. They provide the personalized service to our members and contribute to the communities where we live. We are committed to providing a supportive, mission-driven, and inclusive culture where employees can grow their careers. To learn more, visit kitsapcu.org.\n\nAbout the Role\nKitsap Credit Union is growing and searching for an Intelligent Workflows Analyst. The Intelligent Workflows Analyst plays a key role in supporting enterprise-wide process transformation efforts. Reporting to the Director of Intelligent Workflows, this role is responsible for conducting process discovery, analyzing operational workflows, and identifying opportunities for optimization, automation, and compliance enhancement. The Analyst collaborates across departments to gather insights, document current-state processes, and contribute to future-state designs that align with the credit union’s strategic goals for efficiency, scalability, and member value.\n\nQuick Facts\nReports to: Director, Intelligent Workflows\nEmployment Type: Exempt, Full-Time, Hybrid\nSalary Range: $77,992.80 - $85,000 depending on experience\nBonus Target: 7% potential incentive of base pay\nWorking Hours: Monday - Friday 8AM - 5PM\nGrade: 10BC\nIndustry: Banking\n\nPrincipal Accountabilities\nProcess Discovery & Documentation\nConduct interviews, workshops, and observations to capture current-state workflows\nCreate detailed process maps, swimlane diagrams, and documentation using BPM tools\nMaintain and update the enterprise process inventory in alignment with strategic priorities\nAnalysis & Insight Generation\nIdentify inefficiencies, redundancies, and compliance risks within existing workflows\nPerform root cause analysis and contribute to gap assessments led by the Director\nSupport cost-benefit analyses and ROI modeling for proposed improvement\nOptimization & Automation Support\nCollaborate with automation teams to identify workflows suitable for tools like Power Automate and UiPath\nAssist in defining business requirements and test cases for automation initiatives\nMonitor post-implementation performance and recommend iterative enhancements\nStakeholder Engagement\nPartner with business units to validate findings and co-create future-state designs\nPresent insights and recommendations through visual aids such as dashboards and decision trees\nSupport change management efforts by documenting impacts and training needs\nCompliance & Best Practices\nEnsure process documentation aligns with regulatory requirements (e.g., Regulation CC, BSA/AML)\nBenchmark internal processes against industry standards and best practices\nContribute to the development of governance models and performance metrics\n\nRequired Skills and Abilities\nExcellent verbal and written communication skills.\nStrong analytical skills with the ability to translate data into strategic decisions.\nExpertise in organizational design, process mapping, Lean/Six Sigma, and change management.\nProficient with Microsoft Office Suite and knowledge of other process mapping tools (e.g. Miro, Visio).\nDemonstrates a high level of engagement and active collaboration contributing to a positive team environment.\nUnderstand, model, and represent KCU’s core values.\n\nRequired Qualifications and Education\nBachelor’s degree in Business, Operations, or related field\n3+ years of experience in process analysis, business operations, or workflow optimization\nProficiency in process mapping tools (e.g., Miro, Visio, Lucidchart, Nintex)\nStrong analytical and problem-solving skills\n\nPreferred Qualifications and Education\nExperience in financial services or credit union operations\nFamiliarity with automation platforms and BPM methodologies\nExposure to compliance frameworks and regulatory environments\n\nSupervisory Status\nThis position does not supervise others.\n\nWorking Conditions\nThis position will be required to work in an office environment with moderate noise levels, and, with or without reasonable accommodation is required:\nMust be able to remain in a stationary position for a minimum of 75% of the time\nConstantly operates a computer and other office productivity machines\nOccasionally ascends/descends stairs\nConstantly positions self in work environment\nThe person in this position frequently communicates with peers, supervisors, vendors, and employees to exchange accurate information and answer questions\nMust be able to detect objects at a distance\nOn occasion will move up to 20 pounds of office objects\nWorks in an indoor office environment but expected to attend meetings in buildings that require travel in outdoor weather conditions\n\nEQUAL EMPLOYMENT OPPORTUNITY/AFFIRMATIVE ACTION STATEMENT\nKitsap Credit Union is firmly committed to equality of opportunity for all employees and applicants for employment in accordance with applicable Equal Employment Opportunity/Affirmative Action laws, directives and legislation.\nThis job description is intended to describe the general nature and level of work being performed by employees in this position. It is not intended to be an exhaustive list of all responsibilities, duties, and skills required for this position; other duties outside of normal responsibilities may be performed as necessary to meet the needs of the organization. Nothing in this position description restricts management’ right to assign or reassign duties and responsibilities to this job at any time.\n\nOur Values\nIntegrity: We believe in acting with honesty, trust, and respect which are at the forefront of our daily engagement.\nResponsibility: We believe that responsibility is holding ourselves accountable for our decisions, actions, and their outcomes.\nCollaboration: We believe in the power of a diverse group of people working together to achieve a united outcome.\nAuthenticity: We believe activities in actions that demonstrate our commitment to be transparent, dependable, and genuine in every day.\n\nWhat We Offer\nNot only are we one of the largest credit unions in Washington State, and growing, but we are also a company that cares about its employees. We back that up for our employees by offering competitive pay and a benefits package that helps support you and your family’s lifestyle. We value our employees, and we strive to keep our benefits comprehensive and affordable. Some of our benefits include:\nCareers | Kitsap Credit Union (kitsapcu.org)\nFree onsite parking\nAnnual time off and sick time accrued\n11 Paid holidays\n1 Personal day\nMedical, Dental, Vision, Short- and Long-term Disability, Life and AD&D Insurance\nEmployee Assistance Program\nChoose from a PPO medical plan or a High Deductible with a Health Savings Account\n3% KCU funded Safe Harbor Contribution to your 401K\nKCU will match up to 2% of your 401K contributions\nAll 401K contributions are 100% vested\nPotential annual incentive in all roles within Kitsap Credit Union\nTuition reimbursement\n8 hours of paid volunteer time off\nDiscounts on KCU's products and services\nEnjoy unlimited ORCA transit access through KCU for less than $45 a year—your cost as an employee\n\nWe believe in the power of belonging – it’s in our DNA as a not-for-profit, member-owned cooperative. Our un-bank-like structure ensures that we remain all about people: our members, our employees, and the people in the communities where we live and work. We work hard to provide a collaborative and inclusive environment where you can grow and excel in your career.\nWe are dedicated to serving our members by providing personalized experiences, convenient access, and highly competitive products and services. But it goes much deeper than that. For more than 86 years, we have been relentless about making a positive difference in our communities. We understand that when our members and communities succeed, we all succeed, and that success can’t happen without great employees.\n****** Employment is contingent upon satisfactory background and/or reference checks. Kitsap Credit Union is an Equal Opportunity Employer. All qualified applicants for employment will receive consideration without regard to sex, marital status, race, color, religion, national origin, age, veteran status, disability, genetic information, or any other protected status. ******\n#IND\nEqual Opportunity Employer\nThis employer is required to notify all applicants of their rights pursuant to federal employment laws. For further information, please review the Know Your Rights notice from the Department of Labor."
  },
  {
    "title": "Associate Business Systems Analyst",
    "company": "Uline",
    "location": "Pleasant Prairie, WI 53158",
    "salary": "Full-time",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0Ad3giXQyOqSjtuCazZCjThtx5L7e01X6oDYMq-RePRDXqyoHJft3DMEvF0V8aDwfB_08bo7YC9fSD3szX8pzpDNBG4BK3HYFGPEutS1qU5LXH3VddvH6bLy6hOMctTBX-0RMoFiJaEd7jePAVR-Yqog0mCeIYBvfJwKZVmgnTJbu-foRu_EgYyBEJ86FHhaQ4OmkvWSRmffTGdR0hm4UEKeGgvzQ6Nmr4k6Zp66yUoblQe4dwocRFRI__s68xo7RgHDufcdkSJhstiPuLU_6xiUwzD6hBzBizQNbcM8eW9lvlmPE7glHU8zGnN-4O_dwGMOoxQvNWyPyNT4j99DBengeX1cSaciYwKM23sbwjkb52Kmu0ABVtgVVOLAsVrkyO5IVU45Vxeyn4rbDRK-Vibl6j6AfVM_yRyKjRc7u8YIAROJz62ZHkrblQvGrRB9qwfgiHhRaRXnFfb3KHpcA08gZeQFygQAjQ5O0UeBvivBRFwwQXQYaM0WsYPMfbqOmXsYu7TL83yMvAAgsqtZTQT01S49Pv618AxKkQQ5Jo4SR89AwV2Vr7FN-Mk0vxnQ1C58RWSEuggTGEYr5ZhFmroC8DgpRRPkwDZgTOQMJlQSFashyj9dF3Hz9vmufqtikatYYcTRlcwn-xrFZdgj3NYU5_UbF7OZ1kKTwYk2VcJ7FH3nfLQHncTlYfPDQjXDxW5CR54zPJH_g==&xkcb=SoBt6_M3sjY8J_xUJJ0NbzkdCdPP&camk=f416UQcMBpDunKbEO2z0wA==&p=6&fvj=0&vjs=3",
    "description": "Associate Business Systems Analyst\nCorporate Headquarters\n12575 Uline Drive, Pleasant Prairie, WI 53158\nAre you skilled in communication, collaboration and coordination? Then you belong at Uline - one of the largest freight shippers in North America! Join our Logistics team as an Associate Business Systems Analyst, using cutting-edge analytics to help us fulfill our customer promise of same day shipping.\nCareers Packed with Potential. Backed by 45+ years of success, Uline offers opportunities to grow your career with stability you can count on.\nPosition Responsibilities\nAct as liaison between Logistics and other departments regarding planning, testing and deploying Logistics Systems updates.\nAudit and maintain Logistics data including lead times, routing, rates and carrier information.\nBuild relationships with internal and external business partners to resolve issues.\nDocument project timelines and action items as well as provide updates to management.\nDevelop and process test plans to avoid production bugs.\nSupport team to ensure system updates and projects are completed timely and accurately.\nMinimum Requirements\nBachelor’s degree.\nProficient in Microsoft Office.\nAbility to multi-task and work on your own.\nExcellent communication skills.\nBenefits\nComplete health insurance coverage and 401(k) with 6% employer match that starts day one!\nMultiple bonus programs.\nPaid holidays and generous paid time off.\nTuition Assistance Program that covers professional continuing education.\nEmployee Perks\nOn-site café and first-class fitness center with complimentary personal trainers.\nOver four miles of beautifully maintained walking trails.\nAbout Uline\nUline, a family-owned company, is North America’s leading distributor of shipping, industrial, and packaging materials with over 9,000 employees across 14 locations.\nUline is a drug-free workplace. All positions are on-site.\nEEO/AA Employer/Vet/Disabled\n#LI-MW2\n#CORP\n(#IN-PPANA)\nOur employees make the difference and we are committed to offering exceptional benefits and perks! Explore https://www.uline.jobs/#working-here_blankUline.jobs to learn more!"
  },
  {
    "title": "Business Analyst - Supply Chain",
    "company": "Argus Technical Services",
    "location": "Milwaukee, WI 53208 \n(Martin Drive area)",
    "salary": "$70,000 - $80,000 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0BEgb7KxdPvsVYBSotCUv1II0Ntsd0mUKiJy1NlQYmXkyToZfsrWzyzecSUweVOKF35WUe-O_PBcxSm1PCH3k0Tz3XRD3XNb7IJrFDmI0uIWZYpLCWBPVn6whyzcr0zTk79RKt1uUD-cxJWZN2OX71PYKgqS_ubRwqcddnrnCR6RlUkp193wA8trjDsp-1ywziF3eSknPyDC9tX48F-51l3nFP3CNyD4lewch0rxMxOo3Wjc6vggYKNFkwtuJu0PyQtpgbXQj6U7W18Hou3_FY9HQNiW7MkWtZHpJVAaH8oZHAl0JunnplBk4rftZhdbo777Jc-s0poLH1NDzpRlKllZLhvfQE4sT-Z3x2-ypnZuzq5FBfBM-3ZyQzjd1Dk8SAhfq7VHMpj8_DwLXLSNswVXKjVisitdJbuaxKr43DQmZeMnzueoV_WXM9jTh-Y-REu_vovk7sPTyI6jGBwnykRCULFNUspWfiDvVkxWMVjEkTbkc0Y4UN1nPiWFkNJAj3orDyU9HI_mKD9A-K4SY5Ev-XW9XglBh-YNZgaPCy-0F2G5dd6iP9y9Z98nkNvmw-L9sEmXhrjY0038Wnk_hRccy4lfJWOfToVKAAkLeFeOsTZ2h97q_IF10A629IGf2z_0OZ5A2bmefYs_OnUtDR-OrTt6xVQW0pYdIDvT30ypf-_rL-PD5WDUDUm6re5YUDdCE1whm2UZw==&xkcb=SoCt6_M3sjY8J_xUJJ0AbzkdCdPP&camk=4HOcmqOLYrBIlgI9rs-QEA==&p=11&fvj=0&vjs=3",
    "description": "We are looking for an in-house Oracle Fusion Business Analyst to support long-term business operations.\nWe’re looking for a hands-on Oracle Business Analyst with functional expertise in Oracle Fusion Supply Chain modules to support our transition from NAV to Oracle Fusion Cloud. In this post-go-live support role, you'll serve as a Tier 2 contact—working directly with business users to resolve issues, troubleshoot process problems, and ensure Oracle is being used to its full potential across our supply chain operations. This role is about understanding how the system works, not how to build it. You won’t be coding or configuring integrations—you’ll be the person people turn to when they need answers and functional insight.\nWhat you’ll do…\nServe as a functional point of contact for Oracle SCM (Inventory, Procurement, Order Management, MRP) issues escalated beyond our internal help desk\nSupport users across Supply Chain, Manufacturing, and Logistics by helping troubleshoot transactional or process-based system issues\nCollaborate with business teams to understand workflows and ensure effective system usage\nPartner with IT and our Oracle implementation partner (Peleton Consulting) to support business process optimization\nTrace issues to root cause (e.g., “Why didn’t this PO generate?”) and guide users through system navigation and resolution\nDocument common issues, provide internal training, and help teams become more confident using Oracle Fusion\nWhat you bring…\n5+ years of experience as an IT Business Systems Analyst, ideally supporting Oracle Fusion or Oracle EBS SCM modules\nFunctional understanding of Supply Chain and Manufacturing processes\nExperience with post-go-live support and system troubleshooting in a production environment\nFamiliarity with Oracle processes such as P2P, inventory transactions, receiving, and work order planning\nStrong communication skills—you’re comfortable working directly with users and helping them get the most out of Oracle\nPrior experience in manufacturing or CPG environments is strongly preferred\nBachelor’s degree in business, Supply Chain, Information Systems, or equivalent experience\nThis role does not include…\nCustom development or backend coding\nIntegration design\nLevel 3 system support\nWhy you’ll succeed…\nYou are a people-oriented professional who thrives on building relationships and working with others.\nYou bring structure and clarity to task-oriented projects, ensuring everything runs smoothly.\nYou have a problem-solving mindset and strong attention to detail, allowing you to find and fix inefficiencies.\nYou communicate complex technical concepts in a clear, user-friendly way, making systems accessible to all.\nYou are energized by collaboration and teamwork, always looking for ways to support and connect with your colleagues.\nTeam player with excellent communication skills ready to work hard to ensure the whole team succeeds.\nWhere you’ll work…\nThis is primarily an on-site role, as in-office collaboration is essential for team engagement and project success. Flexibility to work remotely may be available when business needs allow. Additionally, you may be required to support our facilities in Jefferson, WI, and West Milwaukee as necessary to ensure seamless system operations and business continuity.\nPerks…\nOpportunity for training and career advancement\nPaid Time Off and Floating Holiday of your choice\n401k & Roth with company match and fully vested on the 1st of the Month after Hire\nFantastic benefit offering starting on the 1st of the Month after Hire\nJob Type: Full-time\nPay: $70,000.00 - $80,000.00 per year\nExperience:\nOracle : 3 years (Required)\nAbility to Commute:\nMilwaukee, WI 53208 (Required)\nWork Location: In person"
  },
  {
    "title": "Business Application Analyst - CMDB",
    "company": "Liberty Mutual",
    "location": "Columbus, OH",
    "salary": "$66,000 - $125,000 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0DepOg7TDxGKZPUDK5aMJwXQn2YTYIL3PVVUU2ENsp1lRUjI0nRYCSPuDtxtiPgr7T-LZHylfK4jh78QunEO9Dw_TGZsoXG1dDXnCb1RDtChP0MfhsSPfuXuMnSV1yq4pekWdy-WwlTfRuBKwex1F00psBbHULU9NEaMg54CLAcUShuWBTH8R6mM9sunBj_47zku8JD5Q9tCpmPrO5bjnMJlg-FZq6gxReiSDs2GqhSDIGxx9elj_o3Gr9mxgu_no_cVeCzNFKJ3C_JP-Rj6_xixtwvoJd-7MbW1Ne6qyuEoiMLl9sL1hrGx1x-SCKCqrVWhIP3lspqcFslj3R5_lfUOsRqou6TkCjZYZgBuRx7sSxhRvz4U4v8kw6Igu2FTnQSg6R-HvNoDsEDL96jIXr_eWqlvi2CDu89MAOfG7nGgy59XSuQ85P5_jMgDn8qd6ch4uKsBE0zTa8EZjNM6d5fGDRROPSSFObk_w6hrvUVcKS23mf2-GV8GulomMGrSunN8beDE_RUQvRmbv8tYQKfiqVuvUk9ACDvjvnW5m0cVPKCDPUFPUB9gFPaU_Ktj1WArlCuPSrNfCQbj3KTnhFnMhU0vSGt5KJnmveaQO9a-KwwzzXq5EVDDL_0Dx857IP9hnc-k_aqRde1ab5Gyd1cyQ42XW2nYTS34ToWvVo7cz1oVZMhFLNMoZdLMPJqYYLsue0libo_Ls4zmmMTPwRd5UAXRFP59KYuZlMRVLxTxhI5vu44zDf3vITkEPN_CAuKI06Ak3TaZmCaFnALe8lpkCjlEJiXjf-cSNbWi5qvxl1ybmnKxfunK_nlSocEjPMvXagY_aqpOFdxDGRWGc7fpnBbRq8zLCuRUau_hg8E2nxaJzP5xywEJuSbePjLKrnIQHgI-ZUsFmla0g80h24Gl4usq2KYHHFkurnHIVlZ_evvPVFOUV-G_PzoIB22K9DBsrXdVGydcC_DAe-HP0ea&xkcb=SoDw6_M3sjY8J_xUJJ0ObzkdCdPP&camk=nUmJqO2E8rhk7fk8d7xYKA==&p=5&fvj=0&vjs=3",
    "description": "Description\nJob Description\nOversees the management and accuracy of Business applications configuration items, including relationships to other CI’s and processes for the purpose supporting critical business functions and decision making for the Company. Reviews and evaluates data for opportunities to improve accuracy and completeness and enables use of data by many technology disciplines, such as Application Mapping, business risk, chargeback, vulnerability management, cybersecurity, etc. Researches and promotes data management best practices. Works as data steward to collaborate with data office to ensure standard approach for data delivery to stakeholders. Collaborates closely with configuration manager and Config and asset process owners to understand, implement and monitor data quality KPIs and provides feedback on improvements.\n\nResponsibilities\nImplement and monitor key performance indicators (KPIs) and trend data performance against these metrics.\nReport on data performance to management and recommend corrective actions as needed.\nIdentify process improvement opportunities using data analysis, stakeholder feedback, and industry best practices.\nMaintain strong stakeholder relationships, maintaining a culture of collaboration and trust.\nDefine, document, and maintain the data management framework, policies, and standards.\nParticipate in cross-functional teams to implement process enhancements and change initiatives.\nParticipate in a culture of continuous improvement and process excellence.\nParticipate in strategic planning and contribute to organizational goals through process innovation.\nQualifications\nBachelor’s degree and minimum 3 years working with management of IT assets or related experience\nStrong data analysis and problem-solving skills required\nStrong communication and interpersonal skills required\nExperience with data management preferred\nKnowledge of ServiceNow or CMDB concepts preferred\nKnowledge of Application Portfolio Management concepts preferred\nExperience working in a multi-organizational project preferred\nAbout Us\nPay Philosophy: The typical starting salary range for this role is determined by a number of factors including skills, experience, education, certifications and location. The full salary range for this role reflects the competitive labor market value for all employees in these positions across the national market and provides an opportunity to progress as employees grow and develop within the role. Some roles at Liberty Mutual have a corresponding compensation plan which may include commission and/or bonus earnings at rates that vary based on multiple factors set forth in the compensation plan for the role.\n\nAs a purpose-driven organization, Liberty Mutual is committed to fostering an environment where employees from all backgrounds can build long and meaningful careers. Through strong relationships, comprehensive benefits and continuous learning opportunities, we seek to create an environment where employees can succeed, both professionally and personally.\n\nAt Liberty Mutual, we believe progress happens when people feel secure. By providing protection for the unexpected and delivering it with care, we help people embrace today and confidently pursue tomorrow.\n\nWe are dedicated to fostering an inclusive environment where employees from all backgrounds can build long and meaningful careers. By actively seeking employee feedback and amplifying the voices of our seven Employee Resource Groups (ERGs), which are open to all, we create an environment where every individual can make a meaningful impact so we continue to meet the evolving needs of our customers.\n\nWe value your hard work, integrity and commitment to make things better, and we put people first by offering you benefits that support your life and well-being. To learn more about our benefit offerings please visit: https://LMI.co/Benefits\n\nLiberty Mutual is an equal opportunity employer. We will not tolerate discrimination on the basis of race, color, national origin, sex, sexual orientation, gender identity, religion, age, disability, veteran's status, pregnancy, genetic information or on any basis prohibited by federal, state or local law.\n\nFair Chance Notices\nCalifornia\nLos Angeles Incorporated\nLos Angeles Unincorporated\nPhiladelphia\nSan Francisco"
  },
  {
    "title": "Manager, Data Analytics & Reporting",
    "company": "Vanguard",
    "location": "Charlotte, NC",
    "salary": "",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0BWQs_M7ZA8XLbIFWVw-PYcVVEPryqVLyWhKaEKPskHy2YkbHyHJDwB_nHc5A6JaMTjHj78uRvcq0CrcXSZNiO07ifuZTehdZhDvKKZBEOZme6v8HdvRmjaE3uVbcOgDJx1hLJ3FVK4oH47XdlW_hnjkmFbrQa_y2R_SfCo9o5EvhLcoxDiTP6h4mbpHxt1LvDBBi36Kbw0N4E8jR09elS2595zNOcqqohQZ2tyX97lC55rRVoeg4khHFv5WDlp2VmjnlGfqIxFmnIOaCVO5VIm1hvHUpSmubn_TFClQ3NStwvPvCnlbrb7XC1yBGVMYc3ZuyEs5UrWjBeYrJuGMz0lbTQJQg86ehbTEMJR-gf2G8QDeszJhO2zXkGcQrSB_yobP1u_O0hu4AL7lbNKtilKfwzlpanTX-EJQF_PP2pEbvg9bto2DDL0iSgcBTM7DUweMS0lG-iRTn_iqQAqKdbJ7gOv1Nya3eVzOHuo00cwpnSkyxiJBIBOCMxrJvZiRL1dbilOkGX7-SwR2yHWtmJIlZ05-wKz4xpxZtpG3PcJIC42e28pam2qHmdXJHD7LZ2dsCr9jwBH2Zc_FBrp_OcgdR5tCEiJrdWx1B_x5NO4aCst0aSvAbQU92Gog0ouOQVAPMGo7Yyk-WAXJoEKP_wvP56aEEOzh5wfsE2mnWW_zH86CFkFp4KVFWhPmMDNIqxbrZZ_lmUcAhceM-9t_YLt2q4FQl0FsVNQjV7xG0iLpMN5HnCDVySrOkWQVAaDewxuVbGV8-3Itj2hWaoi7hAvm66kNIU8UBsFcSVd48uTXiEP-_4-JpEBuhDzEEqb66V3KsDo85q5UtYVInqnfC96MAXlsgZ6Q6IxWsU__z375LFp5FLG_uv2iIcf8_iRXqiAwPcLJo7Cas8uhnJ-RSpuzFFhjwK025xTpk_BeGN1qAGXS-d6uiDD4hCDP09lMuqWxr2fhwZnX3J481njZ5b0UFZN4siFPR1b_TJSqcf-_EgF3Eq7eUIR0p1KODMLZyjF1HCggdW5NZ3XGN1CYLIkM2CYQAaaLP55KzbT6zfJqdO7N-yFPwxpwPFOq-GJJhDXJg65ohQxElD0l7KVAnstaSHmfQ5kaffQYDkPJt8MZnDutXYnefUdH7AOOgBcp82QUzqeQqMpNlZW4jLNwDHisPPyaAopYkPEw8jTMOHnN2uFBiGC55iEjVQjx7EwPeWSeDK0PnRQA2a_0_LjjPlrMzGFJFRullqfB7o1Z7yOhFqXrgBrzD7voreR3AYyb1dBdh67SzGt1GGU08zot0lIo_hs6rxIX3wd72qg_dyUIyD_JUx_i-hhRiC2YYBn5m03SHeKnW2fIQ==&xkcb=SoB-6_M3sjY8J_xUJJ0JbzkdCdPP&camk=G42KULXkIwN4Jhi8z6A3Ow==&p=2&fvj=0&vjs=3",
    "description": "In Vanguard's Digital and Analytics (D&A) department, our goal is to evolve and enhance our clients’ digital experience. The Data & Analytics team for Personal Investor drives strategic decision making & is embarking on a critical transformation to drive D&A’s vision of attaining a world class CX. CXD’s vision is to take a stand for our clients and how they experience Vanguard. CXD promises to create meaningful world-class experiences that exceed client expectations, positioning Vanguard as the trusted financial partner and industry disruptor. Data and analytics are at the heart of activating this vision, enabling us to enhance the client experience, and improve and transform our suite of digital products. As an Analytics Manager within CX Alpha, you will play a critical role in leading a team of analysts responsible for delivering a portfolio of strategic projects that involve gathering data, experimentation, deep analysis using descriptive and predictive analytics techniques, visualizing data to deliver actionable insights, influencing business leaders using consultative skills and analytic storytelling. You will interact with a series of stakeholders within our Product, Technology, Finance, UX, Analytics and across the Personal Investor business to transform analytics insights into recommendations for new solutions that improve client investment outcomes for our investors. If you are a strategic thinker with a passion for driving innovation and a proven track record in building analytics strategy and managing a team of analysts to deliver complex initiatives end to end in a cross-functional environment, we invite you to apply for this exciting opportunity!\nCore Responsibilities:\nIn Vanguard's Digital and Analytics (D&A) department, our goal is to evolve and enhance our clients’ digital experience. The Data & Analytics team for Personal Investor drives strategic decision making & is embarking on a critical transformation to drive D&A’s vision of attaining a world class CX.\nCXD’s vision is to take a stand for our clients and how they experience Vanguard. CXD promises to create meaningful world-class experiences that exceed client expectations, positioning Vanguard as the trusted financial partner and industry disruptor. Data and analytics are at the heart of activating this vision, enabling us to enhance the client experience, and improve and transform our suite of digital products.\nAs an Analytics Manager within CX Alpha, you will play a critical role in leading a team of analysts responsible for delivering a portfolio of strategic projects that involve gathering data, experimentation, deep analysis using descriptive and predictive analytics techniques, visualizing data to deliver actionable insights, influencing business leaders using consultative skills and analytic storytelling. You will interact with a series of stakeholders within our Product, Technology, Finance, UX, Analytics and across the Personal Investor business to transform analytics insights into recommendations for new solutions that improve client investment outcomes for our investors.\nIf you are a strategic thinker with a passion for driving innovation and a proven track record in building analytics strategy and managing a team of analysts to deliver complex initiatives end to end in a cross-functional environment, we invite you to apply for this exciting opportunity!\n\nQualifications:\n10 years related work experience in the data and analytics field\n4-6 years management experience\nExpert level skills in the following suite of data analysis tools: Data Extraction languages such as SQL.\nProficiency with relational databases or Big Data platforms, Data Analysis packages (Python, R, SAS etc.) and Data Visualization packages (Tableau, etc.)\nExtraordinary analytical skills, coupled with the ability to form hypotheses and draw meaningful insights from disparate data sources. The ability to understand data, process it, extract value from it, visualize it and communicate insights to audiences of various backgrounds, including senior management.\nSignificant experience with advanced statistical and machine-learning methods such as: regression models, propensity models, segmentation, optimization, experimental test design, time series analysis, cohort analysis, Bayesian methods, decision trees, text analysis, etc.\nStakeholder Management experience\nPreferences:\nUndergraduate degree in an analytic/quantitative field such as: Applied Mathematics, Statistics, Economics or related analytical field of study or equivalent combination of training and experience. A graduate level degree in an analytics focused field is strongly preferred\nSpecial Factors\nSponsorship\nVanguard is offering visa sponsorship for this position.\nAbout Vanguard\nAt Vanguard, we don't just have a mission—we're on a mission.\nTo work for the long-term financial wellbeing of our clients. To lead through product and services that transform our clients' lives. To learn and develop our skills as individuals and as a team. From Malvern to Melbourne, our mission drives us forward and inspires us to be our best.\nHow We Work\nVanguard has implemented a hybrid working model for the majority of our crew members, designed to capture the benefits of enhanced flexibility while enabling in-person learning, collaboration, and connection. We believe our mission-driven and highly collaborative culture is a critical enabler to support long-term client outcomes and enrich the employee experience."
  },
  {
    "title": "IT Business Systems Analyst",
    "company": "GreenState Credit Union",
    "location": "North Liberty, IA 52317",
    "salary": "$103,793.30 - $121,346.42 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0ACemg3BtaIROX2sASKolJGXuQQtG2xGuWSbI_iNztaJAU6JDWBGqmgNHluvE8aGMupYKW8zMJ_--XiipFSCEr08NBuXN3JaZWnSAdDn5GL6snCaks6ZKxNSXYNQZRj3M8WfEiYG3h0hEBMJpTXnEvwHj7P3a8HWQ11a2f8M2du2idwEZblGcvyFqsXKVcClsMqDpoG7L3_fRV7f7Eyxi02atvTDx3TpTCNHkaoq-mhA3mL1wOKH551twcqDfnEcu18c52U2OmmgWgtAm4fpj_jiIXvR5SrwD7nns1nsHzb4cvQNYCc1CEH8kCe3H-Fo2NUPJe2mdk62fYkfDuiWM714ngokqzwXTVsTSg0Bp4cXbcXS_WIEBjW5i6moaLXbfw5_Qu9EAzsLepDUzsodNpmJMlyRgpHU5D9XG8jBbX82kvCQLB_JTInN4UVFH_cbccYqGGFxzv7XnWTQqGiVFgf7yKohLb16AqoU5R82uUEP4_YnNVl3XQDB6pLWu89PPjZBPv7L9qtMcUsgigSJlem4a-7TlqlnjMiAfO71_J19WGunGmZ5u19Etz85-BvdqF1M7AmRf8vicSTp-JDI_85GV9MST7x9NTtTZ4Wx8Dw7BxJFAuNCBJg&xkcb=SoCE6_M3sjY8J_xUJJ0CbzkdCdPP&camk=H-lBaXMUocIY1QPjUs0isg==&p=9&fvj=0&vjs=3",
    "description": "GreenState Credit Union\n\nIT Business Systems Analyst\n\nUS-IA-North Liberty\n\nJob ID: 2025-4309\nType: Exempt Full-Time\n# of Openings: 1\nCategory: Information Technology\nGreenState Credit Union\n\nOverview\n\nINFORMATION TECHNOLOGY:\nGreenState’s Information Technology department adheres to the corporate values and acts as a business partner who understands the needs of the business, enables business units to meet strategic objectives through technology, and provides employees and members with quality technology platforms that are always available, always relevant, and always scalable.\n\nPOSITION SUMMARY:\nThe IT Business Systems Analyst is responsible for the facilitation and gathering of business/functional requirements and support of systems, services and applications that help drive business decisions and outcomes within the organization. Support strategic initiatives and drive the standardization of tools, artifacts, and process documentation. Identify and implement improved system solutions and processes to increase efficiency and overall productivity within as assigned area of responsibility. This includes, but is not limited to, daily operations support, host interfaces, release/system testing, job scheduling, online banking integration, optical integration, core testing, validation, and reporting.\n\nGREENSTATE CULTURE:\nAt GreenState, we exist to create lasting value for those we serve. We do this by putting immense value into our employees, members, and communities. We empower our employees to create endless opportunities, which will then impact the lives of our members and enhance the vitality of our communities.\n\nSalary range for this position is $103,793.30 - $121,346.42 with a progressive benefit package.\n\nResponsibilities\n\nESSENTIAL DUTIES AND RESPONSIBILITIES:\nPerforms essential duties and responsibilities in the following areas which may include, but are not limited to those listed, and are subject to change:\nAdheres to the Credit Union's core values and Service Standards in carrying out GreenState's mission and vision.\nDemonstrates a positive member service (internal and external) focus at all times.\nDemonstrates teamwork in all interactions with coworkers and in the completion of all duties and responsibilities.\nEnsures confidentiality of member information.\nSupports a diverse and inclusive work environment.\nIdentifies, promotes, and evaluates idea driven solutions and innovations.\nWork with complex information systems and develop or modify existing systems through analysis of business and user needs.\nAnalyze business and user needs, document requirements, and identify solutions to new and emerging business processes.\nIdentifies process strengths and weaknesses; researches and recommends areas of improvement for overall productivity and efficiency, defines, and implements plan of action.\nAssists with periodic testing and implementation of contingency plans to ensure availability of applications in case of system failure.\nParticipate in systems / technology requirement gathering sessions for systems integration, update, and configuration.\nServe as the expert on business and user requirements gathering and lead client sessions.\nProvide guidance and support to the business analysis team while acting as a subject matter expert, providing product expertise and leadership on the engagement.\nAnalyze and define systems scope and objectives based on both user needs and a good understanding of applicable business systems and industry requirements to produce functional design specification documents.\nDevelop and implement software/system scripts and integrate workarounds to provide fixes to defined technical issues.\nAnalyze and review test plans and perform testing of software / technologies following development and configuration stages, validating test cases, and ensuring full coverage of requirements.\nFacilitate and participate in team quality reviews of requirement artifacts to ensure requirements are complete, consistent, comprehensible, feasible, and conform to standards.\nAssist the various teams across the organization with problem resolution while prioritizing and gaining approval for defined requirements.\nAdheres to the change management process for all changes made to core system(s).\nAssist in training of new employees.\n\nQualifications\n\nJOB REQUIREMENTS:\nCollege degree in computer science or business management, or equivalent experience.\nMinimum of 5 – 7 years in an individual contributor Business Analyst role.\nFinancial services industry experience preferred.\nSalesforce experience a plus.\nPrefer experience with Jack Henry technologies, specifically Episys, Synapsys, and Synergy.\nRequirements gathering and documentation experience.\nExperience working with configurable enterprise systems.\nBasic knowledge of PC software and systems; technical aptitude; and desire to learn.\nAbility to perform job responsibilities with discretion and judgment.\nStrong organizational skills and ability to follow up on assigned tasks and document activities.\nAbility to work with highly confidential information in a discretionary manner.\nGood analytical skills with strong verbal, written, and interpersonal communication abilities.\nAttention to detail and a high level of accuracy.\nAbility to resolve problems effectively and efficiently.\nAbility to complete tasks with minimal to moderate supervision\n\nReporting Relationship\nThis position reports to the IT Director Analysis and Administration.\n\nSupervisory Responsibilities\nThis position is not responsible for the supervision of other employees.\n\nEqual Opportunity Employment Statement\nGreenState Credit Union is an EEO/AA Employer. We strongly encourage all individuals to apply for openings with the credit union. #LI #ID\n\nPI278084504"
  },
  {
    "title": "LTSS Provider Data & Operations Analyst",
    "company": "Professional Management Enterprises, Inc.",
    "location": "Indianapolis, IN 46204",
    "salary": "Contract",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0CT_41X6VjUpnT8D56nJKKlXKOzVmlgeJRRagbQP3WK2zmLUsaWqBRQaBRGfKo9iDJLiV4RBPXrmsnAgPB0pCfC0B06K5qbXBL4-Eup1PwHZr1mLyGcMZ5-zUQvHvYK8Olx9cYN3q0QIOSex1G16fgFgJDgl3lHxXJ9goCsBl_GZfx0PbZOdu6mCo6xcso6Nr0YOZ4fRoI9eOr6z7EyUfWXiYKfHbz-bogysZDhMEh671b5z6EPgvI0dNpP3a94S7y1DvfPhav05CRV_A1umIz3qoPVfnh54uh4gAp3Oee22TuIVWh_gzRB1n5Y2IEm9Fm7TwJbd4iv0yLbq1jsTznwYIMj0chNia7LKtR4MkRLBlceKtL67cuo0mCih6l_N6Rj_EEky8Hjjy_MrfnzID_vS-FTbd6jdhKy6pJcW_PofZ5yW1bOqSXAQIEPjX8oAjYAtK6tBfYp5GCv9y5Ju7lDO8_0xbU9GmCNNQQyB0zhs3r1UeN0heDm8Dq35LlXSX1gA0xht5mL8BORNhWNCh83tAJd-g7t1X3O-qJJUWZDzvvl78svnj1wSvs6o_5IN-6mJaUsh2OpJ7PYjhfM5JHrIn0mLxbGVOBsL89u03vQ9UxENaiw4jpinNTqtD94Cixu1G7WZmPXC0A71wL_v1uk&xkcb=SoDK6_M3sjY8J_xUJJ0IbzkdCdPP&camk=H-lBaXMUocLJvS_7jWDFtQ==&p=3&fvj=0&vjs=3",
    "description": "Title: LTSS Provider Data & Operations Analyst\nLocation: Remote within Indiana 25% Travel\nHours: Standard business hours M-F 8am-5pm\nBenefits: Health, dental, and vision benefits, 80 hours of PTO, 10 paid holidays, 401k, and supplemental insurance\nAbout the Role\nAs the LTSS Provider Data & Operations Analyst, you’ll be the go-to expert for ensuring the accuracy, integrity, and optimization of provider data that powers our Long-Term Services and Supports (LTSS) network. Your work will directly impact how providers are onboarded, supported, and connected to the individuals they serve.\nYou’ll analyze complex datasets, resolve data issues, improve processes, and work closely with both internal teams and external partners to ensure smooth operations and regulatory compliance. This is a role for someone who is detail-oriented, analytical, and collaborative — with the drive to turn data into actionable insights that improve outcomes.\n\nWhat You’ll Do\nAnalyze LTSS provider data to track performance, identify trends, and create actionable reports for leadership and partners.\nConduct regular audits to identify data discrepancies, assess downstream impacts, and implement corrections.\nBuild dashboards and visual tools to support decision-making and monitor provider network health.\nServe as the Subject Matter Expert for LTSS provider data load requirements, ensuring accuracy and consistency across systems.\nPartner with LTSS Provider Relations leadership to make provider data updates and resolve related issues.\nMaintain alignment between Facets, SPS, and other downstream systems to prevent data conflicts.\nManage and resolve provider data tickets submitted by the local LTSS Provider Relations team.\nCollaborate with operations teams to improve provider data workflows and service delivery processes.\nWork closely with Provider Data Solutions (PDS) teams to align policies, procedures, and desktop processes.\nLead provider data review meetings to discuss audit results, upcoming changes, roster submissions, and DART loads.\nRequirements\n\nMinimum Qualifications\nBachelor’s degree in Health Administration, Data Analytics, or related field (Master’s preferred).\n2–3 years of experience in data management, healthcare operations, or similar role.\nProficiency in Excel and experience with SQL, Tableau, or similar data tools.\nUnderstanding of LTSS programs, provider operations, and related regulations.\nStrong communication skills and the ability to work with multiple teams.\nExceptional attention to detail and a commitment to data integrity.\nPreferred Skills\nHealthcare industry experience, ideally with LTSS or Medicaid programs.\nExperience with Snowflake and/or advanced SQL queries.\nStrong Excel skills, including pivot tables, lookups, and data modeling.\nAbility to manage multiple priorities independently.\nProject leadership experience."
  },
  {
    "title": "",
    "company": "",
    "location": "",
    "salary": "",
    "url": "https://www.indeed.com/viewjob?jk=a1b2c3d4e5f67890",
    "description": "None"
  }
]