[
  {
    "title": "Director, Data Scientist - Apollo/Card Data",
    "company": "Capital One",
    "location": "McLean, VA 22101",
    "salary": "Full-time",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0C3j_zLGvpMLCdiZ0WC46XqVTA1VMZzOzKXPhAXwYlrNc2ZimNTpf2_4MHwNa_erOwFyaDJAylqijmgT-c4A03xyTax8YIokjlGfYoRPZNf7hi1sMOe4UBasf51QkGBQ4pYWNPSSiRZBGWbgX2RYEkfjk6CqGsXwmNunA_3e9zqYONQLpLeV5BL4YUzfnQpESul0jIOeIWLwp7ybBF0uIdF4BBU0A1vvGmdtV6fvX44hEkyPnZVBIKEIQcBBsTVY62aMMNLFxSNsN3xRNCPrn_ltduM7V86rAJBYoeiQI9yJKO36MUqGw0UdOlcxaXfsyWG50ihvZtFxLpDSU_QIDmoJGma5c7ZdwvZ5e66JGumxwkJL0ZPHd6WpYeBmOU67dLs4CzU4T3uiY7ANTLOoRtYiCkgspodQt58wPb9GwV9iA3rDfNvs0nAsnp_-R5DGwDduowT4UmbQBL2AkSmqzwFdnEwOGRON-vx2N0UdFYG4_qXrJFERerLiaADmnXb2xkyKKtaneqEne3E_dhQGKQvyTmEfjEB5s5VvwT-Sr_fkN78wAb9nscGkzqOrFpmzOPfTAVd4fwyJHWjlcsCKeNWuz-QgpxJh0ukJT1kfuho0jBfT9WPksqRtG3UZm_fwLwFPOz9y2teGdFOWUMY2M0mS8JcE9hQA2_oV2LQlPcLk-Mucr1bNi4iXJ9Ap9rK8Eb68qDEIzzDRsEA4BBupbVW2ozzpiG1ffGu8-jyPTGdc10eCQI4uFvK92fzOzy_QMhKFLv5sK0fXpXhrkR7KMl0iECrA9xD4lqnWADGDUBxCu9kzEw8mxExin6H9osyH5P-Bd72Fz9fl3fRSKvMOFX4erQ8UJQVJHsi5l5bCYx4xWC3QqhsRvQgbwxP2Y1KLvIu0J9issRCuVnP0wHZX53UZyDarxsN9ayTA77KWKxy46dLRqQyFKgqOJxbHXQ4xqG8u6UAvjywYHVbDoSUesc3lulXxd7m4uwWkvW608rF_jb1agdq_sVR-Y2ZRK472jFY2obTmaG91azAupGjlL-VIDHzOA4wpKo34nCEgq9LAtGCObLr9r0lsc2ZGl4b-iWB-9V7OJDhDZ_gCEHpNhycf2HTqNcmuEYx6r5rJ8nLrli2D5x38w6lIMrkHpKAViwtLJQglp0K1Gyt_25o5kSOSUl1jewIWbuALAPaBqaGdQ5UEVc9pW28_12VJZMh_Z-urMDOzenxgjNKCzm6D7UkkFK9c4tqyTgLdLmT7jVUZP7Vvr6gwt5LQiUkCsqJkcXgj6IQFRCgotOBQ_tERkWlAlkh0D2Y7z8=&xkcb=SoCv6_M3sjZw1xQpUp0JbzkdCdPP&camk=4HOcmqOLYrByKel4K0fjog==&p=2&fvj=0&vjs=3",
    "description": "Director, Data Scientist - Apollo/Card Data\nData is at the center of everything we do. As a startup, we disrupted the credit card industry by individually personalizing every credit card offer using statistical modeling and the relational database, cutting edge technology in 1988! Fast-forward a few years, and this little innovation and our passion for data has skyrocketed us to a Fortune 200 company and a leader in the world of data-driven decision-making.\nAs a Data Scientist at Capital One, you’ll be part of a team that’s leading the next wave of disruption at a whole new scale, using the latest in computing and machine learning technologies and operating across billions of customer records to unlock the big opportunities that help everyday people save money, time and agony in their financial lives.\nTeam Description\nApollo (part of Card DMDC) is Capital One’s one stop shop for authoritative, 360 degree information on US businesses. We are on a mission to build a market leading, business critical Business Data Product and Platform that gives our customers a competitive advantage through information. Our customers rely on Apollo’s data and capabilities to market, sell, verify, underwrite, serve, and protect business customers, often in real-time intelligent ways.\nBusiness data is a complex, multi-billion dollar problem that is poorly served by legacy providers. We are tackling this critical opportunity by acquiring and processing massive amounts of data, leveraging cutting-edge ML/AI to resolve identity and predict valuable features and architecting interfaces that allow our users to seamlessly integrate Apollo into their workflows Data Science is at the heart of Apollo and this role will have an opportunity to shape the next generation of capabilities.\nRole Description\nIn this role, you will:\nLead a team of data scientists and collaborate with machine learning engineers, data engineers, business analysts and product managers to deliver product(s) customers love.\nLead machine learning and data science technical direction and execution (operations, governance, processes and practice) working closely with product management to craft a roadmap and success criterion.\nLean on your deep technical background in graph-based machine learning, deep learning, software engineering and algorithm development to organize, grow and manage the ML/AI capabilities for the product.\nFlex your interpersonal skills to translate the complexity of your work into tangible business goals\nThe Ideal Candidate is:\nTechnical Innovator. You have a strong background in ML/AI and engineering practices with experience in Entity Resolution, Information Retrieval, Graph-based ML, LLM/Embeddings or Deep Learning. You have hands-on experience developing effective data science solutions, while pushing the envelope with state-of-the-art techniques.\nCustomer-back. Product mindset. You are deeply curious about customer needs and bring a product mindset to drive business results, integrating ML/AI design, engineering and execution. You identify high-leverage efforts and the necessary trade-offs to shape a roadmap that balances transformative innovation with time-to-value and pragmatism.\nEmpathetic People Leader. You establish a culture of inclusiveness, cooperation and candor. You’re passionate about talent development, provide frequent actionable feedback to team members, and promote innovation\nStrategic Thinker and Communicator. You love asking questions and pushing hard for answers. You challenge conventional thinking and work with stakeholders to identify and improve the status quo by bringing clarity to big, undefined problems.You set the team vision, and inspire your team and peers to execute towards it.\nBasic Qualifications:\nCurrently has, or is in the process of obtaining one of the following with an expectation that the required degree will be obtained on or before the scheduled start date :\nA Bachelor's Degree in a quantitative field (Statistics, Economics, Operations Research, Analytics, Mathematics, Computer Science, or a related quantitative field) plus 9 years of experience performing data analytics\nA Master's Degree in a quantitative field (Statistics, Economics, Operations Research, Analytics, Mathematics, Computer Science, or a related quantitative field) or an MBA with a quantitative concentration plus 7 years of experience performing data analytics\nA PHD in a quantitative field (Statistics, Economics, Operations Research, Analytics, Mathematics, Computer Science, or a related quantitative field) plus 4 years of experience performing data analytics\nAt least 4 years of experience leveraging open source programming languages for large scale data analysis\nAt least 4 years of experience working with machine learning\nAt least 4 years of experience utilizing relational databases\nPreferred Qualifications:\nPhD in “STEM” field (Science, Technology, Engineering, or Mathematics) plus 5 years of experience in data analytics\nAt least 1 year of experience working with AWS\nAt least 3 year of experience managing people\nAt least 5 years of experience in Python, Scala, or R for large scale data analysis\nAt least 5 years of experience with machine learning\nCapital One will consider sponsoring a new qualified applicant for employment authorization for this position.\nThe minimum and maximum full-time annual salaries for this role are listed below, by location. Please note that this salary information is solely for candidates hired to perform work within one of these locations, and refers to the amount Capital One is willing to pay at the time of this posting. Salaries for part-time roles will be prorated based upon the agreed upon number of hours to be regularly worked.\nMcLean, VA: $263,900 - $301,200 for Dir, Data Science\nNew York, NY: $287,800 - $328,500 for Dir, Data Science\n\nCandidates hired to work in other locations will be subject to the pay range associated with that location, and the actual annualized salary amount offered to any candidate at the time of hire will be reflected solely in the candidate’s offer letter.\nThis role is also eligible to earn performance based incentive compensation, which may include cash bonus(es) and/or long term incentives (LTI). Incentives could be discretionary or non discretionary depending on the plan.\nCapital One offers a comprehensive, competitive, and inclusive set of health, financial and other benefits that support your total well-being. Learn more at the Capital One Careers website. Eligibility varies based on full or part-time status, exempt or non-exempt status, and management level.\nThis role is expected to accept applications for a minimum of 5 business days.\nNo agencies please. Capital One is an equal opportunity employer (EOE, including disability/vet) committed to non-discrimination in compliance with applicable federal, state, and local laws. Capital One promotes a drug-free workplace. Capital One will consider for employment qualified applicants with a criminal history in a manner consistent with the requirements of applicable laws regarding criminal background inquiries, including, to the extent applicable, Article 23-A of the New York Correction Law; San Francisco, California Police Code Article 49, Sections 4901-4920; New York City’s Fair Chance Act; Philadelphia’s Fair Criminal Records Screening Act; and other applicable federal, state, and local laws and regulations regarding criminal background inquiries.\nIf you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation, please contact Capital One Recruiting at 1-800-304-9102 or via email at RecruitingAccommodation@capitalone.com. All information you provide will be kept confidential and will be used only to the extent required to provide needed reasonable accommodations.\nFor technical support or questions about Capital One's recruiting process, please send an email to Careers@capitalone.com\nCapital One does not provide, endorse nor guarantee and is not liable for third-party products, services, educational tools or other information available through this site.\nCapital One Financial is made up of several different entities. Please note that any position posted in Canada is for Capital One Canada, any position posted in the United Kingdom is for Capital One Europe and any position posted in the Philippines is for Capital One Philippines Service Corp. (COPSSC)."
  },
  {
    "title": "Senior Data Scientist",
    "company": "Elevate Patient Financial Solutions",
    "location": "Remote",
    "salary": "$111,000 - $150,000 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0CUg94JDkxsKglIUIH2xB8LXyE9Rdlf65-RmLPzqKbd5cYfLRiwgWMjNCMuV0S8uhEZBpPnKmkKimLQSPKiFXRdwy7rN1u9TNe0tYYZi1VlvbKjKGSo122UIWE6CzshTGTEpbULBIbNRbT-8gQ8H9KtJPhnLhGmvDK5YJwEHmdSX2GPa5sosgyw4PkexhuPEGAhH7FBwYERZcb42V8PoqOOeVgZGwPx_OdOeVjCMhdOKUOAjk7eW0s9b2L7otkEn35Jni42I89aZ8DEvJyeYgj6gkWbeI3nDJlGdZl4YKnbnwIaQxdExjsV5q4IcCsAL1sUbK4IZaPTiifb9LSJILS5TFl9g9GYYgCqQ-k8yd2B2phMzzkH5N41K0y01pFtZc0xFBtGp4CEvHd6mREq5PfNGrpxsxNcqGlAc-vnsxFpQsYEbE2imPPo75XeRgJG5BcDdwlfgbVGQUwMLeYnK7M0-0RyMVtvWG9_J-CqMFSYEFlElc6J2rpp5xU-moU9aPHxjVqBzKp2EulWiyHMSWRNSuDC-5KCgzFFJbcTRzVs4bW2wKXUi9W5Gn8IFm6EBmOBz0DHECtUssMY09bxIZ16Km6FBSyUY5N8yRil-Pf5BtGSk4GZzD99vOmAJInTyO5L-b9ItNIjkpiEwxrbKj-QphvEiXGC5CDZDtBzR3ijSBHe-dpgAKRF-RzywWcQdRYHiYmFB3RCj8_IUalzFBXD2eMQJPt1vACvVhGYEnPFRg==&xkcb=SoCG6_M3sjZw1xQpUp0LbzkdCdPP&camk=4HOcmqOLYrBM6c1vAPTEWQ==&p=0&fvj=0&vjs=3",
    "description": "Elevate Patient Financial Solutions has an exciting career opportunity available as a Senior Data Scientist. This position will be full time, remote position. The Full Time schedule for this role will be Monday through Friday schedule, 8:00 AM to 5:00 PM.\n\n\nElevate Patient Financial Solutions serves hospital and health system clients’ revenue cycle management needs by helping patients connect with potential coverage and resolving complex claims. In order to improve outcomes for our healthcare clients, Elevate is implementing a full data and AI program to increase the reach of its services, driving business growth through the application of modern data science methods. Elevate seeks a Data Scientist to contribute to and drive the development of data and AI initiatives across the enterprise.\n\nEssential Duties and Responsibilities\n\nIn this role, the Data Scientist will be responsible for:\nHands-on-Development of Machine Learning Models, LLMs and Data Products\nOperating as a member of a cross-functional team including operations, analysts, engineers and development vendors.\nMonitoring program performance and impact – assessing changes in patient interactions, staff performance, and healthcare provider client account performance, and designing and recommending program changes as required\nR&D of new AI applications to deliver the art of the possible to business leaders.\n\nQualifications and Requirements\n\nTo perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or abilities.\nPreferred Bachelor's Degree in STEM related field\n4+ years professional Experience in a data science, MLOps or AI related role\nClear familiarity and comfort with fundamental data science principles (model creation, training, evaluation, MLOps, and internal communication)\nDemonstration of previous close coordination with DBA and dev ops staff is ideal\nProgramming experience with some variety of data science, data management, and data visualization tools; for example, R, Python, SQL, SAS, PowerBI\nFamiliarity with data warehouses, data architecture, and data operations principles\nPrior experience in working with business operations and/or product teams to identify areas of process improvement.\nDemonstrated ability to perform above listed essential job functions.\n\nStand-out Candidates will possess:\nThe ability to quickly understand business process and draw on technical experience to recommend and develop new solutions.\nExperience working with data from CRMs or workflow management tools\nExperience with Omnichannel solutions and personalized customer journey development.\nAn understanding and an interesting Agentic AI and LLMs for workflow optimization and automation.\nBenefits\nElevatePFS believes in making a positive impact not only within our industry but also with our employees –the organization’s greatest asset! We take pride in offering comprehensive benefits in a vast array of plans that contribute to the present and future well-being of our employees and their families.\nMedical, Dental & Vision Insurance\n401K (100% match for the first 3% & 50% match for the next 2%)\n15 days of PTO\n7 paid Holidays\n2 Floating holidays\n1 Elevate Day (floating holiday)\nPet Insurance\nEmployee referral bonus program\nTeamwork: We believe in teamwork and having fun together\nCareer Growth: Gain great experience to promote to higher roles\nThe salary of the finalist selected for this role will be set based on a variety of factors, including but not limited to, internal equity, experience, education, location, specialty and training. This pay scale is not a promise of a particular wage.\n\nThe job description does not constitute an employment agreement between the employer and Employee and is subject to change by the employer as the needs of the employer and requirements of the job change.\n\nElevatePFS is an Equal Opportunity Employer\n#IND123"
  },
  {
    "title": "Data Scientist",
    "company": "Leidos",
    "location": "San Diego, CA 92121",
    "salary": "$85,150 - $153,925 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0CZUO70VSdYKA8PR3jfrSh5ljhqJhfDt0PzQCMubt8cRosbSX75HEeA45s9n5xrWx3leFq6W4-mU0wSZOmJ1q62Tb-y0bLvhKtkbbM9OG8AfEVs0kTqVqf-Fu3Cy9DS4JhYPSl-g_993kaoiFwuuTMEucFUGXl4GY55Upj0AasedTC7hbzO7EVBRjv092bD_IInn5IrRYcwLiDUMxPRS5H7ZmpBfDBmh3A0os6m6DX7VByO3GptdIk6Qgir7FRoKpwqvxZTd7watz76O2vVbpZgwOyA_ZSwedaYHSDn5a4Z8F7kLhSgvCIENqAt-nrdErPX7ahvnf94BxiiKx8wCVoV2DcUOsPg6fRvUr8G3Hm6p_Xb_uPBvdpEKD42LrD9-H7NIBYrMV5n_hTou0e3n40OENm_KNHMjWritahxA0_RxAj1SlaT7UfjjhjOQo3PmB8p_829g1gJn4CCDzEUDPPNqyBP7iPrDMfom7V2ysPPKYIPx70ZwYCO_ft0tmEFZZ27yUWMy8UpcqcUPSaTXM8_m_EFy2CrvHVDgxZ-GioqOPykurnSD3mo3f8LraVPzaj0-lpYZdsp5bGh0KEIbyLW8xfFaAWDmCBpAmi92y85a2pt_lmfj2aRYKJEqMwuufNUqClskxImRVzkisqQrRTOyLENTNQXTysNI6hC9slJ-ciPnYCpSyziYEk3r3N_-jzsaU9jHswPWQc-azaP5PG3l2W1yCXHEA8=&xkcb=SoAy6_M3sjZw1xQpUp0KbzkdCdPP&camk=ethIe0s0hecezcnkRTMseg==&p=1&fvj=0&vjs=3",
    "description": "Description\nLeidos tackles the most challenging national defense problems using advanced signal processing and data analytics. At our San Diego office, we have a dedicated and experienced team of scientists and engineers devoted to squeezing the last bit of information from every data set. We are currently seeking data scientists to join our leading-edge research and engineering group.\nIn this role, you will collaborate with multidisciplinary team members focused on Physics (Hydrodynamics, Acoustics, RF and EO/IR propagation, among other areas) and Machine Learning to design, implement, and deliver cutting edge machine Signal Processing solutions to complex problems of national importance.\nThis position offers you the opportunity to grow and develop your skills in collaboration with our team. We hire people with curiosity and passion about science, technology, engineering, and math and who want to take that passion and turn it into reality.\nPrimary Responsibilities\nIdentify, prototype, and deploy appropriate (off-the-shelf, fine tuning, or custom) machine learning solutions utilizing state-of-the-art methods and in-depth data analysis.\nImplement advanced statistical concepts, algorithms and techniques to extract, consolidate, and analyze unstructured, classified “big data” sources to generate actionable insights.\nCollaborate with a team of other applied scientists, engineers, researchers & program managers to research and develop machine learning solutions to novel problems.\nEngage in continuous learning and development, staying current with the latest advances in AI/ML and data science to ensure fit-for-purpose and impactful approaches.\nBasic Qualifications\nBachelor's degree with 4+ years of prior relevant experience or Master’s degree with 2+ years of relevant experience.\nStrong understanding of machine learning theory, concepts, and algorithms\nProficient in modern data exploration techniques and tools\nExperience developing and implementing machine learned solutions\nFamiliarization with modern AI/ML algorithms and libraries\nFluency in C/C++, Python\nStrong written and verbal communication skills\nRequired on-site full-time work in San Diego, CA\nCurrently holds an active US Government Top Secret security clearance\nPreferred Qualifications\nExperience performing research to develop data science solutions\nExperience implementing and applying advanced physical and mathematical concepts in software applications\nExperience with active or passive sensor data and relevant signal processing techniques\nExperience with Large Language Model (LLM) development and deployment\nFamiliarization with Fortran or Matlab\nIf you're looking for comfort, keep scrolling. At Leidos, we outthink, outbuild, and outpace the status quo — because the mission demands it. We're not hiring followers. We're recruiting the ones who disrupt, provoke, and refuse to fail. Step 10 is ancient history. We're already at step 30 — and moving faster than anyone else dares.\nOriginal Posting:\nSeptember 22, 2025\n\nFor U.S. Positions: While subject to change based on business needs, Leidos reasonably anticipates that this job requisition will remain open for at least 3 days with an anticipated close date of no earlier than 3 days after the original posting date as listed above.\n\nPay Range:\nPay Range $85,150.00 - $153,925.00\nThe Leidos pay range for this job level is a general guideline only and not a guarantee of compensation or salary. Additional factors considered in extending an offer include (but are not limited to) responsibilities of the job, education, experience, knowledge, skills, and abilities, as well as internal equity, alignment with market data, applicable bargaining agreement (if any), or other law."
  },
  {
    "title": "Data Scientist",
    "company": "Context4 Healthcare",
    "location": "Naperville, IL 60563",
    "salary": "$90,000 - $120,000 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0AlozRch3sDGiF150ITcf24mID2Sp8P44QX7beThDGT3YtH4aEEZyuiynHbHlnv771Zdy85OaxdaDCiebv-U3j3flDO8_LBuy21Bc_5LNHSbWspgd-XPMbkM4NroZMDdMmgehkvnwTRibGQDtly4U9NYukR4kKCvW72R8YPppnfVV04ybQaTOSrj5k0qUEvXsrESqbodjrk3B2FDw8de19rJ1KSh2uIxm7PLpbMFjpHUHkjyCTSUCH-lRZfn4k3xZkzVyG5oOrlNRBiE1LnbxI61cesWGMJ54h0EbPTo3O-nIjKMQdat5UnLYULiM9vo5ghtvwK5ZpLbdnBeD8z68dNuCvh8jE4YeISr_jTk1meWmBHfKYJNJj-dfkaVNfv3afBTUbedxKmPbMDqsZcOeyiCbCXkblxy-8y8gj7HxVwvJPMG3Ibop1PhB17DfaLPLhQTZZk8j6tV2GwUaYEU83MyvjVgBT_RCQcE6mUHdzicJYov7gLsq8Qte3Aq0JWfB5yVm0wEuVHVKppQh8JhWSx6pEm969JvnnWaC1I8hVbQOnas3MxtBkjSAvabdxQljFDfqsfn5Y29SJnGhHb4uSS-lYRwtD2QvMVG1BTy82_g6AvgOsbjjFUk4jUbmRKsgBasMQ46GIl0i_5rVlq0zMIf-keIadLGfhAaZH02jF3ww==&xkcb=SoAb6_M3sjZw1xQpUp0IbzkdCdPP&camk=UoKtGZLa3XJw3Ii48MpdnQ==&p=3&fvj=0&vjs=3",
    "description": "Context4 Healthcare, Inc. is a world class employer where ingenuity and passion are welcomed. We are a market leader in healthcare claims compliance, reimbursement, and regulatory solutions. Context is looking for individuals who want to work for an organization that values excellent employees, workplace diversity, ethical conduct, and superior customer service and one that offers challenging opportunities. We value our employees, clients and partners and dedicate our efforts to their success.\nDescription:\nThe Healthcare Data Scientist reports to the Vice President of Software Operations. This position will analyze healthcare claims and demographic data to identify outliers, anomalies and predictive analytics that enable Context to develop actionable reports and dashboards to uncover potential areas of payment integrity concern for our clients.\nThe ideal candidate will also support the maintenance and development of Context 4 Healthcare’s industry-leading Usual, Customary & Reasonable (UCR) fee schedule database products.\nIn addition, the Healthcare Data Scientist will work with other staff members to develop and maintain other Context 4 Healthcare products using statistical models created against healthcare data.\nCandidates must be authorized to work in the United States. Context 4 Healthcare chooses not to employ people who require sponsorship for an employment visa, such as an H-1B visa.\nThe Candidate will be required to work in our Naperville, Illinois office. This is not a remote position.\nResponsibilities may include but are not limited to:\n· Analyzing data, building models, and assessing their quality\n· Cleansing healthcare data, for usability in statistical modeling\n· Model monitoring and performing quality assurance testing of results\n· Ad hoc statistical analyses on designated healthcare data\n· Identifying opportunities to apply statistics to create new products and improve product quality\n· Providing insights on claims trends and performance metrics\n· Analyzing and interpreting healthcare claims data (leveraging access to third party data sources and analytic tools) to identify trends and costs drivers and assist with creating custom dashboard reporting\nEssential Qualifications:\n· Proficient in SAS statistical programming package\n· Proficient in SQL or similar database access query languages\n· Proficient is Microsoft Office Suite (Access, Excel)\n· Experience working with large databases\n· Minimum of five years’ professional experience researching, cleansing, and analyzing large blocks of data, interpreting results, and clearly articulating findings, either in a health payer or a consulting firm servicing health payers\n· Strong interpersonal skills, with the ability to clearly communicate analysis results to non-statistical audiences\n· Familiarity with healthcare claims coding\n· Proven ability to uncover outliers, anomalies and to create predictive analytics in healthcare and benefits related data to identify actionable solutions\n· Ability to multitask, prioritize, and manage time efficiently\n· Bachelor’s degree in statistics, math, quantitative economics, industrial engineering, or a similar area\nResumes not meeting these requirements will not be considered.\nJob Type: Full-time\nPay: $90,000.00 - $120,000.00 per year\nBenefits:\n401(k)\n401(k) matching\nDental insurance\nFlexible schedule\nHealth insurance\nHealth savings account\nLife insurance\nPaid time off\nVision insurance\nApplication Question(s):\nDo you have a minimum of five years’ professional experience researching, cleansing, and analyzing large blocks of data, interpreting results, and clearly articulating findings, either in a health payer or a consulting firm servicing health payers?\nDo you have a familiarity with healthcare claims coding?\nDo you have a proven ability to uncover outliers, anomalies and to create predictive analytics in healthcare and benefits related data to identify actionable solutions?\nAbility to Commute:\nNaperville, IL 60563 (Required)\nWork Location: In person"
  },
  {
    "title": "Sr. Applied Scientist, Prime Video - Personalization and Discovery Science",
    "company": "Amazon.com Services LLC",
    "location": "Sunnyvale, CA",
    "salary": "$150,400 - $260,000 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0C2svMuzE9n6q0Xo3QnQAm3u19FFO5aJ8ndlGbDv5msKCaTOErDQL3tpGNqlrIuMOBaWqvo6U9M1GKUOyixLiqhoFp9TCwi6Kqx7xtwyvdsS-J0YILuLBdqF58XiNEqxjfuhEwaQzDP62y-qRoOn88V8_ty7L-Sd25VhuZN1mPWj2I4CUsnlpQbm1UcPif_caczvw48UUT6KFBlDT_i5KVwpmqp__qd_AvaA9oUdYGG5VAk9AzbrNEU2g5Dx0ArzdZ5KVPLrJqhf5OwF3Pt5NtBjY5hnabu4yk0ikWs2wnICEhKJSfWVODEBPQTkS5Jnk9FUwksnBEVOzp_B71850s4dHAMqkVdN1WtLiP1k9g-rPkJ3-NV1WGf8mvaT81INekzn_zk0cd9wsT0CQCSOZXdXVxJLm3wDSNwL6MgciSdWheaOZezwnpQzyhLlw_BQlDmEhJmVcx6PQfI_VGgkVPg4CrKUmv9wQgUV-hNV--MRpBjGJ14nHyyx97KK_YCIM9JobJo8ioo9tVNNiYcgYPpx4gdKhfoQhfX6GtWSn_pE6tNu30TsGxLelz1Oe-d5RgYOnvasQWMxQbe9hhwlKzV0rD1fR-OiH0RCZYS7ftGTWMgfaHuhpKKwcrXpto2__QRVNDs1Mxf3WTKlYH7yM-TLaMuzE9cUPMRtYcWYctb_9Wp6WQdPZaA6w2nJs3pwUh37-FblEpvGum0ZePV1Elj4Utly9T0Z4EO-6djNc7zU6c4VL5gMnD1XUdEpIgQ8OIP3dhT3vXp14CDYSqOG7x9v0fRyDffQaTdkpD1P8gt2f5A_MfQogDo814t2cVIGdVfPSDtHnyC-Q==&xkcb=SoAh6_M3sjZw1xQpUp0ObzkdCdPP&camk=UoKtGZLa3XLQEqkVW9Yv8g==&p=5&fvj=0&vjs=3",
    "description": "DESCRIPTION\nPrime Video is a first-stop entertainment destination offering customers a vast collection of premium programming in one app available across thousands of devices. Prime members can customize their viewing experience and find their favorite movies, series, documentaries, and live sports – including Amazon MGM Studios-produced series and movies; licensed fan favorites; and programming from Prime Video add-on subscriptions such as Apple TV+, Max, Crunchyroll and MGM+. All customers, regardless of whether they have a Prime membership or not, can rent or buy titles via the Prime Video Store, and can enjoy even more content for free with ads.\n\nAre you interested in shaping the future of entertainment? Prime Video's technology teams are creating best-in-class digital video experience.\n\nAs a Prime Video technologist, you’ll have end-to-end ownership of the product, user experience, design, and technology required to deliver state-of-the-art experiences for our customers. You’ll get to work on projects that are fast-paced, challenging, and varied. You’ll also be able to experiment with new possibilities, take risks, and collaborate with remarkable people.\n\nWe’ll look for you to bring your diverse perspectives, ideas, and skill-sets to make Prime Video even better for our customers. With global opportunities for talented technologists, you can decide where a career Prime Video Tech takes you!\n\nWe are looking for a self-motivated, passionate and resourceful Applied Scientist to bring diverse perspectives, ideas, and skill-sets to make Prime Video even better for our customers. You will spend your time as a hands-on machine learning practitioner and a research leader. You will play a key role on the team, building and guiding machine learning models from the ground up. At the end of the day, you will have the reward of seeing your contributions benefit millions of Amazon.com customers worldwide.\n\nKey job responsibilities\nDevelop AI solutions for various Prime Video Search systems using Deep learning, GenAI, Reinforcement Learning, and optimization methods;\nWork closely with engineers and product managers to design, implement and launch AI solutions end-to-end;\nDesign and conduct offline and online (A/B) experiments to evaluate proposed solutions based on in-depth data analyses;\nEffectively communicate technical and non-technical ideas with teammates and stakeholders;\nStay up-to-date with advancements and the latest modeling techniques in the field;\nPublish your research findings in top conferences and journals.\n\nAbout the team\nPrime Video Search Science team owns science solution to power search experience on various devices, from sourcing, relevance, ranking, to name a few. We work closely with the engineering teams to launch our solutions in production.\nBASIC QUALIFICATIONS\nPhD, or Master's degree and 6+ years of applied research experience\n5+ years of building machine learning models for business application experience\nExperience programming in Java, C++, Python or related language\nExperience with neural deep learning methods and machine learning\nPREFERRED QUALIFICATIONS\nExperience with modeling tools such as R, scikit-learn, Spark MLLib, MxNet, Tensorflow, numpy, scipy etc.\nExperience with large scale distributed systems such as Hadoop, Spark etc.\n\nAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\n\nLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\n\nOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $150,400/year in our lowest geographic market up to $260,000/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site."
  },
  {
    "title": "Data Scientist",
    "company": "ManTech",
    "location": "Fort Meade, MD",
    "salary": "Full-time",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0C_-Eyaxwg4bxD6uh_5jIFBuPkrGxkuLZfa77QnGUab3bLqfQXf7dZcxHXA1gBZBwJVqSCcEtlLC2NehNCQMFCaIj41ZX5zxp8a4r4GSrckcD0hYpAUBPusavAMHS2RU4dWZliOLUi7uGCq06zVjtlT6vXFNR4zr2_zvSh2N7B2mdWWm87NIhIhBPX7JFaQGE7jWOE9vSXcWbLcWtu0hemDYeGDJUnZPs7olrDEK9zLvJZIJf2Cins6pCkWVkGjS1kHA00fAyQjbBaqmD8TNYDWGjCIbxOat-RUxitOKtpiVNodTSZcZ2mxDES0uj7rybP_f8iByWAAUHu2FhxFxmPAIsZYqzTQYSqDYvezzV4A176WjtmPlLRHZP-a4rWfSv0A6dFuwrRL0K4zYVw-s_KOisQ_guYuj0m3lvdud3E5QIjgoILlZOqsKDGI08HtuEbjLcaVJG4Or5x_perYneWR5xNRXZQzZo_pQh8VHBsCb-x8ulLMJUMKX2VO103leV7iJu5b8ZduM0XyCFWd9IdCL8TeZcnjql5HE2OUNnsCoAsGte8wfAAezg0L_wNi19-zwxgmKpWFORkHBgLGdN_yimTQe2OerTiQVaBzOmrZ_p-uCt326rsJw91nPtN6h8iMrlDPN2IidqRK5uguO-VZNGtSOO4HzNQ=&xkcb=SoCV6_M3sjZw1xQpUp0PbzkdCdPP&camk=UoKtGZLa3XKKAQvZKfVv0g==&p=4&fvj=0&vjs=3",
    "description": "MANTECH seeks a mission-driven and innovative Data Scientist to join our team in Ft. Meade, MD. In this role, you will lead the development of cutting-edge machine learning and statistical analytics to support national security objectives. You will collaborate with subject matter experts and customers to guide analytic development from prototype to production, making an impact by delivering high-value data-driven insights.\nResponsibilities include but are not limited to:\nLeading a team of data scientists across multiple analytic development efforts\nCollaborating with customers and SMEs to define analytic requirements and ensure alignment with mission goals\nGuiding the team in prototyping and transitioning advanced analytics into operational environments\nApplying state-of-the-art machine learning, statistical, and graph-based algorithms to large and complex datasets\nDelegating analytic tasks to team members and overseeing performance to meet project objectives\nMinimum Qualifications:\nBachelor’s degree in a quantitative field (e.g., statistics, mathematics, operations research, engineering, or computer science)\n7+ years of experience analyzing datasets and developing advanced analytics\n7+ years of experience programming with data analysis tools such as R, Python, SAS, or MATLAB\nPreferred Qualifications:\nDemonstrated experience leading multi-disciplinary teams in a data science environment\nFamiliarity with transitioning analytic prototypes into production within secure systems\nStrong knowledge of emerging machine learning algorithms and their operational applications\nClearance Requirements:\nAn active TS/SCI with Polygraph is required to be considered for this position.\nPhysical Requirements:\nMust be able to remain in a stationary position 50% of the time\nConstantly operates a computer and other office productivity equipment, such as a calculator, copy machine, and printer\nFrequently communicates with co-workers, management, and customers, which may involve delivering presentations. Must be able to exchange accurate information in these situations"
  },
  {
    "title": "Applied Scientist II, Prime Video - Personalization and Discovery Science",
    "company": "Amazon.com Services LLC",
    "location": "Sunnyvale, CA",
    "salary": "$136,000 - $223,400 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0C2svMuzE9n6q0Xo3QnQAm3u19FFO5aJ8ndlGbDv5msKCaTOErDQL3tox9QQGL4a-k76s16PBx1MiXuMpluOpljI0FreDO68g4DbIe_hokE0f4gHBWvKrcyLvIQiQCbCFAQUCindCGDN_xCV7RaAER-fs1q4VogfAu8o71jt_iXV81DeQZUKUX4wnf2de9KJocr3mpGDRfzKEx2HmCXfm4wORtzL7V3LcvMLSe0IphnQewkSdU_RRlB-VbHh_9__MEWVKTgZ6IrgQh7EeFPkKGbC1QoR93lOc_sFuPjrpScKMnhrHUJVU9aY2JPKnmgW2Eueg7-nLuq_8Alu3m3rPJ-h09ucX6TWhH_QZ52d3j7ECW4rlG0RNAtHr8PYZVNekzznwbMKpp5Lyuhc28Fz9OqvM0sloApYPnSwouw2Y-ZwXgqtbrlFby9Dfdx1Q1bv5SQr4DqGjtHbTCfkoitt8y6FTO1i2ziZxsLy1ZdrPNJmIff59rz3UF9Fxo_kUttTXmfpF54xljlmpqpmYb_ktl6RAEohSzF2cvj-KGsnLk9cfrXL8qOa7b2zqLp3Sk6igJaVelF-bu41SpK_j1X52RtgvAsAMAJEfYBWzsmFDY3-W1evgri38EtKxLs52NplZ5ssdTEZiimXv-eOIL-jlMWl0DSVL40Q2toiIzfjocoGwO1WFy4oRUxmvbawW5uZwJa6i_afqCh1BchKbp70gyJIAiJI6DUl_n-63Qk3E7wCRHpXbJBiDzmvZtjFyCxe_7NRAxO71WMRsGrUiiOyon75j91cPgiUPoPb3-WPqZnIiXMVZRb16fQhz__ugtbPlnzbkjWj0UDvg==&xkcb=SoC86_M3sjZw1xQpUp0NbzkdCdPP&camk=UoKtGZLa3XIdNzMOGgybSA==&p=6&fvj=0&vjs=3",
    "description": "DESCRIPTION\nPrime Video is a first-stop entertainment destination offering customers a vast collection of premium programming in one app available across thousands of devices. Prime members can customize their viewing experience and find their favorite movies, series, documentaries, and live sports – including Amazon MGM Studios-produced series and movies; licensed fan favorites; and programming from Prime Video add-on subscriptions such as Apple TV+, Max, Crunchyroll and MGM+. All customers, regardless of whether they have a Prime membership or not, can rent or buy titles via the Prime Video Store, and can enjoy even more content for free with ads.\n\nAre you interested in shaping the future of entertainment? Prime Video's technology teams are creating best-in-class digital video experience.\n\nAs a Prime Video technologist, you’ll have end-to-end ownership of the product, user experience, design, and technology required to deliver state-of-the-art experiences for our customers. You’ll get to work on projects that are fast-paced, challenging, and varied. You’ll also be able to experiment with new possibilities, take risks, and collaborate with remarkable people.\n\nWe’ll look for you to bring your diverse perspectives, ideas, and skill-sets to make Prime Video even better for our customers. With global opportunities for talented technologists, you can decide where a career Prime Video Tech takes you!\n\n\n\nKey job responsibilities\nDevelop ML models for various recommendation & search systems using deep learning, online learning, and optimization methods\nWork closely with other scientists, engineers and product managers to expand the depth of our product insights with data, create a variety of experiments to determine the high impact projects to include in planning roadmaps\nStay up-to-date with advancements and the latest modeling techniques in the field\nPublish your research findings in top conferences and journals\n\nA day in the life\nWe're using advanced approaches such as foundation models to connect information about our videos and customers from a variety of information sources, acquiring and processing data sets on a scale that only a few companies in the world can match. This will enable us to recommend titles effectively, even when we don't have a large behavioral signal (to tackle the cold-start title problem). It will also allow us to find our customer's niche interests, helping them discover groups of titles that they didn't even know existed. We are looking for creative & customer obsessed machine learning scientists who can apply the latest research, state of the art algorithms and ML to build highly scalable page personalization solutions. You'll be a research leader in the space and a hands-on ML practitioner, guiding and collaborating with talented teams of engineers and scientists and senior leaders in the Prime Video organization. You will also have the opportunity to publish your research at internal and external conferences.\nBASIC QUALIFICATIONS\n3+ years of building models for business application experience\nPhD, or Master's degree and 4+ years of CS, CE, ML or related field experience\nExperience programming in Java, C++, Python or related language\nExperience in any of the following areas: algorithms and data structures, parsing, numerical optimization, data mining, parallel and distributed computing, high-performance computing\nPREFERRED QUALIFICATIONS\nExperience using Unix/Linux\nExperience in professional software development\n\nAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\n\nLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\n\nOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $136,000/year in our lowest geographic market up to $223,400/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site."
  },
  {
    "title": "Applied Scientist – Research Products",
    "company": "Thomson Reuters",
    "location": "Hybrid work in Ann Arbor, MI 48108",
    "salary": "$108,500 - $201,500 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0BGRpAzDInPRkKae7rnz4dRA_iZIAFfYmvzjSCnWpUsBlXuYkrZbb53v_f71cbbJ8PT-dArjVJXuBjccsaNYx2BulcSA2LgH-dlFmz2wFPYFEgtxI283MIa6yxShZT6LbZJTqA-G1CACu0es3c6ZW6fzgva7j_oU31uNgWIjqfc9nXSmBC1AvMEO-n9atiCMAn9u9qetsz5-L-6TpTAlfZ0GLIyhedHIanHCzcFN8r89RvBygtjHJgHtK8yGEVvjKzGMHhzLo8jjG0NwRy7lL3WdDQINnZVbJJEtHdvOnuHzSwVd295z6q27N-0NAVphuf8Ia2NYDX1Vke6O8L73i9XWbFufesaDFZfis_lLjwsTM03aEeKjiydo1QFYawpI5VXqxpbDCVGaeNqU8W7CmfFiHjDxqctNWH8hnq_45uWY2mO8THsXaJopYIdeNujfisxg5bUP1RRhwc78kFZIokZIXg0h7C9THzYWF8dRBxvRPOYsIbzuPkWsHdTPTXAI1HwD-tE3A4OskBQTbWBGI8EK0Bqk_jHy8NTEgih4THnVE0QP-3cZyDx7IfdIrxJACvUXpmQ6CiZRFMGF-41s7tAwod1TZy6JU3jXHmn7EFEIKJpY9-IkiZUptLlBQJevk9RPNLgT_Bnve82l4CKbnQPR0LzPPUNerUV9HKsAsU7DUJJNwbEAGeNgyUJj2T_FmZ0e6STnZcjtVEooTusw0FSZ6Hj6OYHpYIX4ZakhFASIuMdZrF7hyPwqKAC99y7xl0Hy6Pi5g_4VMqrvcaXj2wx2N5OZCKh2VmQe5ISUZxZVJueIn9OocJ0Evmpbp85Ay6dnnNXt1OHMg==&xkcb=SoAI6_M3sjZw1xQpUp0MbzkdCdPP&camk=UoKtGZLa3XKaWKHHP8_a_g==&p=7&fvj=0&vjs=3",
    "description": "Applied Scientist – Research Products\n\nAre you excited about working at the forefront of applied research in an industry setting? Thomson Reuters Labs in the USA is seeking scientists with a passion for solving problems using state-of-the-art information retrieval, natural language processing and generative AI.\n\nWhat does Thomson Reuters Labs do? We experiment, we build, we deliver. We support the organization and our customers through applied research in informational retrieval and natural language processing. We work closely with product and domain experts to identify compelling solutions at the intersection of user needs and technical feasibility. Our team is designing the next generation of search technology for Legal and Tax Professionals globally. We drive AI innovation for Thomson Reuters’ Core Research Products, including Westlaw, Practical Law, and Checkpoint.\n\nAbout the Role\nApplied Scientists are experts in NLP, who contribute to the research and development of AI solutions that enhance Thomson Reuters' products. Their work ensures AI technologies are aligned with business objectives to drive innovation and deliver customer value.\nAs an Applied Scientist, you will:\nTake ideas through the end-to-end model development lifecycle (task design, data creation, training, evaluation and model governance)\nThink creatively about new capabilities generative AI can unlock for our customers\nWork with stakeholders to define scope, determine feasibility, and translate business/customer objectives into technical requirements\nCreate functional POCs to test new capabilities and Product concepts\nWrite clean code, participate in code reviews, and contribute to well-managed software delivery in a production environment\n\nAbout You\nYou’re a fit for the role of Applied Scientist if your background includes:\nBasic qualifications\nPhD or Master’s in a relevant discipline\nExperience researching, building, and evaluating NLP systems\nSolid engineering skills for prototyping; experience contributing to a shared codebase; and familiarity with workflows for remote development (AWS, Azure or similar)\nOutstanding communication, problem-solving, and analysis skills\nDemonstrated ability to communicate AI concepts to a diverse audience\n\nPreferred Qualifications\nExperience designing and implementing solutions with large language models\nRelevant publications at ACL, EMNLP, NAACL, NeurIPS, ICLR, SIGIR, KDD, or similar.\nExperience writing production code and ensuring well-managed software delivery\n\n#LI-SM2\nWhat’s in it For You?\nHybrid Work Model: We’ve adopted a flexible hybrid working environment (2-3 days a week in the office depending on the role) for our office-based roles while delivering a seamless experience that is digitally and physically connected.\nFlexibility & Work-Life Balance: Flex My Way is a set of supportive workplace policies designed to help manage personal and professional responsibilities, whether caring for family, giving back to the community, or finding time to refresh and reset. This builds upon our flexible work arrangements, including work from anywhere for up to 8 weeks per year, empowering employees to achieve a better work-life balance.\nCareer Development and Growth: By fostering a culture of continuous learning and skill development, we prepare our talent to tackle tomorrow’s challenges and deliver real-world solutions. Our Grow My Way programming and skills-first approach ensures you have the tools and knowledge to grow, lead, and thrive in an AI-enabled future.\nIndustry Competitive Benefits: We offer comprehensive benefit plans to include flexible vacation, two company-wide Mental Health Days off, access to the Headspace app, retirement savings, tuition reimbursement, employee incentive programs, and resources for mental, physical, and financial wellbeing.\nCulture: Globally recognized, award-winning reputation for inclusion and belonging, flexibility, work-life balance, and more. We live by our values: Obsess over our Customers, Compete to Win, Challenge (Y)our Thinking, Act Fast / Learn Fast, and Stronger Together.\nSocial Impact: Make an impact in your community with our Social Impact Institute. We offer employees two paid volunteer days off annually and opportunities to get involved with pro-bono consulting projects and Environmental, Social, and Governance (ESG) initiatives.\nMaking a Real-World Impact: We are one of the few companies globally that helps its customers pursue justice, truth, and transparency. Together, with the professionals and institutions we serve, we help uphold the rule of law, turn the wheels of commerce, catch bad actors, report the facts, and provide trusted, unbiased information to people all over the world.\nIn the United States, Thomson Reuters offers a comprehensive benefits package to our employees. Our benefit package includes market competitive health, dental, vision, disability, and life insurance programs, as well as a competitive 401k plan with company match. In addition, Thomson Reuters offers market leading work life benefits with competitive vacation, sick and safe paid time off, paid holidays (including two company mental health days off), parental leave, sabbatical leave. These benefits meet or exceeds the requirements of paid time off in accordance with any applicable state or municipal laws. Finally, Thomson Reuters offers the following additional benefits: optional hospital, accident and sickness insurance paid 100% by the employee; optional life and AD&D insurance paid 100% by the employee; Flexible Spending and Health Savings Accounts; fitness reimbursement; access to Employee Assistance Program; Group Legal Identity Theft Protection benefit paid 100% by employee; access to 529 Plan; commuter benefits; Adoption & Surrogacy Assistance; Tuition Reimbursement; and access to Employee Stock Purchase Plan.\nThomson Reuters complies with local laws that require upfront disclosure of the expected pay range for a position. The base compensation range varies across locations.\nFor any eligible US locations, unless otherwise noted, the base compensation range for this role is $108,500 - $201,500.\nThis role may also be eligible for an Annual Bonus based on a combination of enterprise and individual performance.\nBase pay is positioned within the range based on several factors including an individual’s knowledge, skills and experience with consideration given to internal equity. Base pay is one part of a comprehensive Total Reward program which also includes flexible and supportive benefits and other wellbeing programs.\n\nAbout Us\nThomson Reuters informs the way forward by bringing together the trusted content and technology that people and organizations need to make the right decisions. We serve professionals across legal, tax, accounting, compliance, government, and media. Our products combine highly specialized software and insights to empower professionals with the data, intelligence, and solutions needed to make informed decisions, and to help institutions in their pursuit of justice, truth, and transparency. Reuters, part of Thomson Reuters, is a world leading provider of trusted journalism and news.\nWe are powered by the talents of 26,000 employees across more than 70 countries, where everyone has a chance to contribute and grow professionally in flexible work environments. At a time when objectivity, accuracy, fairness, and transparency are under attack, we consider it our duty to pursue them. Sound exciting? Join us and help shape the industries that move society forward.\nAs a global business, we rely on the unique backgrounds, perspectives, and experiences of all employees to deliver on our business goals. To ensure we can do that, we seek talented, qualified employees in all our operations around the world regardless of race, color, sex/gender, including pregnancy, gender identity and expression, national origin, religion, sexual orientation, disability, age, marital status, citizen status, veteran status, or any other protected classification under applicable law. Thomson Reuters is proud to be an Equal Employment Opportunity Employer providing a drug-free workplace.\nWe also make reasonable accommodations for qualified individuals with disabilities and for sincerely held religious beliefs in accordance with applicable law. More information on requesting an accommodation here.\nLearn more on how to protect yourself from fraudulent job postings here.\nMore information about Thomson Reuters can be found on thomsonreuters.com."
  },
  {
    "title": "Senior Manager, Data Science - Credit Model Review",
    "company": "Capital One",
    "location": "Richmond, VA 23218 \n(City Center area)",
    "salary": "Full-time",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0C3j_zLGvpMLCdiZ0WC46XqVTA1VMZzOzKXPhAXwYlrNc2ZimNTpf2_4MHwNa_erOwi-frjd9C-YZQS2EMsk1JSjwON6MfsWtYs231HBGzg0Y2Yai4S2ASqQj4aBVGSwaegvYCpHjAKIMppqPxZA_GoFXxWxU3hIlzU2qmC2MVo_cfvmNauVKIlYHkuHy3jeWefnejcQdJlcswnkGcleEH50AlalL8r-a_9FoI9yBeDQ24qr-edBFCs9M8AMj93u3nr22ZfaE0OqgS_vUfekMxH8O3zBkZkrtYnLvZ_E0YwAJyUY7dH32GRydH_PcX3eFMf4OnhCrpakLeJVx6VqXdTo7QC_Pa6Lq1g58Acp4f_2x3qaqJuROiuV2n4OUQX_zT-0GTtmdw4vO-sHCXY1yv4f919nYgSgEppXdwVPGwX8ZF3VxrS_zwHBVXjUqczHVQog2e2QzLN57RADR0ojc4Sbg9P3GkLyJQWX9H9DRPqWQVhg1dJx6znhUHm48VizWTtd3U679pxB0yp5whXF9wr-a47PUf8MZD_DKUrz71Q0SXZ_8FBR7d5yrwNoMbeUQtw60fhm1c8P6az1McRhliI1Cpi4agh76HjSfxBADvi_kEuCL9uhSItw7pnuAApH4kHftEcYd17a-gDr51NKppq32CuS_eRdmHN6BtRRpMqI46Fdbt4wXvPFpaCRbkDFAns1To57aw68MGr9Ur9xX7mtbBFVOPBaVzayu9WKr6QKUb0lWIdn4xAZtBwccSAK6rnSnJqRvKB5-H9qvVVavpMV__jmbTcXFFB53GM9zobBS_haEp4c7-Hoq5v-AlV1C-daFNf3dbkIAygtDC7CH6YK132_5M1ArhMmta_1jZEJNVexUGI3yVBdBi2D97DNm_nm5SxnPDBSbo8XzB3f4oOCk5bv5TkjP9n5IoL06ueATCvB4WttI269Mbh8wzOJHXrBZW7JPQmrPk_C9cB6k_tWlVlN4MO-gxKZ9BxNsQgeK4cKzZPFRcUB5i_be_SPA5aWvoHKrSy9LRsoKDWCIswzF7ZkWqQAzgApFX5n19ofsyYY7_VgWEQKkKpF0E7uyVhrWC9hvNRFL9xDWnM1bMjSlV39YGcVmk1v-wZrB0AcBw3HIsFGfK0wXNgxnHz4td_FF1m1qiFqzQzpAC4smwAv8Z7XKu5x7mcCgm9JNhymIlj5xizdCBP910vo0ZauGfQd9bajRxmg1hok6IYje_QKrXFwX1KZstaQgebFwqcrG7wE4zHhki0coqpAV8iLfE6YJvd05EX9j_UpTX5MQo8&xkcb=SoDh6_M3sjZw1xQpUp0DbzkdCdPP&camk=4HOcmqOLYrByKel4K0fjog==&p=8&fvj=0&vjs=3",
    "description": "Senior Manager, Data Science - Credit Model Review\nData is at the center of everything we do. As a startup, we disrupted the credit card industry by individually personalizing every credit card offer using statistical modeling and the relational database, cutting edge technology in 1988! Fast-forward a few years, and this little innovation and our passion for data has skyrocketed us to a Fortune 200 company and a leader in the world of data-driven decision-making.\nAs a Data Scientist at Capital One, you’ll be part of a team that’s leading the next wave of disruption at a whole new scale, using the latest in computing and machine learning technologies and operating across billions of customer records to unlock the big opportunities that help everyday people save money, time and agony in their financial lives.\nTeam Description\nIn Capital One’s Credit Review Model, Data and Innovative Solutions Team, we defend the company against model failures and find new ways of making better decisions with models. We use our statistics, software engineering, and business expertise to drive the best outcomes in both Risk Management and the Enterprise. We understand that we can’t prepare for tomorrow by focusing on today, so we invest in the future: investing in new skills, building better tools, and maintaining a network of trusted partners.\nWe partner with best-in-class data scientists, analysts, credit risk management experts, and engineers to innovate solutions that directly impact the company’s bottom line in a meaningful way. We do it all in a collaborative environment that values individual insight, encourages each associate to take on new responsibilities, promotes continuous learning, and rewards innovation.\nIn this role, you will:\nPartner with a cross-functional team of data scientists, software engineers, and product managers to deliver a product customers love\nLeverage a broad stack of technologies — Python, Conda, AWS, H2O, Spark, and more — to reveal the insights hidden within huge volumes of numeric and textual data\nBuild statistical and machine learning models to challenge the models in production\nFlex your interpersonal skills to translate the complexity of your work into tangible business goals\nThe Ideal Candidate is:\nInnovative. You continually research and evaluate emerging technologies. You stay current on published state-of-the-art methods, technologies, and applications and seek out opportunities to apply them.\nCreative. You thrive on bringing definition to big, undefined problems. You love asking questions and pushing hard to find answers. You’re not afraid to share a new idea.\nTechnical. You’re comfortable with open-source languages and are passionate about developing further. You have hands-on experience developing data science solutions using open-source tools and cloud computing platforms.\nStatistically-minded. You’ve built models, validated them, and backtested them. You know how to interpret a confusion matrix or a ROC curve. You have experience with clustering, classification, sentiment analysis, time series, and deep learning.\nBasic Qualifications:\nCurrently has, or is in the process of obtaining a Bachelor’s Degree plus 7 years of experience in data analytics, or currently has, or is in the process of obtaining a Master’s Degree plus 5 years of experience in data analytics, or currently has, or is in the process of obtaining PhD plus 2 years of experience in data analytics, with an expectation that required degree will be obtained on or before the scheduled start date\nAt least 3 years’ experience in open source programming languages for large scale data analysis\nAt least 3 years’ experience with machine learning\nAt least 3 years’ experience with relational databases\nPreferred Qualifications:\nPhD in “STEM” field (Science, Technology, Engineering, or Mathematics) plus 4 years of experience in data analytics\nAt least 5 years’ experience in Python, Scala, or R for large scale data analysis\nAt least 5 years’ experience with machine learning\nAt least 5 years’ experience with SQL\nExperience in the Banking or Financial industry\nCapital One will consider sponsoring a new qualified applicant for employment authorization for this position.\nThis role is Hybrid, with associates expected to consistently spend three days per week in the office.\nThe minimum and maximum full-time annual salaries for this role are listed below, by location. Please note that this salary information is solely for candidates hired to perform work within one of these locations, and refers to the amount Capital One is willing to pay at the time of this posting. Salaries for part-time roles will be prorated based upon the agreed upon number of hours to be regularly worked.\nRichmond, VA: $204,900 - $233,800 for Sr Mgr, Data Science\nRiverwoods, IL: $204,900 - $233,800 for Sr Mgr, Data Science\nMcLean, VA: $225,400 - $257,200 for Sr Mgr, Data Science\n\nCandidates hired to work in other locations will be subject to the pay range associated with that location, and the actual annualized salary amount offered to any candidate at the time of hire will be reflected solely in the candidate’s offer letter.\nThis role is also eligible to earn performance based incentive compensation, which may include cash bonus(es) and/or long term incentives (LTI). Incentives could be discretionary or non discretionary depending on the plan.\nCapital One offers a comprehensive, competitive, and inclusive set of health, financial and other benefits that support your total well-being. Learn more at the Capital One Careers website. Eligibility varies based on full or part-time status, exempt or non-exempt status, and management level.\nThis role is expected to accept applications for a minimum of 5 business days.\nNo agencies please. Capital One is an equal opportunity employer (EOE, including disability/vet) committed to non-discrimination in compliance with applicable federal, state, and local laws. Capital One promotes a drug-free workplace. Capital One will consider for employment qualified applicants with a criminal history in a manner consistent with the requirements of applicable laws regarding criminal background inquiries, including, to the extent applicable, Article 23-A of the New York Correction Law; San Francisco, California Police Code Article 49, Sections 4901-4920; New York City’s Fair Chance Act; Philadelphia’s Fair Criminal Records Screening Act; and other applicable federal, state, and local laws and regulations regarding criminal background inquiries.\nIf you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation, please contact Capital One Recruiting at 1-800-304-9102 or via email at RecruitingAccommodation@capitalone.com. All information you provide will be kept confidential and will be used only to the extent required to provide needed reasonable accommodations.\nFor technical support or questions about Capital One's recruiting process, please send an email to Careers@capitalone.com\nCapital One does not provide, endorse nor guarantee and is not liable for third-party products, services, educational tools or other information available through this site.\nCapital One Financial is made up of several different entities. Please note that any position posted in Canada is for Capital One Canada, any position posted in the United Kingdom is for Capital One Europe and any position posted in the Philippines is for Capital One Philippines Service Corp. (COPSSC)."
  },
  {
    "title": "Machine Learning Scientist III - Causal Inference & CLV Strategy",
    "company": "Expedia Group",
    "location": "Austin, TX 78758 \n(The Domain area)",
    "salary": "$137,500 - $220,000 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0DbIyHopYNdPLgRYRG2FgnuJLz47mHLRnOVu2tY5XDnod2kQ1kD4SQatx4-P_YDUHejCugpGSSnok_-9xBTNy-B4c7xZ_I9atJemtX90CBwXVZ6-9iKSDhlz4yl85mdqMstl7hbYs7ZUkwyhx3IwrUFVvWuNbXFdWzioVfzcVWB5BoYcCX1Yd9FYr8jPoo5Uu05rtsQhJraznav4IsqBp8w2rqxMlpx1KNMJPiOpg6jLTrNjlOKHR8cRKf6GfudNxa65S4A50X5ixUlzQXtngnMSZMdP8lnJTCYoE_Dna-swG5U0c6ftz3RYFNVPFrCAxrbE9JBN6sZg9i4_hyBos1Y5g9e5yAJnBEZrEvXL9Jva4OaD_bdQ3CME2rRAbKgwr83ofQ0FI-nYroD4hZF1BSzEnwyXGxdIkXamXlbuHWkB4CStTvunEdTPbzoeKCoOb-HPDQjgHy-pkKFMGZGLkZfdXE-2iJv0AQUmHiU3f8FFXI7h9ppHdMz7mQI8IalztkcRi7EEfY1cAaICptW-JbtBsSgdq7uX_SvGXGsh2aNYoKKztUcEXhse5gvl81zwqP3SpbxAJ9EjWmyN8WMjT23kFxNfaUNA7VeGOB9zSva4DmD-7-A-1rAMNG_xE9drfu3E_OQhTKaSuFCoXZKBOja9dQAz-O3ydc=&xkcb=SoB86_M3sjZw1xQpUp0AbzkdCdPP&camk=UoKtGZLa3XKeFSmBlYB6-g==&p=11&fvj=0&vjs=3",
    "description": "Expedia Group brands power global travel for everyone, everywhere. We design cutting-edge tech to make travel smoother and more memorable, and we create groundbreaking solutions for our partners. Our diverse, vibrant, and welcoming community is essential in driving our success.\nWhy Join Us?\nTo shape the future of travel, people must come first. Guided by our Values and Leadership Agreements, we foster an open culture where everyone belongs, differences are celebrated and know that when one of us wins, we all win.\nWe provide a full benefits package, including exciting travel perks, generous time-off, parental leave, a flexible work model (with some pretty cool offices), and career development resources, all to fuel our employees' passion for travel and ensure a rewarding career journey. We’re building a more open world. Join us.\nExpedia Technology teams partner with our Product teams to create innovative products, services, and tools to deliver high-quality experiences for travelers, partners, and our employees. A singular technology platform powered by data and machine learning provides secure, differentiated, and personalized experiences that drive loyalty and traveler satisfaction.\nWho We Are:\nTravel is a force for good. At Expedia Group (Expedia, Hotels.com, Vrbo, Travelocity, Orbitz, Wotif, and others), our mission is to power global travel for everyone, everywhere—because we know that travel strengthens connections, broadens horizons, and bridges divides.\nPowered by more than 80+ terabytes of data and 20+ years of tech innovation, Expedia Group is one of the world’s largest travel platforms. With unrivaled knowledge of the industry and advanced technology, we’ve built a marketplace that filters through millions of possibilities for travelers and partners worldwide.\nAbout the Team:\nThe Marketplace Machine Learning Science team is launching a high-impact initiative focused on Customer Lifetime Value (CLV)—a key business metric that will shape long-term company performance and executive decision-making. As a Machine Learning Scientist III, you will lead efforts to build causal models and experimentation frameworks that optimize how we serve millions of travelers globally.\nThis is a high-visibility role with direct exposure to executive leadership and cross-functional teams across product, engineering, marketing, customer service, pricing, and more. You’ll be joining a zero-to-one initiative with strong leadership support and urgency to deliver impact starting immediately.\nStrategic Impact & Visibility:\nThis role offers a rare opportunity to shape how Expedia Group measures and optimizes long-term customer value. You’ll be part of a newly formed team with zero existing members on CLV, giving you the chance to influence foundational modeling decisions and build scalable solutions from the ground up.\nIn this role, you will:\nLead the research and implementation of scalable machine learning and data science solutions end-to-end with engineering rigor\nApply causal inference techniques to understand drivers of customer lifetime value and measure the impact of business interventions (e.g., marketing, service, product features)\nDesign and execute robust experiments (e.g., A/B tests, quasi-experimental methods) to evaluate business strategies and validate model performance\nTranslate complex findings into actionable insights for both technical and non-technical stakeholders\nBreak down ambiguous business problems into structured, data-driven solutions\nStay informed on relevant ML and AI research, with support from Expedia’s learning and development resources\nCollaborate with other machine learning and data science teams to foster a strong data science culture across Expedia Group\nMinimum Qualifications:\nAdvanced degree in Computer Science, Statistics, Operations Research, Econometrics, Economics, or a related quantitative field\nTypically requires 4+ years of professional experience, though candidates with equivalent project or research experience are encouraged to apply\nStrong hands-on experience in causal modeling and experimental design\nProven ability to analyze large, complex datasets and generate actionable insights\nPragmatic problem solver focused on scalable and effective methods\nAbility to share ideas effectively with diverse technical and business audiences\nPreferred Qualifications:\nProficiency in Python; familiarity with Spark is a plus but not required - eagerness to learn is valued\nExperience with end-to-end ML solution development\nExperience or interest in applying AI techniques, including large language models (LLMs), is a plus\nExpedia Group is proud to offer a wide range of benefits to support employees and their families, including medical/dental/vision, paid time off, and an Employee Assistance Program. To fuel each employee’s passion for travel, we offer a wellness & travel reimbursement, travel discounts, and an International Airlines Travel Agent (IATAN) membership. View our full list of benefits.\nThe total cash range for this position in Austin is $137,500.00 to $192,500.00. Employees in this role have the potential to increase their pay up to $220,000.00, which is the top of the range, based on ongoing, demonstrated, and sustained performance in the role.\nStarting pay for this role will vary based on multiple factors, including location, available budget, and an individual’s knowledge, skills, and experience. Pay ranges may be modified in the future.\nExpedia Group is proud to offer a wide range of benefits to support employees and their families, including medical/dental/vision, paid time off, and an Employee Assistance Program. To fuel each employee’s passion for travel, we offer a wellness & travel reimbursement, travel discounts, and an International Airlines Travel Agent (IATAN) membership. View our full list of benefits.\nAccommodation requests\nIf you need assistance with any part of the application or recruiting process due to a disability, or other physical or mental health conditions, please reach out to our Recruiting Accommodations Team through the Accommodation Request.\nWe are proud to be named as a Best Place to Work on Glassdoor in 2024 and be recognized for award-winning culture by organizations like Forbes, TIME, Disability:IN, and others.\nExpedia Group's family of brands includes: Brand Expedia®, Hotels.com®, Expedia® Partner Solutions, Vrbo®, trivago®, Orbitz®, Travelocity®, Hotwire®, Wotif®, ebookers®, CheapTickets®, Expedia Group™ Media Solutions, Expedia Local Expert®, CarRentals.com™, and Expedia Cruises™. © 2024 Expedia, Inc. All rights reserved. Trademarks and logos are the property of their respective owners. CST: 2029030-50\nEmployment opportunities and job offers at Expedia Group will always come from Expedia Group’s Talent Acquisition and hiring teams. Never provide sensitive, personal information to someone unless you’re confident who the recipient is. Expedia Group does not extend job offers via email or any other messaging tools to individuals with whom we have not made prior contact. Our email domain is @expediagroup.com. The official website to find and apply for job openings at Expedia Group is careers.expediagroup.com/jobs.\nExpedia is committed to creating an inclusive work environment with a diverse workforce. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. This employer participates in E-Verify. The employer will provide the Social Security Administration (SSA) and, if necessary, the Department of Homeland Security (DHS) with information from each new employee's I-9 to confirm work authorization."
  },
  {
    "title": "Principal Associate, Data Scientist - Transaction Intelligence",
    "company": "Capital One",
    "location": "New York, NY 10012 \n(SoHo area)",
    "salary": "Full-time",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0C3j_zLGvpMLCdiZ0WC46XqVTA1VMZzOzKXPhAXwYlrNc2ZimNTpf2_4MHwNa_erOzmbJsY_520GMyCO6XbDupeTTz-iHuJBXiXSaG0VIMJum8rsqRPgAJAjxgh732sZtYFQbVIl-j1NiiqdkiVkoZhYFwKvfP-y9n_pBcKji4kJ2s5Umo5PBMDDIa8Im9FanTgyFIq1tu3XQT1W3ce0de5Ok9PKPOIpXb1RaRndK_UTlOnWslK7puInFXOTQl5apoSup6Yrii9TuujSF7-Gy7DgkEnO4eSB8TYo1-i5fRRlQCIZ1JdsOXFjEmD8WXE-oZVkO2KSEm-BgF8OgEVMi67hSPk3Dpo0D4X0UYU386eM6DH-sgZs0ubZF7nkmK-NnWdFJBGgMUDBZAZ8MalizUvRM-ZynHCVVgthaxpVM7DFLj4traK-92ebmFDuGud-sesLnRYM5v-SNigi0WwWAHPhUV5XqpZJ8fLe6N5Bz6JY6hyu1EtGtbqigMheHMebeiHCstiVy8sUjEHO0E5Rm7Xkjxkjwgj5SmbQIKAeNWUmwxR5qmWKn43pHRZhZpgOObCSCgFqzY2kYlllBBvHOg-t7xkNnLPpZS7qamPH1FSdDfnjQ1WHicQdWhdIOEQmjwFVtJKtYcEtRTOpPDCKSF2PUDG9LEDwlz-HpLHiy7B-TiyPNS4MtS2V2OtrGVqpETF_n6xdkGDDVq5PUueWul8A1uUjZVe4qo3oLA4MH3Tz4DQLosDbM0w8cbxd-Z7xfZ2-ZhMfiUvG-5bQ9JT2otrETERWT6Qey7cH5vDwwA7rdD3ORbpXnQviJUJd33Df3LeqRJQzEilK9dR0RNkZ3lhEHO-7dygvjaxZfcvzgp12pDeJsQPpUFuAXoikt7eqo-v9_4gYbrJBPlKHrOgNbEFBLPPyEYqAv47P_4lNkWRjq6oP-YM9JuXT70mWQUUf0AJRV0z9JWbxtTbY_KzacptI63pDQme7JERr1Xs1vzzJBzqNxY9ZXHVTzCIAjl_VSg7n3uT15a7BLzlwwgxgqJ3krMO5TbWRvNYvmjPpsNilvFZ1EEx1VkniGiLot2XdQ4CqHjOtfWfX1-5hiqkt5hA4s_pBlracGSJ6wonFVi168OneSA4FqUie--9t-6aFhy8jzUDhsCPbFx4HAzKOamxph16KlUKE7NeJ3hEbbd9nTy8EUj69NGmtfRVmTsAfPvjvVXdWfvfy3P8jcItywjS6t8nhev9rFuA6-DAAMi_pkUb0Wj9hUE45AGMlinvq083VcUuPM77ehxQ_P18v7hc0Crtyehub6c=&xkcb=SoDI6_M3sjZw1xQpUp0BbzkdCdPP&camk=4HOcmqOLYrByKel4K0fjog==&p=10&fvj=0&vjs=3",
    "description": "Principal Associate, Data Scientist - Transaction Intelligence\nData is at the center of everything we do. As a startup, we disrupted the credit card industry by individually personalizing every credit card offer using statistical modeling and the relational database, cutting edge technology in 1988! Fast-forward a few years, and this little innovation and our passion for data has skyrocketed us to a Fortune 200 company and a leader in the world of data-driven decision-making.\nAs a Data Scientist at Capital One, you’ll be part of a team that’s leading the next wave of disruption at a whole new scale, using the latest in computing and machine learning technologies and operating across billions of customer records to unlock the big opportunities that help everyday people save money, time and agony in their financial lives.\nTeam Description\nThe Transaction Intelligence team leverages transaction data to power at-scale, real-time experiences that bring simplicity, clarity and confidence to our customers. We use Python, Spark, Snowflake, Databricks and Kubeflow as our tech stack, and build models and tools that serve our customer base as well as our analytical community at Capital One.\nRole Description\nIn this role, you will:\nPartner with a cross-functional team of data scientists, software engineers, and product managers to deliver a product customers love\nLeverage a broad stack of technologies — Python, Conda, AWS, Spark, Databricks, Snowflake, and more — to reveal the insights hidden within huge volumes of numeric and textual data\nBuild machine learning models through all phases of development, from design through training, evaluation, validation, and implementation\nFlex your interpersonal skills to translate the complexity of your work into tangible business goals\nExplore and apply the latest advances in machine learning, such as transformer modeling architectures, to real-world problems facing the financial services industry\nThe Ideal Candidate is:\nInnovative. You can apply the latest developments in machine learning to real-world problems facing the financial services industry.\nTechnical. You’re comfortable with a broad stack of technologies.\nCreative. You are a builder and deployer of machine learning models, with experience in all phases of development, from design through training, evaluation, validation, and implementation.\nA data guru. “Big data” doesn’t faze you. You have the skills to retrieve, combine, and analyze data from a variety of sources and structures. You know understanding the data is often the key to great data science.\nBasic Qualifications:\nCurrently has, or is in the process of obtaining one of the following with an expectation that the required degree will be obtained on or before the scheduled start date:\nA Bachelor's Degree in a quantitative field (Statistics, Economics, Operations Research, Analytics, Mathematics, Computer Science, or a related quantitative field) plus 5 years of experience performing data analytics\nA Master's Degree in a quantitative field (Statistics, Economics, Operations Research, Analytics, Mathematics, Computer Science, or a related quantitative field) or an MBA with a quantitative concentration plus 3 years of experience performing data analytics\nA PhD in a quantitative field (Statistics, Economics, Operations Research, Analytics, Mathematics, Computer Science, or a related quantitative field)\nPreferred Qualifications:\nMaster’s Degree in “STEM” field (Science, Technology, Engineering, or Mathematics) plus 3 years of experience in data analytics, or PhD in “STEM” field (Science, Technology, Engineering, or Mathematics)\nAt least 1 year of experience working with AWS\nAt least 3 years’ experience in Python, Scala, or R\nAt least 3 years’ experience with machine learning\nAt least 3 years’ experience with SQL\nCapital One will consider sponsoring a new qualified applicant for employment authorization for this position.\nThe minimum and maximum full-time annual salaries for this role are listed below, by location. Please note that this salary information is solely for candidates hired to perform work within one of these locations, and refers to the amount Capital One is willing to pay at the time of this posting. Salaries for part-time roles will be prorated based upon the agreed upon number of hours to be regularly worked.\nNew York, NY: $173,000 - $197,400 for Princ Associate, Data Science\n\nCandidates hired to work in other locations will be subject to the pay range associated with that location, and the actual annualized salary amount offered to any candidate at the time of hire will be reflected solely in the candidate’s offer letter.\nThis role is also eligible to earn performance based incentive compensation, which may include cash bonus(es) and/or long term incentives (LTI). Incentives could be discretionary or non discretionary depending on the plan.\nCapital One offers a comprehensive, competitive, and inclusive set of health, financial and other benefits that support your total well-being. Learn more at the Capital One Careers website. Eligibility varies based on full or part-time status, exempt or non-exempt status, and management level.\nThis role is expected to accept applications for a minimum of 5 business days.\nNo agencies please. Capital One is an equal opportunity employer (EOE, including disability/vet) committed to non-discrimination in compliance with applicable federal, state, and local laws. Capital One promotes a drug-free workplace. Capital One will consider for employment qualified applicants with a criminal history in a manner consistent with the requirements of applicable laws regarding criminal background inquiries, including, to the extent applicable, Article 23-A of the New York Correction Law; San Francisco, California Police Code Article 49, Sections 4901-4920; New York City’s Fair Chance Act; Philadelphia’s Fair Criminal Records Screening Act; and other applicable federal, state, and local laws and regulations regarding criminal background inquiries.\nIf you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation, please contact Capital One Recruiting at 1-800-304-9102 or via email at RecruitingAccommodation@capitalone.com. All information you provide will be kept confidential and will be used only to the extent required to provide needed reasonable accommodations.\nFor technical support or questions about Capital One's recruiting process, please send an email to Careers@capitalone.com\nCapital One does not provide, endorse nor guarantee and is not liable for third-party products, services, educational tools or other information available through this site.\nCapital One Financial is made up of several different entities. Please note that any position posted in Canada is for Capital One Canada, any position posted in the United Kingdom is for Capital One Europe and any position posted in the Philippines is for Capital One Philippines Service Corp. (COPSSC)."
  },
  {
    "title": "Director of Data Analytics and Artificial Intelligence",
    "company": "Natural Grocers",
    "location": "Lakewood, CO 80228",
    "salary": "$165,000 - $190,000 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0BkxnpbOAMH4EyFZK3jbWCb7UrkeeDxGo8g1MIL1Em3dBxwgY4yoM2t7FVh6GKxDRnZt61GIAmDWzcJmP1Gk9Fboms1_e_QSyIa74djz0yei1OSkhICihRFJKkzfCfPkXBs_uG40qW100nhMm0_aKk1oAePGvnUfIu0cvisdlxQu1xQS5MAwXCahUduKSA1C3TFoIE_7bn4TGc7sD3fsGSBmPPoSAnzep0TC8mRvps7XPr1H05eGr80or_S5fvn-L_Cg3jGQdECYGkDHUsDEJ_i6OcfbFjeJGxpp8KlnUefrOO-Qt7v2n0locInJ7v8c9AXMkMoJwEpPU_vZavcl3UuSlm9yEeu8Cfvlqexv5Z6-ITt3QVObRM5PFNI6nD6HkOYMZb7u_Q3fSxoGEL4jG8CeW64Mr8vTBWctkBj7d1tIM5bX-EXvOuVkw-zxfI-aJikFYg1EkhphAp_zABc6PDgBe3sDFnQodPg7u7xNq9JIE92mwXIz1ZaTMpvCPw3SH9kQos_oEBFaIiBsmRuN2izlC6KFdAKVf2tBCZD-iGrdc3YyCok6WMtT4owE1S6sI1_rTcErfnfdJymHYSnm98CNwecrY2aLm4Lh1CPStpGBwBphDedaek4NdVWcXVNc-3VsPbNZIFiScLgnHuT5CER&xkcb=SoBV6_M3sjZw1xQpUp0CbzkdCdPP&camk=tQsC0y0u1Lpnk2rwFa4zMA==&p=9&fvj=0&vjs=3",
    "description": "The Job in a Nutshell:\nThe Director of Data Analytics and Artificial Intelligence is a key leadership role, responsible for designing and executing strategies that leverage data analytics and AI to drive organizational growth, efficiency, and innovation. This position serves as a bridge between technical expertise and business objectives, ensuring that data-driven insights and AI applications are integrated seamlessly into decision-making processes.\n\nApplications are accepted by the date below, which may be updated if the hiring timeline is extended.\n10/10/2025\n\nMain Ingredients:\n1. Strategic Leadership\nDevelop and implement the overarching strategy for data analytics and artificial intelligence, aligned with the organization's vision and goals.\nProvide thought leadership and direction on emerging trends and technologies in data science, machine learning, and artificial intelligence.\nEnsure alignment between data initiatives and overall business strategies.\n2. Data Strategy and Architecture\nDesign and optimize the organization’s data architecture to support advanced analytics and AI capabilities.\nPromote the integration of structured, unstructured, and big data to create comprehensive insights.\n3. AI and Advanced Analytics Development\nLead the development of innovative AI models and advanced analytics to solve complex business problems.\nOversee teams working on machine learning, predictive analytics, natural language processing, and data visualization.\nCollaborate with cross-functional teams to identify opportunities for AI integration in organizational processes.\n4. Team Leadership\nBuild and lead a high-performing team of data scientists, analysts, and AI specialists.\nFoster a culture of continuous learning, innovation, and collaboration.\nMentor and develop team members to ensure professional growth and skill enhancement.\n5. Stakeholder Collaboration\nWork closely with executive leadership to translate business goals into actionable data strategies.\nCollaborate with other departments, such as marketing, information technology, operations, and finance, to identify data-driven opportunities.\nPresent findings and recommendations to stakeholders in a clear, impactful manner.\n6. Performance Measurement\nDefine and monitor key performance indicators (KPIs) for data analytics and AI initiatives.\nEvaluate the effectiveness of AI solutions and analytics models in achieving business objectives.\nContinuously refine and improve analytics processes and AI applications based on performance feedback.\nAlthough this is a general outline of job responsibilities all employees are expected to be “hands on” and do whatever it takes to get the job done and make the company thrive.\n\nRecipe for Success:\n\n1. Educational Background\nA master’s or doctoral degree in data science, computer science, artificial intelligence, statistics, or a related field.\nAdditional certifications in AI, machine learning, or data analytics are highly desirable.\n2. Professional Experience\nMinimum of 8 years of experience in data analytics, artificial intelligence, or related fields.\nAt least 3 years of experience in a leadership role managing technical teams.\nProven track record of implementing successful AI and data initiatives within a business context.\n3. Technical Skills\nExpertise in data science and analytics tools such as Python, R, SQL, and Tableau.\nDeep understanding of machine learning models, AI frameworks, and big data technologies.\n4. Leadership and Communication Skills\nStrong leadership capabilities with the ability to inspire and drive teams toward achieving goals.\nExcellent communication skills to present technical concepts to non-technical audiences.\nAbility to build consensus and foster collaboration across departments.\n\nThis job description is not an employment contract. It does not guarantee a job or that the above listed duties are the limit of responsibilities. The job and job description are subject to change with and without notice. Employees are required to accomplish any and all tasks assigned to them by their Manager and/or other Store Support Center manager that might not be listed in this job description.\n\nHere’s an overview of the benefits we offer our good4u Crew to help ensure the health and wellbeing of you and your family, now and well into the future:\n\nAll Crew Members\nBirthday Bonus Pay\nVitamin Bucks (up to $2,080 earned as store credit annually)\nHoliday Pay for 5 Holidays – Stores Closed\nPaid Time Off (sick days and vacation) that Increases with Tenure\nPaid Nutrition Education\ngood4u Crew Member Discount\n{N}power Program (customer appreciation and rewards program)\nRegular, Scheduled Pay Increases\nAdvancement Opportunities and Career Development\nHealth and Wellness Program\nEmployee Assistance Program (EAP)\nEmployee Referral Program\n\nFull-Time Crew Members (30+ hours/week)\nMedical, Dental and Vision Insurance\nPaid Parental Leave\nPaid Medical Leave (through company paid short-term disability insurance)\nCompany Paid Short-Term Disability Insurance\nCompany Paid Life Insurance\nVoluntary Benefits Including Hospital Indemnity, Accident Insurance, Long-Term Disability Insurance, Term Life Insurance\nRetirement Savings Plan (401k) with discretionary Company Match\nHealthcare and Dependent Care Flexible Spending Account (FSA)\nHealth Savings Account (HSA) with Company Match\nDiversity Statement\nAt the heart of Natural Grocers' commitment to our community and crew is this belief: All people should be empowered to experience health and wellbeing! We cannot be true to this conviction without honoring diversity and cultivating inclusion throughout every aspect of our organization.\nAt Natural Grocers, we honor our differences, embrace diversity, and cultivate inclusion because both individual and societal health are rooted in these principles. Our Crew is diverse not only in gender, race, ethnicity, sexual orientation, religion, abilities, and age but also in cultural backgrounds, thoughts, and ideas. Celebrating our diversity refreshes, expands, and shapes our perspective, energizing our mission of equitable access to health and wellness for all. We welcome everyone who would like to join us in this mission, with gratitude for the unique life experience each person brings to the table. We’re committed to nurturing an ecosystem of diversity and inclusion in which our Crew can continue to thrive.\n\nPhysical Capabilities and Environmental Demands:\n\nN = Never\nO = Occasional; 1-33% of time\nF = Frequent; 34-66% of time\nC = Constant; 67-100% of time\n\nPhysical Requirements:\nMust have the ability to constantly lift or carry up to 10 lbs., frequently lift or carry 11-20 lbs., and occasionally lift or carry 21-50 lbs. Must also have the ability to occasionally lift or carry 51-100 lbs. with a team lift.\nMust have the ability to frequently push or pull up to 15 lbs. and occasionally push or pull 16-100 lbs.\nMust be able to occasionally use the computer for data entry and use of mouse.\nMust be able to constantly walk, stand, use fine motor manipulations, grip, bend, twist, turn, and reach outward for the duration of the work shift.\nMust be able to frequently to reach above chest.\nMust be able to occasionally sit, squat, kneel, and climb as needed.\n\nEnvironmental Requirements:\nMust be able to frequently work with sharp tools and equipment, dust, fumes, and congested worksite.\nMust be able to occasionally work with noise, cold, heat, wet, humid, outside, heights, and contact stress."
  },
  {
    "title": "Senior Sports Data Scientist",
    "company": "ESPN",
    "location": "Bristol, CT 06010",
    "salary": "",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0DAFTyt7pbDCC2JPO79CSdi1dIb81yjczP5qsKcZIxgiYm3-7g-689Ur9xqU8QiYHX0nWTiBpke9aEaeuwKMU88BW56ZucgcB67vwjyyVYq5brNDW6CST6DP2B0c8OuJqwOkrkwJ1IFaKwjgg_XfzzhWVeEFQT7r0Rr_kDiiwCT4gfyqnLwQyC2ozM-UMOACSSlUad0A3XkB5qYP9zgnNMBQHQ2V6CTlhtVJ63h4HGWqf0IRiZNjGen11WOy7R2oFa6L0FXL5rFqEbrd7OoGe1us-ZxX6iWCEEK45H-O7Fw45ByoWBuqx94G17JL7cfmPU5wHrY2XtXIhGVd3gnsgbHgGopHAxfxxsbib6RNmDUmOINgM8JRNjvGsJoriO4amgYDH3kMk6CYr6OaefZZUtPRHI-waaTvr6ZHITHoj5twhBDI-DeHsJr7SqMwd8LLVmxk1_YXeHNGMlyW_G9KRlfbNnpN4RBZR_wQqUXLu_MzwBZxqQRA5DhBBX4dIZTuPu7X801mDrdle1TcqEBZUzJGr8jLtE_hDRHx5yh82VIllPrn87wm-MfIeUqR1dVHgzwX38m3e9Hn5tDobktDAdBNs7XLbJM0j8L1vWU0fOKJUe8KLY5RRx6tvar-bxFGB88BPdQoI4sRCWL_yD0nXQr8SvgdOwhJlp_7J4GWG1VPVDJhHWUERs0AYUZWmXwsgQWw39WaKJPRRu_NMWYDMvW4g0fsOuq9RH3ferizllSm_ZahSwAaeVhIwHCbB9lJ7xcPfRKe_wvQ0UbZwEnvhE-TCdc3a3mzb_RkSONoZx3Ivqqyhw3Vqn2&xkcb=SoDy6_M3sjZw1xQpUp0HbzkdCdPP&camk=xqnMBGaf-K-LH0uwewBq_g==&p=12&fvj=0&vjs=3",
    "description": "The Senior Sports Data Scientist will serve as a technical leader in designing and implementing advanced predictive models and metrics that power ESPN's analytics products and storytelling. This role combines cutting-edge data science with sports domain expertise to create innovative solutions that enhance storytelling across television, digital, and emerging platforms. The ideal candidate will architect complex statistical models, leverage machine learning techniques to uncover new insights, and translate sophisticated analyses into compelling narratives that resonate with diverse audiences. This position blends hands-on technical excellence with leadership responsibilities, requiring someone who can deliver sophisticated analyses while managing projects, mentoring junior team members, and partnering with engineering, product, and content teams.\nResponsibilities:\nDesign and implement advanced machine learning models and statistical algorithms to predict player and team performance, including pre-game and in-game predictions\nApply modern techniques including deep learning, Bayesian methods, ensemble models, and reinforcement learning to solve complex sports analytics problems\nLeverage AI technologies to enhance analytics capabilities and create innovative solutions for sports player and team evaluation\nCollaborate with engineering teams to deploy models at scale, ensuring robust performance in production environments\nTransform complex statistical findings into clear, actionable insights that enhance storytelling across all ESPN platforms\nPartner with product and content teams to identify high-impact opportunities for analytics integration\nMentor junior data scientists and establish best practices for code quality, model validation, and documentation\nPresent findings to senior leadership and external stakeholders, adapting communication style for technical and non-technical audiences\nStay current with academic research and industry trends in sports analytics, machine learning, and data science\nContribute to the team's technical strategy and help evaluate emerging technologies and methodologies\nQualifications:\nMinimum 5 years of experience in data science, machine learning, or quantitative analytics, with demonstrated expertise in sports analytics preferred\nAdvanced proficiency in Python or R for statistical modeling and machine learning\nExpert-level SQL skills and experience with database systems\nDeep understanding of statistical methods including regression analysis, time series forecasting, Bayesian inference, and causal inference\nProven track record of deploying machine learning models to production and monitoring their performance\nExperience with cloud platforms\nExperience with version control (Git) and software engineering best practices\nStrong communication skills with ability to explain complex technical concepts to diverse audiences\nDemonstrated passion for sports with working knowledge of major sports leagues, players, teams, and statistical trends\nAbility to work in a fast-paced environment with competing priorities and tight deadlines\nFull availability for this position, including occasional nights, weekends, and holidays during major sporting events\nRequired Education:\nBachelor's Degree in Statistics, Computer Science, Mathematics, Engineering, Economics, or related quantitative field, OR\nHigh School Diploma/Equivalent with Minimum 5 years of relevant data science experience demonstrating equivalent expertise\nPreferred Education:\nAdvanced degree in Statistics, Machine Learning, Computer Science, Operations Research, or related quantitative field\nAdditional Information:\nSchedule Flexibility: This role requires flexibility to work outside standard business hours ahead of and during major sporting events, playoffs, and breaking news situations. Occasional weekend and holiday work will be necessary to support live productions and time-sensitive analytics.\n#ESPNMedia"
  },
  {
    "title": "Transportation Data Scientist",
    "company": "Leidos",
    "location": "McLean, VA 22102",
    "salary": "$85,150 - $153,925 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0CZUO70VSdYKA8PR3jfrSh5ljhqJhfDt0PzQCMubt8cRosbSX75HEeA45s9n5xrWx2W6yleq66YIq8K2E3jtpzXzqtDzN_OpovIaVY7O33W-YfFV25DI40ZXlZUnh-LnWie0xGDaST9Pgx6G7-mhN4lBQflxIRhx-pdK51j8BkUA4fnM54ucVLUdO09-vLo1Bgkda6xSt4NIlv-MovMx_2WcM1uPmm8pFHtIAYFFyIKLI3JLCVcOLwwnLoFKDp7D0Q5ptiFLM41AahHlM56YFKf5fusa4MbI6j6LVD9aljFq3HUFfz0mOfl3DPiPMuA4UOYE6OVAiX-2hfCqL_OGbiTQhAe2UzAxrSM8gMA13fTCSPnv8ULXxJtrw8JKxGqA2YvLuMRGqRekdtdeuRH71FTxhiPe-T84NIqIfijeVjlKZTODJ2DXpeXxI3qdYPtNYY-mbMeoKlySzznDCRLFVCoPXjUcJffSULKs3vUHxrISfeDzwdyc8t2lsDxnX__NEk_3xAYB7PEZU_IsL_d9-TzDchgs9KBW9jgl8i_EEHf4uUJQ03ieX4IY2fEjhfiUGQJp5vs21lfTM20sqUXi11gZfK-V0fiqs9BLGuGWBMKkIo2T5_HU5eEbJUvHdRQRi3xIS5637Ck0MtYytTFEB03MdgGQ3eTW7MH6TEzubDbH6KXVqWV9VfC8c0-Qi7KuEq5meq4Bxm2vJzAiWUX2_YDEXTaNBMkAqtC_CGm8Hjb5DvIYqH9I59j&xkcb=SoDb6_M3sjZw1xQpUp0FbzkdCdPP&camk=ethIe0s0hecezcnkRTMseg==&p=14&fvj=0&vjs=3",
    "description": "Description\nAre you interested in shaping the future of transportation? Consider joining the Leidos team operating FHWA’s Saxton Transportation Operations Laboratory (STOL), a USDOT research lab focused on the improvement of transportation operations, safety, mobility, and environmental impacts. STOL provides a variety of services to support the advancement and adoption of emerging technologies, including automation and communication in vehicles and on the roadside.\nLearn about STOL here: https://highways.dot.gov/turner-fairbank-highway-research-center/labs/STOL\nLeidos is seeking a highly skilled Senior Transportation Data Scientist to support FHWA-funded projects at the intersection of AI, data science, and transportation. This role will focus on developing and deploying AI/ML models for applications such as vehicle load classification using weigh-in-motion (WIM) data and imagery, crash prediction in traffic management centers (TMCs), and creating data ecosystems for trustworthy AI. The ideal candidate will have hands-on experience in AI model development, data integration, and stakeholder engagement, with a passion for identifying new opportunities to apply AI in state-level transportation initiatives. This position offers the chance to drive innovation in a dynamic, federally supported research environment.\nLocation: This role will be expected to work full-time at the customer site in McLean, VA\nPrimary Responsibilities\nConduct data and literature reviews, including targeted searches for AI methods, datasets, and technologies relevant to freight analytics, traffic safety, and operations (e.g., sensor fusion, computer vision, and multimodal AI).\nPrepare and integrate datasets for AI use cases, including cleaning, normalizing, enriching, and fusing multi-source data (e.g., traffic logs, imagery, weather, and permitting records) while addressing quality issues like inconsistency, sparsity, and bias.\nLead the design, development, and deployment of AI/ML models for transportation applications, including classifying oversized/overweight (OS/OW) vehicles using WIM data and imagery, crash prediction in TMCs, and generating synthetic data for model training.\nEvaluate AI model performance under diverse conditions, such as varying data quality levels, and provide recommendations for improving model robustness, scalability, and trustworthiness in real-world transportation environments.\nSupport stakeholder outreach and engagement, including organizing peer exchanges, workshops, and technical briefings with state DOTs, MPOs, enforcement agencies, and vendors to gather insights on AI applications in WIM systems, permitting integration, and crash prediction.\nIdentify and pursue new opportunities with state DOTs for AI initiatives, including contributions to developing roadmaps, proposals, and implementation strategies for AI in ITS, such as anomaly detection, traffic optimization, and safety analytics.\nCollaborate with cross-functional teams to ensure project alignment with FHWA goals, including risk management, quality assurance, and compliance with federal standards.\nProvide technical leadership in monthly progress reporting, risk mitigation, and iterative model refinement based on federal feedback.\nRequired Qualifications\nBachelor’s degree in computer science, Data Science, Artificial Intelligence, Electrical Engineering, Transportation Engineering, or a related field; Master's or Ph.D. preferred.\n5+ years of professional experience in data science and AI/ML, with demonstrated expertise in machine learning frameworks (e.g., TensorFlow, PyTorch, Scikit-learn), data processing tools (e.g., Pandas, NumPy), and AI techniques (e.g., deep learning, generative AI like GANs, computer vision).\nProven experience in data preparation and integration, including ETL processes, handling multimodal data (e.g., imagery, sensor data, time-series), and addressing data quality challenges in real-world applications.\nStrong analytical skills with experience in model evaluation metrics (e.g., AUC, accuracy, scalability) and testing AI systems under varied conditions.\nExcellent communication and collaboration skills, with experience in stakeholder engagement, technical reporting, and presenting complex AI concepts to non-technical audiences.\nAbility to work in a fast-paced, research-oriented environment with travel up to 20% for stakeholder meetings and site visits.\nAbility to obtain and maintain a Public Trust clearance (which includes three years of immediate residency in the US).\nAll applicants must be legally authorized to work in the United States without company sponsorship.\nPreferred Qualifications\nPrior experience working with state DOTs or federal transportation agencies (e.g., FHWA, USDOT) on AI initiatives, including developing AI roadmaps, implementations, or evaluations in ITS.\nDemonstrated hands-on experience proposing, designing, developing, and deploying AI systems within ITS, such as for freight classification, traffic crash prediction, or WIM data analysis.\nFamiliarity with transportation-specific data sources (e.g., HSIS, SHRP2, NGSIM) and standards (e.g., SAE J2735 for V2X).\nExperience in synthetic data generation, generative AI (e.g., LLMs), or physics-informed ML for transportation applications.\nKnowledge of federal AI governance, risk management, and equity considerations in transportation.\nProject management experience, including leading AI tasks in multi-agency initiatives or contributing to communities of practice (CoPs).\nPublications or presentations in AI/transportation conferences (e.g., TRB, ITS America).\nAnticipated salary range for this role is $95,000-$130,000\n\nCome break things (in a good way). Then build them smarter.\nWe're the tech company everyone calls when things get weird. We don’t wear capes (they’re a safety hazard), but we do solve high-stakes problems with code, caffeine, and a healthy disregard for “how it’s always been done.”\nOriginal Posting:\nOctober 3, 2025\n\nFor U.S. Positions: While subject to change based on business needs, Leidos reasonably anticipates that this job requisition will remain open for at least 3 days with an anticipated close date of no earlier than 3 days after the original posting date as listed above.\n\nPay Range:\nPay Range $85,150.00 - $153,925.00\nThe Leidos pay range for this job level is a general guideline only and not a guarantee of compensation or salary. Additional factors considered in extending an offer include (but are not limited to) responsibilities of the job, education, experience, knowledge, skills, and abilities, as well as internal equity, alignment with market data, applicable bargaining agreement (if any), or other law."
  },
  {
    "title": "Data Scientist - Forecasting Center of Excellence",
    "company": "Vanguard",
    "location": "Scottsdale, AZ 85260 \n(North Scottsdale area)",
    "salary": "",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0BWQs_M7ZA8XLbIFWVw-PYcVVEPryqVLyWhKaEKPskHy2YkbHyHJDwB_nHc5A6JaMT283wnskbTAKchFyO7HUCcjmgpES9sBRLGxFEw4mmQZH-xAtqI2wzFX2yX1zvRUEhv6ASqGatYntmpjNhHDVRxFYOX9fEI7GOP0Y5CE_Gk0WPcqW3cMg4J0wfk8hH1lV_tJBrbLj7kR5BnoZ9pgebgBOVeSSXf9MTAgpxCd0bnWEW3CrA0syasKxTO5MgBu8n9-tEQ4hk4L0nLVLSL1pwu7JqalFBkTwScmtEU0t6swun6Z7HetyLTpxUUXtFpX-ASTAxA39mKMAemutXKiRb9LmJolipbpQB4U7VoUCaUtx_CdH-ztwSA6NEVsOIWLxUDnqBi4tqffRkOnnyagm6HthQeh3NXYgKE60Jf1O_f3G0Y6IRzCI06wnH4ACppGKW6Ef5klGuvIM8ozdWryJfvkhvqVD5Fa7fdvf4HncA9unkQMlMhwsivA43Bdeov-Y2iJZOXVGzOAbFmX5JCfFRb7brFNgSeQSNPCIlCZQ124eEVAlRROYabLwPQax91bnnwt60IhZqQ5f_zqDrEQ3EiP6EC_tRlKPUIBlsNUto0i-jWIYHlpbA8vNKgT6N0VrL-44Ej3AZ1OZ-0Y5i7kHt05qWZlTA-AWKC77qCMfiZwjoNWbIIdwFrYDq_mmJbM7qbEcU4dr2jcZ7JFD3l_NblhkH0uTzvTswPaUzPO5XN1k7Nau4GMTYvPl34EnocFsmq41VErKNVR8MDrFZ3xoOFRvnXaySEEOY4Z0xSxPF3BCpU1ye3di30rQe22JYcpP-5ENVtZhqJMvzrvs7O4jPmEBZ2SRvuszYDWdjHWZ_3bKvZWH_sZCBGHcCC66uXWWrlOjswnY6j-L30ZGvyaSeVBQ5UrXnhILHbPayEhbM3v_W18sut6CqNWMZmE__1LqeWq_hzOCi2bIrSHaNdXyB9Zg9TtaE2_eeyjK9PzKClv43SXNk2yk1AZyqsakvIjiG6ZJTClS6-7Q2YGXLTeJx0YdROszrDKHg9iErR6iSpW2S11EPiIzziICY2SVDWe3F8Njl_xn2JgcVQShSgCw92n57piSp-pOSm15Pu7V4orv4dRHXzPgSkhideOhttl29Bxh1lgncBwCe2wlwmWZ-mBhp11OWma2WWzw-Za5-9BFWUDCrhsd604S9ExwW1hXvk8eKVe0j1GXZ8nUA8muJVWnBuksuBlEyywrEujFNlSdUcyFnA_J_of1bzy-0iG5QrCLXNKz5oyaX4cfgcd-grT2JFQQKpq5ele4JX88AoE9pwxfDpa2_pMV4mrcQliT39z0tZsQw_NUJvHfX2zAkByETxg5zNlJfkDvMOWySJcFK6wgvJLNGoXTO4U7fOFbE=&xkcb=SoBG6_M3sjZw1xQpUp0GbzkdCdPP&camk=G42KULXkIwN4Jhi8z6A3Ow==&p=13&fvj=0&vjs=3",
    "description": "As a Data Scientist in the Forecasting Center of Excellence (FCOE), you will play a pivotal role in enabling operational success across Vanguard’s Personal Investor & AWM divisions by delivering accurate, timely, and actionable forecasts across various channels (phone calls, appointments, back-office processing, etc.). This role blends advanced analytics, strategic insight, and cross-functional collaboration to optimize staffing and resource planning in a dynamic financial services environment.\nCore Responsibilities:\nDevelops complex queries and performs extensive programming to access, transform, and prepare data for statistical modeling.\nLeads and executes deep dive diagnostic, predictive, and prescriptive analytics to support data-driven business decision making. Mentors and develops junior data scientists and analysts.\nIdentifies and diagnoses data inconsistencies and errors, documents data assumptions, and forages to fill data gaps.\nEngages with internal stakeholders to understand and probe business processes in order to develop hypotheses. Brings structure to requests and translates requirements into an analytic approach.\nGuides test design, research design, and model validation. Provides statistical consultation services. Serves as the analytics expert on cross functional teams for large strategic initiatives and contributes to the growth of the Vanguard analytic community.\nPrepares and delivers insight presentations and action recommendations. Communicates complex analytical findings and implications to business leaders.\nParticipates in special projects and performs other duties as assigned.\n\nQualifications:\n5 years related work experience in Data Analytics roles\nStrong analytical and technical aptitude, with proficiency in SQL, Python, Tableau, and Microsoft Suite.\nExcellent communication and influencing skills to drive alignment across business units.\nAbility to pivot quickly, manage multiple forecasts, and deliver under tight timelines.\nExperience utilizing statistical and machine learning methods required.\nPreferences:\nUnderstanding of operational planning in a call center environment\nUndergraduate degree in Analytics, Applied Mathematics, Economics, Statistics or related analytical field of study or equivalent combination of training and experience. Graduate degree preferred.\nSpecial Factors\nSponsorship\nVanguard is not offering visa sponsorship for this position.\nAbout Vanguard\nAt Vanguard, we don't just have a mission—we're on a mission.\nTo work for the long-term financial wellbeing of our clients. To lead through product and services that transform our clients' lives. To learn and develop our skills as individuals and as a team. From Malvern to Melbourne, our mission drives us forward and inspires us to be our best.\nHow We Work\nVanguard has implemented a hybrid working model for the majority of our crew members, designed to capture the benefits of enhanced flexibility while enabling in-person learning, collaboration, and connection. We believe our mission-driven and highly collaborative culture is a critical enabler to support long-term client outcomes and enrich the employee experience."
  },
  {
    "title": "",
    "company": "",
    "location": "",
    "salary": "",
    "url": "https://www.indeed.com/viewjob?jk=f1e2d3c4b5a67890",
    "description": "None"
  },
  {
    "title": "Senior Sports Data Scientist",
    "company": "ESPN",
    "location": "Bristol, CT 06010",
    "salary": "",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0DAFTyt7pbDCC2JPO79CSdi1dIb81yjczP5qsKcZIxgiYm3-7g-689Ur9xqU8QiYHX0nWTiBpke9aEaeuwKMU88BW56ZucgcB67vwjyyVYq5brNDW6CST6DP2B0c8OuJqwOkrkwJ1IFaKwjgg_XfzzhWVeEFQT7r0Rr_kDiiwCT4gfyqnLwQyC2ozM-UMOACSSlUad0A3XkB5qYP9zgnNMBQHQ2V6CTlhtVJ63h4HGWqf0IRiZNjGen11WOy7R2oFa6L0FXL5rFqEbrd7OoGe1us-ZxX6iWCEEK45H-O7Fw45ByoWBuqx94G17JL7cfmPU5wHrY2XtXIhGVd3gnsgbHgGopHAxfxxsbib6RNmDUmOINgM8JRNjvGsJoriO4amjvOYOD7vZYYGUtilHx6SLxyxVTL7h4JXcyxT_RmVcQ5cxUIhXp3vAbRjfss1juuotKpF5thkVfh__bCqUQ1VpMjOqBW40ppQYG05Hh8_s5-pzNlMvRze4nslT4S5_VrWGzro_alvHAwXhhoWSXauef2Vf0LoZSnBkEQhwBNsWmcsa0qLG_OAJeIol75rOdACXOzbvnM0hwBirUtaHM8G90YwFDgxTWl3tTppzJVtfrXOBKb9xZvzuMiwm9Cmck3NDZSQZryLWG7MpMOvLiwnUf_mNeyi3dOjEPiHsKDwy9uWYxPds2RgwXLgBDiO4luYEuGhzjkT9l6f-iMyqBQ_Shj-ie4bezFbomjV8h-gJrb46n3aLWezQm5zG-cp94q9Dqj0wWin6WFeVSys19t7krHzZybuQ8On6YCEvfE1W6TEaP1zH5gIqI&xkcb=SoDm6_M3sjaHxnwByh0IbzkdCdPP&camk=xqnMBGaf-K-LH0uwewBq_g==&p=2&fvj=0&vjs=3",
    "description": "The Senior Sports Data Scientist will serve as a technical leader in designing and implementing advanced predictive models and metrics that power ESPN's analytics products and storytelling. This role combines cutting-edge data science with sports domain expertise to create innovative solutions that enhance storytelling across television, digital, and emerging platforms. The ideal candidate will architect complex statistical models, leverage machine learning techniques to uncover new insights, and translate sophisticated analyses into compelling narratives that resonate with diverse audiences. This position blends hands-on technical excellence with leadership responsibilities, requiring someone who can deliver sophisticated analyses while managing projects, mentoring junior team members, and partnering with engineering, product, and content teams.\nResponsibilities:\nDesign and implement advanced machine learning models and statistical algorithms to predict player and team performance, including pre-game and in-game predictions\nApply modern techniques including deep learning, Bayesian methods, ensemble models, and reinforcement learning to solve complex sports analytics problems\nLeverage AI technologies to enhance analytics capabilities and create innovative solutions for sports player and team evaluation\nCollaborate with engineering teams to deploy models at scale, ensuring robust performance in production environments\nTransform complex statistical findings into clear, actionable insights that enhance storytelling across all ESPN platforms\nPartner with product and content teams to identify high-impact opportunities for analytics integration\nMentor junior data scientists and establish best practices for code quality, model validation, and documentation\nPresent findings to senior leadership and external stakeholders, adapting communication style for technical and non-technical audiences\nStay current with academic research and industry trends in sports analytics, machine learning, and data science\nContribute to the team's technical strategy and help evaluate emerging technologies and methodologies\nQualifications:\nMinimum 5 years of experience in data science, machine learning, or quantitative analytics, with demonstrated expertise in sports analytics preferred\nAdvanced proficiency in Python or R for statistical modeling and machine learning\nExpert-level SQL skills and experience with database systems\nDeep understanding of statistical methods including regression analysis, time series forecasting, Bayesian inference, and causal inference\nProven track record of deploying machine learning models to production and monitoring their performance\nExperience with cloud platforms\nExperience with version control (Git) and software engineering best practices\nStrong communication skills with ability to explain complex technical concepts to diverse audiences\nDemonstrated passion for sports with working knowledge of major sports leagues, players, teams, and statistical trends\nAbility to work in a fast-paced environment with competing priorities and tight deadlines\nFull availability for this position, including occasional nights, weekends, and holidays during major sporting events\nRequired Education:\nBachelor's Degree in Statistics, Computer Science, Mathematics, Engineering, Economics, or related quantitative field, OR\nHigh School Diploma/Equivalent with Minimum 5 years of relevant data science experience demonstrating equivalent expertise\nPreferred Education:\nAdvanced degree in Statistics, Machine Learning, Computer Science, Operations Research, or related quantitative field\nAdditional Information:\nSchedule Flexibility: This role requires flexibility to work outside standard business hours ahead of and during major sporting events, playoffs, and breaking news situations. Occasional weekend and holiday work will be necessary to support live productions and time-sensitive analytics.\n#ESPNMedia"
  },
  {
    "title": "Principal Associate, Data Scientist - US Card (New To Credit Team)",
    "company": "Capital One",
    "location": "Chicago, IL 60695 \n(Loop area)",
    "salary": "Full-time",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0C3j_zLGvpMLCdiZ0WC46XqVTA1VMZzOzKXPhAXwYlrNc2ZimNTpf2_4MHwNa_erOwFyaDJAylqip8WmBwwjyaJn4MxNc8tlacegQGzdxQFzyuddk-dtBS0YMPqXYfe41cxAli8KWdhhHoFaSmA0h8trKhvGV3sN5kspRsikWR-btxCfzShWI3oWs2FsLwEY0wOme0HzL89DJtBcs-myvdDwQRHWnzwqTIFUj2t6lC2gq2a7DMfohPZe24goR2hN89NkYz0NJlgH74KeXPAtFzofEWet5qqcZD3JBgATGpJTAGI8tHjhA97hwxRD3A5bnfg091DVlF93khGJLAlLggafrprmOD3lnQz-ijbgbi6aREtH7xDloN3HlA7qA07Sr9TXDCs1MPbnhLSCGNqYD1ycUq4IA072BVdXO8c262Roq_mHtTjZ8WS0wx0LqKicZ2E0V05pKVfI7x54Lbm7U0cIC996-QhjHAY8YU_ptAR-DGaVZ_JjmnPx4jCyNvXKiJAUxjiNMzVNFXhgKoJQ0ffFehjaEEkQM5QFV-LH7s9SxvOLgDROpYfHE51Y70sxf00i9TZ3O0LocjJwhBDkhJ_3mS_MFg5iamFSoPn7FjSEYSBI-ONNyiF0d1ommR4MiORBJRTP6JnVQbB3lp9xLQNQWpYOlZnVOZE3SoA9ggOnink7hq8hNqMh8Qi6lMolJ8bCgB40mj2nQWzu0BJ3tbnSC5daK63VbC1yCaqwv53TQakEBHDrb3UAt6O6jezboO8s3OuFD2Bc0vytZA7jU1oWTPZVXU60yzbYDu4a-K0JIu7z8Va67ybQ2-M2TTHoxdD-LMYeSUmCOzwR7Ald6mf4yVREBKSR60lFrGm9h13hKPujBb8QpdsHIzdm9w0ADdmo0kyw2tWQ6VKJq6SxvFzI5RCCUFVisYRf9Z6D2otjYcr8GfZzV5a5lwRXlog6mbLhsqjvOVXkGirrQxp39irw22KGMe9jfPxI0mCVs6KIIVM7QR7VrBPq_7iq-kMBED0ar7GsGzvnonHVcLkd3Jm9w584QHa9CsCrKET-f0FgCEtG_vCFtcU304THhenrE7qPT5OeGRUIoH814uz5oCkC-Hgw-IOtvpZ6jwoECe93OBF7eCF95N7ivK-HBCbKu2NDMZu1FsJx2NDbNhOPSvFSZZxveeiBdnFbQGAgijALfn3HwH0KY7LI-F6C2zgGPyXv_9O4R_emZ7-BhaI3q8L6Zsb0Vgr5PEje7DpI9nh-ybasMPf9SUdPz-uM-SwvQWKnqdOSk_JJ0hwmmM2iWYW&xkcb=SoBS6_M3sjaHxnwByh0JbzkdCdPP&camk=4HOcmqOLYrByKel4K0fjog==&p=1&fvj=0&vjs=3",
    "description": "Principal Associate, Data Scientist - US Card (New To Credit Team)\nData is at the center of everything we do. As a startup, we disrupted the credit card industry by individually personalizing every credit card offer using statistical modeling and the relational database, cutting edge technology in 1988! Fast-forward a few years, and this little innovation and our passion for data has skyrocketed us to a Fortune 200 company and a leader in the world of data-driven decision-making.\nAs a Data Scientist at Capital One, you’ll be part of a team that’s leading the next wave of disruption at a whole new scale, using the latest in computing and machine learning technologies and operating across billions of customer records to unlock the big opportunities that help everyday people save money, time and agony in their financial lives.\nTeam Description\nThe New to Credit Data Science team develops machine learning models for marketing, risk, and valuation. These models help our business partners make informed marketing and underwriting decisions throughout the credit card lifecycle. We prioritize advanced modeling techniques, alternative data sources, and robust infrastructure to enhance decision accuracy and efficiency. Additionally, we conduct thorough statistical analysis to generate insights that influence various business strategies. You will collaborate with data scientists, business analysts, and software engineers on all stages of model development. This work will be conducted in a supportive environment that values your contributions, encourages new responsibilities, promotes ongoing learning, and rewards innovation.\nRole Description\nIn this role, you will:\nBuild machine learning models through all phases of development, from design through training, evaluation, validation, and implementation\nLeverage a broad stack of technologies — Python, Conda, AWS, Spark, Kubeflow Pipelines, and more — to reveal the insights hidden within huge volumes of numeric and textual data\nPartner with a cross-functional team of data scientists, software engineers, and product managers to deliver a product customers love\nFlex your interpersonal skills to translate the complexity of your work into tangible business goals\nThe Ideal Candidate is:\nA data guru. “Big data” doesn’t faze you. You have the skills to retrieve, combine, and analyze data from a variety of sources and structures. You know understanding the data is often the key to great data science.\nStatistically-minded. You’ve built models, validated them, and backtested them. You know how to interpret a confusion matrix or a ROC curve. You have experience with clustering, classification, sentiment analysis, time series, and deep learning.\nTechnical. You’re comfortable with open-source languages and are passionate about developing further. You have hands-on experience developing data science solutions using open-source tools and cloud computing platforms.\nCustomer first. You love the process of analyzing and creating, but also share our passion to do the right thing. You know at the end of the day it’s about making the right decision for our customers.\nBasic Qualifications:\nCurrently has, or is in the process of obtaining one of the following with an expectation that the required degree will be obtained on or before the scheduled start date:\nA Bachelor's Degree in a quantitative field (Statistics, Economics, Operations Research, Analytics, Mathematics, Computer Science, or a related quantitative field) plus 5 years of experience performing data analytics\nA Master's Degree in a quantitative field (Statistics, Economics, Operations Research, Analytics, Mathematics, Computer Science, or a related quantitative field) or an MBA with a quantitative concentration plus 3 years of experience performing data analytics\nA PhD in a quantitative field (Statistics, Economics, Operations Research, Analytics, Mathematics, Computer Science, or a related quantitative field)\nPreferred Qualifications:\nMaster’s Degree in “STEM” field (Science, Technology, Engineering, or Mathematics) plus 3 years of industry experience in data science, or PhD in “STEM” field (Science, Technology, Engineering, or Mathematics)\nAt least 1 year of experience working with AWS\nAt least 3 years’ experience in Python\nAt least 3 years’ experience with building machine learning models, with at least one year of experience with building GBM models\nAt least 3 years’ experience with SQL\nCapital One will consider sponsoring a new qualified applicant for employment authorization for this position.\nThe minimum and maximum full-time annual salaries for this role are listed below, by location. Please note that this salary information is solely for candidates hired to perform work within one of these locations, and refers to the amount Capital One is willing to pay at the time of this posting. Salaries for part-time roles will be prorated based upon the agreed upon number of hours to be regularly worked.\nChicago, IL: $144,200 - $164,600 for Princ Associate, Data Science\nMcLean, VA: $158,600 - $181,000 for Princ Associate, Data Science\nNew York, NY: $173,000 - $197,400 for Princ Associate, Data Science\n\nCandidates hired to work in other locations will be subject to the pay range associated with that location, and the actual annualized salary amount offered to any candidate at the time of hire will be reflected solely in the candidate’s offer letter.\nThis role is also eligible to earn performance based incentive compensation, which may include cash bonus(es) and/or long term incentives (LTI). Incentives could be discretionary or non discretionary depending on the plan.\nCapital One offers a comprehensive, competitive, and inclusive set of health, financial and other benefits that support your total well-being. Learn more at the Capital One Careers website. Eligibility varies based on full or part-time status, exempt or non-exempt status, and management level.\nThis role is expected to accept applications for a minimum of 5 business days.\nNo agencies please. Capital One is an equal opportunity employer (EOE, including disability/vet) committed to non-discrimination in compliance with applicable federal, state, and local laws. Capital One promotes a drug-free workplace. Capital One will consider for employment qualified applicants with a criminal history in a manner consistent with the requirements of applicable laws regarding criminal background inquiries, including, to the extent applicable, Article 23-A of the New York Correction Law; San Francisco, California Police Code Article 49, Sections 4901-4920; New York City’s Fair Chance Act; Philadelphia’s Fair Criminal Records Screening Act; and other applicable federal, state, and local laws and regulations regarding criminal background inquiries.\nIf you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation, please contact Capital One Recruiting at 1-800-304-9102 or via email at RecruitingAccommodation@capitalone.com. All information you provide will be kept confidential and will be used only to the extent required to provide needed reasonable accommodations.\nFor technical support or questions about Capital One's recruiting process, please send an email to Careers@capitalone.com\nCapital One does not provide, endorse nor guarantee and is not liable for third-party products, services, educational tools or other information available through this site.\nCapital One Financial is made up of several different entities. Please note that any position posted in Canada is for Capital One Canada, any position posted in the United Kingdom is for Capital One Europe and any position posted in the Philippines is for Capital One Philippines Service Corp. (COPSSC)."
  },
  {
    "title": "Data Scientist - QA Test",
    "company": "IBM",
    "location": "Austin, TX 78716",
    "salary": "Full-time",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0C1ihjj1FYx73_02yGTS96r3SNeUtc-9S9zmnK0ry7bjnQ6Jf2s4KR_7BSE-wQz5x-GUQw7VXD-yufTzgJvXMCacofirUC5DwuQ_hFRilDSdFqaMbX921dHYMDYyZy9u62Ss_ZipDE8gmDTVL8RMubJeLKw_-NZUbnTX115OMkRWECwy4my0SYEBgAOqk-tKgmf5tGLqBxhuZEb-otC-YhGjuxu5u91Aqd0RiL8uDz9eOBXChpQrOMny7aXqf9ol04sI-QvhMM8cTEXJx0zRM38HySOwfgzFqW7opOf7Yb0qNqW3YOIu_H0u0FvRHq_MOlulVgX2kpCrealtyeKtUNyFY2GtUY6UcbNhxysqjHR_eaxCVzTen55Wn7wMWNFzDFZckaVkBjzoRtmeqmQJSKYwwTWYcQp90wG0kmde9wrlaS64tpU4m9fjw4guj6PNYwXgWrH_zSxsiEBJzPBzP9Dp65ataAMvqc4wnSLnrTO-CLO56Bl5gpCczgmx8RcR7C-15LX5q23kBC4TKeFIeNb3jsX6AlVdHKzdEquxw3WI0344U-UZgqzkzA9F0RGY7wOfWfQqXpbfzGbnMBud8rMPd4oT0AbqiGLguP5uWn3WY3JRAA2CH91CJful5_OiaTVKExdnm5_wv9WLUg47zPOFO1rGK0tB-w=&xkcb=SoDP6_M3sjaHxnwByh0KbzkdCdPP&camk=UoKtGZLa3XLGJ1QJWibkvA==&p=0&fvj=0&vjs=3",
    "description": "Introduction\n\nA career in IBM Software means you'll be part of a team that transforms our customer's challenges into solutions.\n\nSeeking new possibilities and always staying curious, we are a team dedicated to creating the world's leading AI-powered, cloud-native software solutions for our customers. Our renowned legacy creates endless global opportunities for our IBMers, so the door is always open for those who want to grow their career.\n\nIBM's product and technology landscape includes Research, Software, and Infrastructure. Entering this domain positions you at the heart of IBM, where growth and innovation thrive\n\nYour role and responsibilities\n\nThe Data Scientist role requires a highly analytical individual proficient in Python programming, database management, and data science methodologies. You'll focus on extracting insights from data, developing and implementing machine learning models, managing big data infrastructure, and supporting AI-driven product development.\n\nKey Responsibilities:\n\nData Collection and Cleansing: Collect and cleanse data from diverse sources to ensure high-quality datasets for decision-making.\n\nData Exploration and Visualization: Explore and visualize data using advanced techniques to uncover insights and trends.\n\nStatistical Analysis: Apply statistical and mathematical techniques to provide robust analytical foundations for predictive modeling.\n\nMachine Learning and Deep Learning: Develop and implement machine learning and deep learning models to address business challenges.\n\nML-Ops / AI-Ops: Demonstrate expertise in ML-Ops / AI-Ops practices to ensure efficient model deployment and management.\n\nBig Data Management: Manage big data infrastructure and execute data engineering tasks for efficient data processing.\n\nVersion Control and Collaboration: Utilize version control systems like Git for maintaining codebase integrity and fostering collaboration.\n\nAI-Driven Product Development: Design, create, and support AI-driven products to deliver impactful solutions aligned with user needs and business objectives.\n\nRequired education\n\nHigh School Diploma/GED\n\nPreferred education\n\nBachelor's Degree\n\nRequired technical and professional expertise\n\n\nFundamental education in hardware or test\nStrong communication skills\nPassion to pursue career path in engineering\nGrowth minded, trusted, team focused, courageous, resourceful, and outcome focused\n\n\n\nPreferred technical and professional experience\n\nPursuing a Bachelor's or Master's Degree in: Electrical Engineering, Computer Engineering, Computer Science, Mechanical Engineering, Materials Science, Chemical Engineering, Physics, Optics Engineering, Biomedical Engineering or related majors\n\nABOUT BUSINESS UNIT\n\nIBM Systems helps IT leaders think differently about their infrastructure. IBM servers and storage are no longer inanimate - they can understand, reason, and learn so our clients can innovate while avoiding IT issues. Our systems power the world's most important industries and our clients are the architects of the future. Join us to help build our leading-edge technology portfolio designed for cognitive business and optimized for cloud computing.\n\nYOUR LIFE @ IBM\n\nIn a world where technology never stands still, we understand that, dedication to our clients success, innovation that matters, and trust and personal responsibility in all our relationships, lives in what we do as IBMers as we strive to be the catalyst that makes the world work better.\n\nBeing an IBMer means you'll be able to learn and develop yourself and your career, you'll be encouraged to be courageous and experiment everyday, all whilst having continuous trust and support in an environment where everyone can thrive whatever their personal or professional background.\n\nOur IBMers are growth minded, always staying curious, open to feedback and learning new information and skills to constantly transform themselves and our company. They are trusted to provide on-going feedback to help other IBMers grow, as well as collaborate with colleagues keeping in mind a team focused approach to include different perspectives to drive exceptional outcomes for our customers. The courage our IBMers have to make critical decisions everyday is essential to IBM becoming the catalyst for progress, always embracing challenges with resources they have to hand, a can-do attitude and always striving for an outcome focused approach within everything that they do.\n\nAre you ready to be an IBMer?\n\nABOUT IBM\n\nIBM's greatest invention is the IBMer. We believe that through the application of intelligence, reason and science, we can improve business, society and the human condition, bringing the power of an open hybrid cloud and AI strategy to life for our clients and partners around the world.\n\nRestlessly reinventing since 1911, we are not only one of the largest corporate organizations in the world, we're also one of the biggest technology and consulting employers, with many of the Fortune 500 companies relying on the IBM Cloud to run their business.\n\nAt IBM, we pride ourselves on being an early adopter of artificial intelligence, quantum computing and blockchain. Now it's time for you to join us on our journey to being a responsible technology innovator and a force for good in the world.\n\nIBM is proud to be an equal-opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, gender, gender identity or expression, sexual orientation, national origin, genetics, pregnancy, disability, neurodivergence, age, or other characteristics protected by the applicable law. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.\n\nOTHER RELEVANT JOB DETAILS\n\nSupplemental 1 employees may be eligible for up to 8 paid holidays, minimum of 56 hours paid sick time and the IBM Employee Stock Purchase Plan. IBM offers paid family medical leave and disability benefits to eligible employees where required by applicable law.\nThis position was posted on the date cited in the key job details section and is anticipated to remain posted for 15 days from this date or less if not needed to fill the role.\nWe consider qualified applicants with criminal histories, consistent with applicable law.\n\nIBM will not be providing visa sponsorship for this position now or in the future. Therefore, in order to be considered for this position, you must have the ability to work without a need for current or future visa sponsorship."
  },
  {
    "title": "Senior Applied Scientist, Customer Engagement Technology",
    "company": "Amazon Stores",
    "location": "Seattle, WA 98104",
    "salary": "$150,400 - $260,000 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0BydEt-PwzxSafgfKBSyYoDAhNeqE10ndmi56ARgCNnas-rtLmlGo07gjh2r5gPh0b31AC1zR34bWe1JpUyg4mpCW-CrZGVqQbtwUfrUxJI0j_OwNAbUbtzRowy5tB8tDC83NuVcaWYCVyhXoDosenH_H2xz0sVMXjZTG33bzx4lQx2c4a2HcsobbGQ1NYqbLan0Sn-LOEvWEIERDY_4-eY8ITkAzJOxupEq7vRCcX89jR1sXU70a-i5q_myDJpjnCOQ_gyzgpoXfb6Ti63GqvlxTQIe_vvutTKSl5hZUbojKdqQOtBgU-9aEF7KmF9CyRDSuuMtegH3DuNIyhxWkUsnogdeKlsnSGm0zEgr79czcD8M-ZFzjBOi9zduiq4Q2e08QGM94q-oWFr0LxfX9ouMcllAu9kpTtCK3cN9WHoRw_Oy3rIhTCInIFl--cVdf6eRLUrOaMtrDgEn_FVRS_quTOLg5bQqhWYxoC1lpSkrlZAXox_s6ifWg5i8nmng7tn4jUVSJbY9G8w6DLWxKVDs_fSJNP8MZm6NICpIBgO0dAJzVGXZ2AkAHrkokIIs7O8H5jvzoJIAiaOc9VhqJ5fCUfSzZ5CvVeSrrZ0DoqJkoLOYkxggRNk5MYO1cP9iQgb6W2mlFu5VO1JZJNIEzm67aHzxETvqcw=&xkcb=SoBo6_M3sjaHxnwByh0PbzkdCdPP&camk=UoKtGZLa3XJLJt1kXPqJjw==&p=3&fvj=0&vjs=3",
    "description": "The Senior Applied Scientist in Natural Language Processing (NLP) within the Customer Engagement Tech, Self-Service and Automation team will work on the research, design, and implementation of solutions to key challenges in developing, evaluating, and deploying systems based on large pretrained language models. These models will be integrated into conversational AI systems that can understand and communicate with customers in a natural and contextually appropriate manner.\n\nThis role involves model development in areas such as multi-turn dialogue management, knowledge grounding, and open-ended generation, as well as the assessment of dialogue quality and style of the conversational model.\n\nThe position requires working with a cross-functional team, including scientists, engineers, and product managers, to develop scalable and maintainable AI solutions for both structured and unstructured data. The ideal candidate has strong technical skills in Machine Learning (ML), NLP, and Generative AI (GenAI), excellent written documentation skills, and experience with big data technologies. Success in this role requires combining deep business knowledge with hands-on technical skills to solve customer problems and address complex technical challenges.\n\nKey job responsibilities\nLead the research and development of LLM-based chatbots and conversational AI systems for customer service applications.\nDesign and implement state-of-the-art NLP and ML models for tasks such as language understanding and dialogue quality assessment.\nCollaborate with cross-functional teams, including data scientists, software engineers, and product managers, to integrate LLM-based solutions into Amazon's customer service platforms.\nDevelop and implement strategies for data collection, annotation, and model training to ensure high-quality and robust performance of the chatbots.\nConduct experiments and evaluations to measure the performance of the developed models and systems, and identify areas for improvement.\nStay up-to-date with the latest advancements in NLP, LLMs, and conversational AI, and explore opportunities to incorporate new techniques and technologies into Amazon's customer service solutions.\nCollaborate with internal and external research communities, participate in conferences and publications, and contribute to the advancement of the field.\n\nA day in the life\nAmazon offers a full range of benefits that support you and eligible family members, including domestic partners and their children. Benefits can vary by location, the number of regularly scheduled hours you work, length of employment, and job status such as seasonal or temporary employment.\nThe benefits that generally apply to regular, full-time employees include:\n1. Medical, Dental, and Vision Coverage\n2. Maternity and Parental Leave Options\n3. Paid Time Off (PTO)\n4. 401(k) Plan.\nIf you are not sure that every qualification on the list above describes you exactly, we'd still love to hear from you! At Amazon, we value people with unique backgrounds, experiences, and skillsets. If you’re passionate about this role and want to make an impact on a global scale, please apply!\nBASIC QUALIFICATIONS\n3+ years of building machine learning models for business application experience\nPhD, or Master's degree and 6+ years of applied research experience\nExperience programming in Java, C++, Python or related language\nExperience with neural deep learning methods and machine learning\nPREFERRED QUALIFICATIONS\nHands-on experience developing and deploying GenAI applications, such as language models, text classification.\nStrong understanding of GenAI or NLP fundamentals.\nProficiency in designing and implementing large-scale data pipelines, and cloud-based data infrastructure.\nProven track record of tackling highly ambiguous, complex data challenges and delivering impactful solutions.\n\nAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\n\nOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $150,400/year in our lowest geographic market up to $260,000/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site."
  },
  {
    "title": "Data Scientist - Forecasting Center of Excellence",
    "company": "Vanguard",
    "location": "Scottsdale, AZ 85260 \n(North Scottsdale area)",
    "salary": "",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0BWQs_M7ZA8XLbIFWVw-PYcVVEPryqVLyWhKaEKPskHy2YkbHyHJDwB_nHc5A6JaMT283wnskbTAKchFyO7HUCcjmgpES9sBRLGxFEw4mmQZH-xAtqI2wzFX2yX1zvRUEhv6ASqGatYntmpjNhHDVRxFYOX9fEI7GN4armBZtet1a52xSp58Ud0JNkw3va3Hl6HWQe2d0acknU7nxWOn12D7l-vDmP0120fkCeuTkLfg92sBR7KTkIMZJnZeGT7HLBRZvlp75iqsoKnuYUCW6izI9ifu9RerEsmz6dNvKM0jEYChYuOEOGqOBzOff8AUMcTVPFoPUElYBLy0QaHe5r6oyqTB9K0sDd03FGgt6cOJR3KWD2sGbEaFlDWkwCeFt33wPhF9LVDTv13XVZ7T0OBVWoFXtKM_wq7Qw8KQZx2I2eC2Muik96TBrLZXTI4YC0EsahxGJDupgv2pLdeD_WbZvdh4Eg6NDLTnAjiietnPUFK7j2xtlcai-X-wnIqtZPk3SKNyHGElj_WrFArZFSSvxlJZU5qbKBtRkiVfCstFKmNGaN2d5X63rfnlXbWLoylRq2_l68TY-dlaA0y0y-EQLf5oyKAUGuJiegM2vgw5mB8o13F213B6sCKRCCaFHs7st5JtIox_tJ0tzsSypReoTuCjhrQZaDzV1tXjTPIseHY0pmtfnWQY-4ZOsuK5Ch6s3gyHbEUZHu2egrMrFT8PhCl7VP8F4cK28ISVbx_1Rr10SXT75V8AjtJ5o3V58m0NjSIeKMLyuI6beYcjSFXqgEqiU5GV740PhQRRsIdgG6LUAskbjw0-0Js-t-srFXD3Fc3Cc-8Kg0x_fAXvJN6FMuNt2KaIwuUM2JVjAghEJrmTrFMlbABANmze5BGi3qBcywWilEsWWo7lXSuz4Oj4Sw_Wt7q7cO6PcFwrIVWJsVtCvvOV6jlYErkSn7l0WdIdEIaf0iiD1c2bEX53dN8lfe0_iJWYuvBSj2EOQFIWkFoWmzDIQRRkvNQPSIbpKzBoCsnikwJC4I-De1kQhRbRXQ51SzzFMV_ttisnVvj5ln8xMy0_Hh0n1Rc1gtzwxMdhnpcRpmZyY10Hk9p1Q10hr1ygKLONimnakPthikOiYzgCVi_qJ0jnkxWc1GO6CiiqwnFg-xHXUpM35V7u-R8ZFT6JJYh0CquWSXZMOFhtaGtXtJsolUjUHY5whAicIRPrXNR6NrRRzal8pVIsgzuDBtWjOKagYYSUkBHwvEsRMnmLr3KCHaVUpRNZIYc8_arlbZ4bRdCz5OVrqwGG0oYt-J76qOawGN7i5lLTR8opmIFVX7_Pz0SHHCSaQi3hCrRnHEISq2wJIy4zW1O0JjQEJY6VqeApzRHBP8cGy43LM2rySBQlgUcAAiDYUItULs=&xkcb=SoDc6_M3sjaHxnwByh0ObzkdCdPP&camk=G42KULXkIwN4Jhi8z6A3Ow==&p=4&fvj=0&vjs=3",
    "description": "As a Data Scientist in the Forecasting Center of Excellence (FCOE), you will play a pivotal role in enabling operational success across Vanguard’s Personal Investor & AWM divisions by delivering accurate, timely, and actionable forecasts across various channels (phone calls, appointments, back-office processing, etc.). This role blends advanced analytics, strategic insight, and cross-functional collaboration to optimize staffing and resource planning in a dynamic financial services environment.\nCore Responsibilities:\nDevelops complex queries and performs extensive programming to access, transform, and prepare data for statistical modeling.\nLeads and executes deep dive diagnostic, predictive, and prescriptive analytics to support data-driven business decision making. Mentors and develops junior data scientists and analysts.\nIdentifies and diagnoses data inconsistencies and errors, documents data assumptions, and forages to fill data gaps.\nEngages with internal stakeholders to understand and probe business processes in order to develop hypotheses. Brings structure to requests and translates requirements into an analytic approach.\nGuides test design, research design, and model validation. Provides statistical consultation services. Serves as the analytics expert on cross functional teams for large strategic initiatives and contributes to the growth of the Vanguard analytic community.\nPrepares and delivers insight presentations and action recommendations. Communicates complex analytical findings and implications to business leaders.\nParticipates in special projects and performs other duties as assigned.\n\nQualifications:\n5 years related work experience in Data Analytics roles\nStrong analytical and technical aptitude, with proficiency in SQL, Python, Tableau, and Microsoft Suite.\nExcellent communication and influencing skills to drive alignment across business units.\nAbility to pivot quickly, manage multiple forecasts, and deliver under tight timelines.\nExperience utilizing statistical and machine learning methods required.\nPreferences:\nUnderstanding of operational planning in a call center environment\nUndergraduate degree in Analytics, Applied Mathematics, Economics, Statistics or related analytical field of study or equivalent combination of training and experience. Graduate degree preferred.\nSpecial Factors\nSponsorship\nVanguard is not offering visa sponsorship for this position.\nAbout Vanguard\nAt Vanguard, we don't just have a mission—we're on a mission.\nTo work for the long-term financial wellbeing of our clients. To lead through product and services that transform our clients' lives. To learn and develop our skills as individuals and as a team. From Malvern to Melbourne, our mission drives us forward and inspires us to be our best.\nHow We Work\nVanguard has implemented a hybrid working model for the majority of our crew members, designed to capture the benefits of enhanced flexibility while enabling in-person learning, collaboration, and connection. We believe our mission-driven and highly collaborative culture is a critical enabler to support long-term client outcomes and enrich the employee experience."
  },
  {
    "title": "Data Scientist (Biological Science)",
    "company": "Cognizance Technologies",
    "location": "Remote",
    "salary": "$100,000 - $160,000 a year",
    "url": "https://www.indeed.com/rc/clk?jk=4a7e31def999e091&bb=WmQeSEvUnEIphyfArmic8-oit4UkVU9z7InHokiBprnCKylovqbR1eUQCvOnGZcTqwKbRlyGSFtgxmjDFgjKTB3X2hrM5hR9h-tKDJhNUx6uGW3quN1oeSl4TU5rjEWmLzpqCm3-SEiBfd7m3CFncg%3D%3D&xkcb=SoAB67M3sjaHxnwByh0MbzkdCdPP&fccid=9279394d9ebbcf6c&cmp=Cognizance-Technologies&ti=Data+Scientist&vjs=3",
    "description": "Key Responsibilities: ONSITE ROLE- SILVER SPRING,MD\nProvide various types of technical support including designing, implementing, and maintaining data science models and workflows.\nValidate analytical model results and effectively communicate them with stakeholders.\nDevelop dashboards for visualizing and communicating quality surveillance output.\nPrepare and deliver presentations to present findings and communicate insights.\nProvide project management and documentation of data science projects.\nDevelop an understanding of data sources and integrates heterogeneous data sets.\nClean, organize, and perform analysis on large data sets.\nInvestigate relationships between variables to identify trends in the data.\nResearch and identify root cause/data issues. Ensure timely delivery of reports and manage conflicting priorities and customer expectations.\nPerform periodic check-ins for status and feedback.\nDocument the unmet data needs of stakeholders for reporting purposes. Collaborate with cross-functional teams.\nSupport the development of quality surveillance related automation in the cloud environment, including module improvements using data analytics and machine learning.\nDevelop, maintain, and document data pipelines to support surveillance related programs.\nAssist in the maintenance and development of existing analytics, Artificial Intelligence (AI), and machine learning technologies in Databricks.\nDevelop interactive data visualizations using tools such as Qlik and Posit.\nWork with OQS Subject Matter Experts in the development, evaluation, and implementation of additional data science/AI/machine learning systems.\nUse version control software to work on data science projects in a team environment.\nPrepare technical reports and/or presentations on data science projects.\nHave weekly progress meetings with the Supervisor and Program Lead.\nProvide monthly progress reports to the Supervisor and Program Lead.\nComplete all mandatory trainings by the established deadline.\nPerform analysis to develop fully attributed logical and physical information (data) and business process models following IDEF methodologies. Transfer data into a new format to make it more appropriate for analysis.\nBasic Required Skills\nBachelor’s degree with minimum 7 years’ experience or Master’s degree with 4 years’ experience.\nKnowledge and expertise in facilitation, integration, data, and IDEF methodologies.\nProficiency in designing, validating, and communicating analytical models.\nExperience with Qlik, Posit, Databricks, Git, and cloud-based analytics.\nStrong ability to clean, organize, and analyze large heterogeneous data sets.\nEffective communication skills for presenting findings and collaborating with stakeholders.\nOther Desired Skills\nExperience with quality surveillance or similar regulatory environments.\nFamiliarity with machine learning and advanced analytics in cloud environments.\nStrong project management and documentation capabilities.\nAbility to manage conflicting priorities and meet deadlines.\nAdditional Information:\nSecurity Clearance: Must be eligible for a Public Trust (Level 5 or 6) background check. This includes access to FDA’s sensitive information and systems.\nSection 508 Compliance: All work must meet accessibility standards under the Rehabilitation Act.\nJob Types: Full-time, Contract\nPay: $100,000.00 - $160,000.00 per year\nBenefits:\n401(k)\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\nWork Location: Remote"
  },
  {
    "title": "Applied Scientist III, StoreGen",
    "company": "Amazon Stores",
    "location": "Seattle, WA 98104",
    "salary": "Full-time",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0BydEt-PwzxSafgfKBSyYoDAhNeqE10ndmi56ARgCNnas-rtLmlGo07gjh2r5gPh0Y6hDvuNSs_5il0v0DNV5C4h4ir2Tl-hgQJziPLYuGtxywnLoIjbSdSgUWJtQqqY-9yidIxKngr-zUan8fO2Kof5M-f-_dBynfqHBnV8xuNWqbuv8yc-a0pFz6RQebhv8PZKX-mfu-Xp-JGRFIbzCd4TtanbnPqI3SVZwWa8rSj2E9aYfu8a5YQshRP3FltpAtHxrPnVD7xpPBClR1hT32DVN-iWCGAD7xjnngk0GhPqkjlO0q9Z4LDbp-leQmIHZG7vmqM1Zd2vexbheJ2GKvmM607ek-KGm8HHxkxX___KcdpGa2rdjWEYQMM-oil6ja0aFn6kEPKnefl-0j1zo6Ga6q5fXzyRuDgPiAnMuECbm_TLQqT18WCT-ciiPA5xdUVeA7-OHNoHW15gXaVMgHbhdfXwzSEzfs55eKB5hwhaCVn6duJq7iA6KcaJaMVKZKUXY7Hqt_trx-UTMM0dLioVzowBx7pD-xrzeG8VDvCOLitpQdlbJD8__c-Sh-wECBahpo9oH80O0CVXu2paMadDHOXO2iGJFiNDUNC74ge0CRFJ3NFmpiurtcCZ3xiCeYElXli9XPQMaGkixH0VGiqT5GBpQoxOTeN_qhO3LM8vA==&xkcb=SoBB6_M3sjaHxnwByh0NbzkdCdPP&camk=UoKtGZLa3XJLJt1kXPqJjw==&p=5&fvj=0&vjs=3",
    "description": "Join our Generative AI focus team to innovate Software Development at Amazon\n\nAre you ready to be part of a team that's redefining the future of software engineering? Our team is Amazon's ambitious initiative to pioneer AI development practices that will fundamentally transform how we build software at scale.\n\nOur Mission\n\nWe’re building the next generation of development tools — uncovering how LLMs can originate new ways of thinking, building, and collaborating.\n\nWhat Makes Us Different\n\nGround-floor opportunity to shape the future of software development\nDirect impact on Amazon's global engineering practices\nWorking with the latest technologies and large language models\nCulture of experimentation and innovative thinking\n\nWhat We’re Looking For\nYou’ll lead the research, design, and development of AI technologies that challenge conventional software practices and uncover new ways for engineers to build and collaborate.\nYou’re comfortable working in ambiguous spaces, exploring emergent behaviors, and collaborating with designers, prototypers, and engineers to test hypotheses in live, evolving systems.\nYou explore where LLMs behave in unexpected yet promising ways, especially in tasks like context retention, code reasoning, or agent behavior , and use those moments to uncover new AI-native workflows.\n\nWe’re looking for applied scientists with experience in areas like:\n\n+ Information retrieval\n+ Context and memory modeling\n+ Agent behavior and autonomy\n+ Code understanding and generation\n+ Human-AI interaction\n\nWhat You'll Do\nPrototype new ways of working with LLMs in engineering workflows\nHelp shape and evaluate scientific approaches behind agentic systems and engineering tools\nMove fast with engineers and prototypers to guide design decisions and model choices\nMake sense of unexpected model behavior and guide what to try next\n\nImpact\n\nYour work will surface where LLMs can meaningfully change how Amazon engineers build.\nYou’ll help the team uncover which surprises are worth pursuing and where to push beyond what’s already known.\n\n✨ Always find a way ️\nBASIC QUALIFICATIONS\n3+ years of building machine learning models for business application experience\nPhD, or Master's degree and 6+ years of applied research experience\nExperience in patents or publications at top-tier peer-reviewed conferences or journals\nStrong analytical, mathematical, and coding skills (e.g., Python, C++, or Java)\nPrevious work on agents or LLMs\nPREFERRED QUALIFICATIONS\nExperience with modeling tools such as R, scikit-learn, Spark MLLib, MxNet, Tensorflow, numpy, scipy etc.\nExperience with large scale distributed systems such as Hadoop, Spark etc.\n\nAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\n\nOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $150,400/year in our lowest geographic market up to $260,000/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site."
  },
  {
    "title": "Associate Fraud Strategy Data Scientist",
    "company": "Buzzency LLC",
    "location": "San Jose, CA 95139 \n(Santa Teresa area)",
    "salary": "From $50 an hour",
    "url": "https://www.indeed.com/rc/clk?jk=1a04f2956fb7e93b&bb=WmQeSEvUnEIphyfArmic8-jnvUYHi1B3P39yvxnBueDZQpNWdEHZ7I1r043DPwjYBtC0g5Lgew7XRfBCGyZBTuR_Pnk4i3NTrxUIokCJeXkBfddcZb2PJ20XUY4LbIH3SpiJcmj2gWFffEkUE4nNfQ%3D%3D&xkcb=SoBc67M3sjaHxnwByh0CbzkdCdPP&fccid=40b44bcce2a0fbd7&cmp=Buzzency-LLC&ti=Data+Scientist&vjs=3",
    "description": "Job Summary\nAssociate Fraud Strategy Data Scientist — 6-month W-2 contract, San Jose, CA. $50/hr. 0–2 years experience in fraud/risk analytics for eCommerce/payments. Work in Pacific Time, multiple Zoom interviews with SQL assessment.\nAbout the role\nYou’ll work with the fraud & trust team to design and execute data-driven strategies that detect and mitigate fraud while preserving a great customer experience. This is a hands-on role combining SQL, Python, analytics, rule development, and dashboarding to create real-time protections at scale.\nKey responsibilities\nDesign rules and detection strategies to mitigate fraud across payments and product abuse.\nDevelop Python scripts and models to support fraud strategies and rule scoring.\nInvestigate novel or large fraud cases and identify root causes.\nWork with product and engineering to deploy controls and operationalize rules.\nBuild dashboards and visualizations to track KPIs and strategy performance (Tableau / Quicksight).\nPresent findings and recommendations to stakeholders and leadership.\nMinimum qualifications\nBachelor’s degree in Data Science, Statistics, Mathematics, or equivalent practical experience.\n0–2 years of experience in risk analytics, fraud, payments, or investigation/product abuse in eCommerce/online payments environment.\nStrong SQL proficiency; experience working with large datasets.\nProficiency in Python and key data science libraries (pandas, numpy, scikit-learn).\nExperience with data visualization tools (Tableau required; AWS Quicksight a plus).\nStrong communication skills — able to explain complex results to technical and non-technical audiences.\nNice to have\nExperience with fraud investigations, payment rule systems, or fraud typologies.\nFamiliarity working with ML teams and deploying analytic solutions in production.\nAWS experience.\nJob Type: Contract\nPay: $50.00 per hour\nWork Location: In person"
  },
  {
    "title": "Applied Scientist (Statistical Confidence)",
    "company": "Amigo",
    "location": "San Francisco, CA",
    "salary": "$150,000 - $300,000 a year",
    "url": "https://www.indeed.com/rc/clk?jk=7c1f42e2d267a8ea&bb=WmQeSEvUnEIphyfArmic89B4Bk9nTrwg0_METcJ_v_IlC6NRz3G9hYgNapFDRd4SgwtBe0DuM55Q34eMU_BkTlrcMZSda-D8GJdSj3Z18VvED-gHWhJiLSO8lRKDmXujlQWvOsQaIm87DQhHvzQ4QQ%3D%3D&xkcb=SoDB67M3sjaHxnwByh0BbzkdCdPP&fccid=322aa52cfe47a682&vjs=3",
    "description": "About Amigo\nAmigo builds trust and safety infrastructure for AI in mission-critical environments.\nWe partner with organizations in healthcare and other regulated sectors to deploy AI systems that operate reliably when the stakes are highest. Our infrastructure enables verification, monitoring, and real-time oversight—ensuring AI serves people safely at scale.\nWe've raised $6.5M from General Catalyst and GSV Ventures. Our team combines expertise in distributed systems, quantitative research, clinical operations, and regulatory environments to build AI that organizations can trust.\nAbout this role\nAs an Applied Scientist - Statistical Confidence at Amigo, you'll develop the statistical frameworks that enable organizations to make informed risk decisions about system deployment. You'll build quantified confidence systems, design risk modeling approaches, and create the mathematical foundations that translate system behavior into statistical guarantees. Your work directly enables the organizational trust that allows systems to be deployed in critical contexts.\nWhat you'll do\nDesign statistical frameworks that provide quantified confidence in system behavior\nBuild risk modeling systems that help organizations assess system deployment decisions\nCreate confidence scoring algorithms that accurately reflect system reliability\nDevelop methods for handling rare but critical events in healthcare applications\nDesign A/B testing frameworks that maintain safety while measuring improvements\nCollaborate with healthcare experts to ensure statistical models reflect clinical reality\nWhat we're looking for\nStrong background in statistical inference and experimental design\nExperience with Bayesian methods and uncertainty quantification\nTrack record of building statistical models for real-world applications\nKnowledge of risk modeling and decision theory\nUnderstanding of healthcare data and clinical decision-making\nNice to have\nHealthcare or regulated industry experience\nBackground in medical statistics or biostatistics\nExperience with safety-critical systems and risk assessment\nKnowledge of healthcare compliance and regulatory requirements\nBenefits\nHealth & Wellness\nComprehensive health, dental, and vision insurance\nMental health support and wellness coaching\nFlexible wellness stipend for fitness, therapy, or personal growth\nDaily catered lunch and dinner\nGrowth & Development\nAnnual learning budget for courses, books, or conferences\nConference attendance budget for professional development\nDevelopment setup of your choice\nAcademic collaboration opportunities\nCompensation Range: $150K - $300K"
  },
  {
    "title": "Associate Fraud Strategy Data Scientist",
    "company": "Svk Systems Inc",
    "location": "Hybrid work in San Jose, CA 95112",
    "salary": "$45 - $50 an hour",
    "url": "https://www.indeed.com/rc/clk?jk=b637cfd1ef2008c8&bb=WmQeSEvUnEIphyfArmic86QK--YjV5I2VbE0RvV1LHKDIvRxkL32EMJB5qxAi1NxtMfNxnUCo84brxPEGUoTvrTBM2wVQJ2giwaF6w-RPHihfTO6l-32_JKdCcmqX1hYCiB_LNwHniYAYbx6JvDK0A%3D%3D&xkcb=SoDo67M3sjaHxnwByh0DbzkdCdPP&fccid=374365d79bef1d7a&cmp=Svk-Systems-Inc&ti=Data+Scientist&vjs=3",
    "description": "We’d love to chat if you have:\nMaximum 2 years of experience in risk analytics, data analysis, and data science within relevant industry experience in eCommerce, online payments, user trust/risk/fraud, or investigation/product abuse.\nBachelor’s degree in Data Analytics, Data Science, Mathematics, Statistics, Data Mining or related field or equivalent practical experience\nExperience using statistics and data science to solve complex business problems\nProficiency in SQL, Python, Excel including key data science libraries\nProficiency in data visualization including Tableau\nExperience working with large datasets\nAbility to clearly communicate complex results to technical experts, business partners, and executives including development of dashboards and visualizations, ie Tableau.\nComfortable with ambiguity and yet able to steer analytics projects toward clear business goals, testable hypotheses, and action-oriented outcomes\nDemonstrated analytical thinking through data-driven decisions, as well as the technical know-how, and ability to work with your team to make a big impact.\nDesirable to have experience or aptitude solving problems related to risk using data science and analytics\nBonus: Experience with AWS, knowledge of fraud investigations, payment rule systems, working with ML teams, fraud typologies\nKey Job Functions\nDesign rules to detect/mitigate fraud\nDevelop python scripts and models that support strategies\nInvestigate novel/large cases\nIdentify root cause\nSet strategy for different risk types\nWork with product/engineering to improvement control capabilities\nDevelop and present strategies and guide execution\nExpected Outcome in 6-12 months\nWork closely with team members and stakeholders to consult, design, develop, and manage fraud strategies and rules that not only solve emerging fraud trends but also provide a great experience to end customers.\nUtilize data analysis to design and implement fraud strategies\nCollaborate with cross-functional stakeholders including product managers and engineering teams to deploy data-driven fraud solutions that operate at scale and in real time for end customers.\nMake business recommendations to leadership and cross-functional teams with effective presentations of findings at multiple levels of stakeholders.\nDevelopment of dashboard and visualizations to track KPI of fraud strategies implemented\nMUST HAVE:\nMaximum 2 years of experience in risk analytics, data analysis, and data science within relevant industry experience in eCommerce, online payments, user trust/risk/fraud, or investigation/product abuse.\nBachelor’s degree in Data Analytics, Data Science, Mathematics, Statistics, Data Mining or related field or equivalent practical experience.\nExperience using statistics and data science to solve complex business problems.\nExperience in SQL, Python, Excel including key data science libraries.\nExperience applying statistics and data science to tackle intricate business challenges especially in Fraud mitigation.\nExperience in data visualization including Tableau.\nExperience working with large datasets.\nJob Type: Contract\nPay: $45.00 - $50.00 per hour\nWork Location: Hybrid remote in San Jose, CA 95112"
  },
  {
    "title": "NLP Engineer",
    "company": "United Softw",
    "location": "Remote",
    "salary": "$50 - $55 an hour",
    "url": "https://www.indeed.com/rc/clk?jk=b4da8254c21636fc&bb=WmQeSEvUnEIphyfArmic8xMvXw_moIjMYtCFwBegJU0cxBW_hbLUVOoZdHrZi4WoeInySuG7in0j5zZFB6hQqpoykH3v-UyacrcR_6cyFjDi2M3Xzp3c9OvytjAMYJs1M0mi53tmDiDVGO3bUrtzfw%3D%3D&xkcb=SoB167M3sjaHxnwByh0AbzkdCdPP&fccid=91392fe756c65545&cmp=United-Softw&ti=Engineer&vjs=3",
    "description": "Role Name: NLP Developer / Engineer\nLocation: Remote\nDuration: 6 – 12 months\nNote: Must need Regex Exp. any LLM/ ML profiles will be rejected. Need candidate from Data side\nJob Description:\nWe are looking for NLP developer, someone who can manipulate text, understands linguistics (degree in linguistics or computational linguistics, or CS degree with minor in linguistics). Someone who can develop text parsers, understand vector matching and ontologies.\nWe are not looking for ML or prompt engineers.\nThe idea candidate will be a linguist. We don’t want ML/DL, prompt engineers.\nRegards\nKrishna\nJob Type: Contract\nPay: $50.00 - $55.00 per hour\nWork Location: Remote"
  },
  {
    "title": "Data Scientist for Strategic Partnership - CBOT Seat Sublease",
    "company": "Alloyed Enterprises Corp.",
    "location": "Remote",
    "salary": "Contract",
    "url": "https://www.indeed.com/rc/clk?jk=48742a7e70a4ae7d&bb=WmQeSEvUnEIphyfArmic894yk0chh2MdhwQ3QtPOYdFag_6c3KysYO497JzAzraB7o0n6RRFzPW4hinKTup94skXO38sMZWyZbaf5FkEAhdgtqUvDRTp5sNNWR8jpFAHo1qow03IhZsWkjv-CPFt7Q%3D%3D&xkcb=SoD767M3sjaHxnwByh0HbzkdCdPP&fccid=5e947f0fddbc4dc7&cmp=Alloyed-Enterprises&ti=Data+Scientist&vjs=3",
    "description": "Overview\nSmall manufacturing firm seeks math geek to assist with cleaning up futures arbitrage algorithm and monitoring in the course of 23/6 CME GlobeX sessions. You'll be responsible for sprinting through app cleanup, effectuating client-side KPI derivations, fitting spline regression models, applying cross-validation, deploying mean reversion to smooth a yield curve, using linear algebra to solve systems of equations, and overseeing process improvements.\nDuties\nScript ETL Processes.\nNavigate API documentation.\nApply calculus to derive KPIs from immutable observable variables.\nDevelop smoothing and penalty functions to optimize chi-squared values.\nUse Cross Validation to improve goodness of fit.\nIntegrate recent observations into an adaptive ARIMA.\nPenalize datas with partial stochastic differentials.\nSolve big systems with advanced algebras.\nUse systems of equations to select combinations that minimize a given objective function.\nApplying thread locking and similar concepts to ensure data integrity.\nRequirements\nProven experience as a mathematician and data scientist.\nKnowledge of analytics tools and techniques.\nFamiliarity with regression modeling tools like StatsModels and SciPy.\nSkills designing experiments and evaluating hypotheses.\nKnowledge of data warehousing concepts is a plus.\nOk with revenue share/seat lease agreement in lieu of traditional salary. This does require you to commit some cash or credit.\nPlease send your resume if interested. If you have appropriate qualifications we will schedule an interview.\nJob Type: Contract\nPay: $50,895.78 - $2,000,000.00 per year\nWork Location: Remote"
  },
  {
    "title": "Signals Intelligence Analyst",
    "company": "Technosoft",
    "location": "Dayton, OH 45415",
    "salary": "From $87.03 an hour",
    "url": "https://www.indeed.com/rc/clk?jk=a7fa9cc03e4b69cf&bb=WmQeSEvUnEIphyfArmic85rq3xfKRzoyU1LsMl6lHwLvGjDXeTFZRfhB6Pr77e3igpDCZxFXStNFBufeJgteTLU0CmTJsImchUa9QxJTrtSco8PScSM9va3jJN4qbw5_IwAB-Zng3d707gZmJN0qew%3D%3D&xkcb=SoDS67M3sjaHxnwByh0FbzkdCdPP&fccid=17e673c0e17c0a29&cmp=Technosoft-Engineering%2C-INC&ti=Intelligence+Analyst&vjs=3",
    "description": "Job Title: Signals Intelligence/Data Scientist\nLocation: Dayton, OH (Onsite)\nDuration: 3-6 Months Contract\nWe are seeking a highly skilled Signals Intelligence/Data Scientist / Machine Learning Engineer to join our team in delivering data-driven solutions for mission-critical operations.\nThis role requires a hands-on expert in machine learning, big data engineering, and large-scale data processing, ideally with experience in classified environments.\nKey Responsibilities:\nDevelop, train, and deploy machine learning models on large-scale datasets.\nEngineer data pipelines, including HDFS ingestion and parquet file handling.\nOptimize and manage complex SQL queries using PostgreSQL.\nBuild and manage external tables, ensuring performance and scalability.\nApply statistical and ML methods to solve real-world problems.\nAutomate ML workflows using scripting languages (Python, R, or Julia).\nCollaborate with cross-functional teams including data engineers, analysts, and mission stakeholders.\nRequired Qualifications:\nHands-on experience with training and deploying machine learning models.\nProficiency with big data engineering, including handling parquet files and HDFS ingestion.\nExpertise in SQL, particularly with Greenplum or PostgreSQL.\nExperience working with large-scale datasets (1PB+ preferred).\nStrong scripting skills in Python, R, or Julia for building ML workflows.\nNice-to-Have:\nSignals intelligence (SIGINT) information analysis\nFeature engineering, classification models, clustering, anomaly detection\nJob Type: Contract\nPay: From $87.03 per hour\nSecurity clearance:\nSecret (Required)\nWork Location: In person"
  },
  {
    "title": "Senior Data Scientist",
    "company": "Jobility Company",
    "location": "Remote in Maryland",
    "salary": "Up to $46 an hour",
    "url": "https://www.indeed.com/rc/clk?jk=abd33e59852aca66&bb=WmQeSEvUnEIphyfArmic8yQkd5hjnLyJ73bCBKadHmjNPLwLlz_1hy79EbCjzLyYRUbArf7cC5O3kYSl64jZ4BlcAKPAiT--rTphShnO6eTA3b9lQaDyn9jtznwrQOc2OhuIu8wyEplcBtBCTfVW5w%3D%3D&xkcb=SoBP67M3sjaHxnwByh0GbzkdCdPP&fccid=8607f53e3f6546ba&cmp=Jobility-Company&ti=Senior+Data+Scientist&vjs=3",
    "description": "Description:\nAs a Data Scientist you will join a team of data scientists, AI researchers, software developers, and psychometricians who provide technical and scientific leadership for some of our most important strategic efforts companywide. You will be actively and cross-functionally involved in the entire AI/ML model development lifecycle from design to deployment. You will help design, develop, validate, operationalize, and monitor AI/ML models for our School (PreK–12) business unit, and you will collaborate closely with colleagues across functions like Product, Engineering, Learning Design, and User Experience to help McGraw Hill create and deliver world-class educational experiences.\nIn this role you will specifically enable the development of data-driven tools to author content more efficiently.\nThis is a remote position open to applicants authorized to work for any employer within the United States.\nDUTIES AND RESPONSIBILITIES: List 4-6 of the main responsibilities of the role in order of importance.\n· Plan, execute, and report on projects of diverse scope independently with weekly manager check-ins.\n· Propose solutions to business problems by tailoring DS/AI concepts/tools/techniques.\n· Perform research, analysis, and modeling, and present findings to key stakeholders.\n· Learn how to balance multiple projects and revise project plans as circumstances change.\n· Collaborate with colleagues in other functions to support the creation of compelling learning experiences.\nPlease note this job description is designed to cover the primary duties of the role, but incumbents may be assigned other duties. Duties, responsibilities, and activities may change at any time with or without notice.\nJOB REQUIREMENTS: Identify minimum education, experience, and/or skills/requirements necessary to perform the job.\nEducation Requirement:\nDoctoral degree (or equivalent) in AI, Data Science, or related field\nExperience Requirement:\n· Doctoral degree in a relevant field, or a combination of 3+ years of professional experience and a master's degree in AI, Data Science, Statistics, or a related discipline\nSkills and Experience:\nRequired:\n· Conceptual knowledge of DS/AI through rigorous course work and industry applications\n· Demonstrated ability to apply DS/AI knowledge to lead projects from start to finish\n· Production experience with ML, NLP, and GenAI systems\n· Ability to create efficient, scalable Python code\n· Strong technical communication and collaboration skills\nPreferred:\n· Experience with LangChain/LangSmith\n· Commitment to the field of education\n· Experience with the K–12 educational ecosystem\nJob Type: Full-time\nPay: Up to $46.00 per hour\nWork Location: Remote"
  },
  {
    "title": "Data Scientist",
    "company": "Concurrent Technologies Corporation",
    "location": "Fort Meade, MD",
    "salary": "$114,000 - $160,000 a year",
    "url": "https://www.indeed.com/rc/clk?jk=6e2ca6846018c1eb&bb=WmQeSEvUnEIphyfArmic85orGuBaApnn-XhPpO062KpapQElfZ4a57HxKsONIoamVwf_HjAocoZnrzsfMdOynbD_3l8cHd-ZNuPRH-H7mmIt1bjoNhocn0dnzWRaUtY8cvihSpvVDXcwJ_YjgPJr1A%3D%3D&xkcb=SoBm67M3sjaHxnwByh0EbzkdCdPP&fccid=a30d07b18d8e13a2&vjs=3",
    "description": "DATA SCIENTIST\nConcurrent Technologies Corporation\nFT. Meade, MD\nMinimum Clearance Required: TS/SCI with CI Polygraph\nClearance Level Must Be Able to Obtain: TS/SCI with FS Polygraph\nConcurrent Technologies Corporation (CTC) is seeking a Data Scientist with expertise in sensor fusion, state estimation techniques, and remote sensing phenomenology to support advanced research and development efforts in national security and defense. This position involves working with real-time sensor feeds, applying advanced analytics, and helping to detect, assess, and anticipate emerging threats. The ideal candidate will bring strong domain knowledge, hands-on technical ability, and a passion for problem solving in mission-critical environments.\nKey Responsibilities\nDevelop and apply state estimation algorithms and sensor fusion models to process multi-modal data streams from remote sensing platforms.\nAnalyze and interpret complex sensor data feeds (e.g., radar, EO/IR, RF) and real-time messaging services to enable situational awareness.\nModel system behavior under dynamic conditions using tools such as Kalman filters, particle filters, and Bayesian inference techniques.\nCollaborate with multidisciplinary engineering, analytics, and mission teams to support rapid prototyping and operational systems development.\nSupport identification and characterization of advanced threats and adversarial tactics through data analysis and pattern recognition.\nTranslate technical findings into actionable insights and communicate effectively with both technical and non-technical stakeholders.\nStay current with advancements in applied data science, AI/ML, and sensor processing technologies.\n\nBasic Qualifications\nBachelor's or Master's degree in Mathematics, Statistics, Physics, Aerospace Engineering, or a related quantitative field. With 6-8 years of related experience, or a Master of Science degree with 4-6 years of experience, or a PhD with 2-4 years of experience\nHands-on experience with sensor fusion techniques and state estimation algorithms (e.g., Kalman filters, SLAM, tracking filters).\nStrong understanding of remote sensing phenomenology, including knowledge of radar, lidar, or electro-optical systems.\nExperience with real-time messaging architectures (e.g., ZeroMQ, DDS, Kafka).\nFamiliarity with advanced threat modeling and detection strategies in the context of national defense or intelligence.\nProficiency in programming languages such as Python, MATLAB, or C++, with experience in scientific computing or simulation environments.\n\nPreferred Qualifications\nExperience working on DoD or government-sponsored R&D projects.\nPrior exposure to operational military systems, UAS, or ISR platforms.\nKnowledge of AI/ML tools for signal and sensor data exploitation.\nExperience with time-series databases and geospatial data processing.\n\nBenefits:\nThe starting salary range for this position has been established as $114,000 – $160,000\nMedical Insurance and Prescription\nDental Insurance\nVision Insurance\nLife and AD&D Insurance\nShort-Term/Long-Term Disability Insurance\nEmployee Assistance Program (EAP)\nVoluntary Critical Illness and Accident Insurance\nTuition Reimbursement Assistance\nPaid Leave\nPaid Holidays\nBereavement Leave\nRetirement Plan\nThe Concurrent Technologies Corporation pay range for this job level is a general guideline and not a guarantee of compensation or salary.\n\nWhy CTC?\nOur teams at CTC are passionate and thrive on collaboration in a team environment\nWhen we encounter a difficult problem, we have a variety of talented and diverse employees that work together to solve the toughest challenges\nCompetitive salary and benefits package\nAlthough our work at CTC is extremely important, we also recognize the need for our employees to maintain a proper mix of work and personal life ·\nVisit www.ctc.com (http://www.ctc.com/) to learn more\n\nJoin us! CTC offers exceptional career growth, cutting edge technology, educational opportunities, and recognition for quality work.\nhttps://concurrent-technologies-corporation.breezy.hr (https://concurrent-technologies-corporation.breezy.hr/p/5214aee293b7)\nStaffing Requisition: SR# 2025-0068\n“We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability status, protected veteran status, or any other characteristic protected by law.”"
  },
  {
    "title": "",
    "company": "",
    "location": "",
    "salary": "",
    "url": "https://www.indeed.com/viewjob?jk=123456789abcdef0",
    "description": "None"
  },
  {
    "title": "Sr. Applied Scientist, Prime Video - Personalization and Discovery Science",
    "company": "Amazon.com Services LLC",
    "location": "Seattle, WA",
    "salary": "$150,400 - $260,000 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0C2svMuzE9n6q0Xo3QnQAm3u19FFO5aJ8ndlGbDv5msKCaTOErDQL3t7w0kTc4FbBh_M5s7SwTi2rMtX1Y-WGyJ6y95k7-aiSR8qiye-wAtz8URJl7Z3V64TmUW3na6Zv8mIi3w1N9FMfd5IelZeTIoSHJ0KXqJIRVl4xmGWAX3WGmCQxtn0bdV_jpL3eFRMcbNEG7qC63S3c9NKAc6c_mcVz-9s87MaWIh9s7vXujHFn8G9LyJkviozZBWdlfHi_yV6a8XBKVNqteW9O3qwG6nnYs1jEwX6MmNuQVnFdDJJB3tfZ2TqMEj4_E63Ixt5WLFNlUYKjPlDamXK6ZnDUiC3Z1MFZNhu83G9lxAFU6i9Z4UHhthwcKYD-SVpl-WeeiijZ-hAPPxsLOlrrhyC9xNuyUZAuL_K_YxejSN9zH81OeAEY1l1wL-KXLbqk8yWBi6QKt0daccGGqsqV4mZ31Y7RtoX3QjM4EmhvbzcBCkK03mzrJdGsm5i7vooCrSKy3XPCon-MLTfjs3vQ3njnGbmwUO90zErzeSnlH-CXGbWl9CCE4T8206kExGeZlmDXDot-4qHreZaOq1YIxxx6j7zrS3HOXZEidxSvesayRGr0Y_Lg5TOR6o-msQPYTf-SmKPiU-HEZhdC6ExZ4HPIgV6OzlukLLEv7xyDhdE1ZL467pYEHaXedzhpM9bZeHUH4FOrDIp6BtVxNmkawDb-QalABjcyNqOT3MOOrdPmET-NkcbKSjd-yriqkiPj3PP-3e8-J2u947MAQtKGU7WYUGB1TEDetLZ8edTZuRL03D1Oix_rOSALa73AdcgfeyJxWhbGYBR6po7A==&xkcb=SoBI6_M3sjadC6W0NB0abzkdCdPP&camk=UoKtGZLa3XK5xk3k7uMSgA==&p=2&fvj=0&vjs=3",
    "description": "DESCRIPTION\nPrime Video is a first-stop entertainment destination offering customers a vast collection of premium programming in one app available across thousands of devices. Prime members can customize their viewing experience and find their favorite movies, series, documentaries, and live sports – including Amazon MGM Studios-produced series and movies; licensed fan favorites; and programming from Prime Video add-on subscriptions such as Apple TV+, Max, Crunchyroll and MGM+. All customers, regardless of whether they have a Prime membership or not, can rent or buy titles via the Prime Video Store, and can enjoy even more content for free with ads.\n\nAre you interested in shaping the future of entertainment? Prime Video's technology teams are creating best-in-class digital video experience.\n\nAs a Prime Video technologist, you’ll have end-to-end ownership of the product, user experience, design, and technology required to deliver state-of-the-art experiences for our customers. You’ll get to work on projects that are fast-paced, challenging, and varied. You’ll also be able to experiment with new possibilities, take risks, and collaborate with remarkable people.\n\nWe’ll look for you to bring your diverse perspectives, ideas, and skill-sets to make Prime Video even better for our customers. With global opportunities for talented technologists, you can decide where a career Prime Video Tech takes you!\n\nWe are looking for a self-motivated, passionate and resourceful Applied Scientist to bring diverse perspectives, ideas, and skill-sets to make Prime Video even better for our customers. You will spend your time as a hands-on machine learning practitioner and a research leader. You will play a key role on the team, building and guiding machine learning models from the ground up. At the end of the day, you will have the reward of seeing your contributions benefit millions of Amazon.com customers worldwide.\n\nKey job responsibilities\nDevelop AI solutions for various Prime Video Search systems using Deep learning, GenAI, Reinforcement Learning, and optimization methods;\nWork closely with engineers and product managers to design, implement and launch AI solutions end-to-end;\nDesign and conduct offline and online (A/B) experiments to evaluate proposed solutions based on in-depth data analyses;\nEffectively communicate technical and non-technical ideas with teammates and stakeholders;\nStay up-to-date with advancements and the latest modeling techniques in the field;\nPublish your research findings in top conferences and journals.\n\nAbout the team\nPrime Video Search Science team owns science solution to power search experience on various devices, from sourcing, relevance, ranking, to name a few. We work closely with the engineering teams to launch our solutions in production.\nBASIC QUALIFICATIONS\nPhD, or Master's degree and 6+ years of applied research experience\n5+ years of building machine learning models for business application experience\nExperience programming in Java, C++, Python or related language\nExperience with neural deep learning methods and machine learning\nPREFERRED QUALIFICATIONS\nExperience with modeling tools such as R, scikit-learn, Spark MLLib, MxNet, Tensorflow, numpy, scipy etc.\nExperience with large scale distributed systems such as Hadoop, Spark etc.\n\nAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\n\nLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\n\nOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $150,400/year in our lowest geographic market up to $260,000/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site."
  },
  {
    "title": "Applied Scientist – Research Products",
    "company": "Thomson Reuters",
    "location": "Hybrid work in Ann Arbor, MI 48108",
    "salary": "$108,500 - $201,500 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0BGRpAzDInPRkKae7rnz4dRA_iZIAFfYmvzjSCnWpUsBlXuYkrZbb53v_f71cbbJ8PT-dArjVJXuBjccsaNYx2BulcSA2LgH-dlFmz2wFPYFEgtxI283MIa6yxShZT6LbZJTqA-G1CACu0es3c6ZW6fzgva7j_oU31uNgWIjqfc9nXSmBC1AvMEO-n9atiCMAn9u9qetsz5-LcPM7lEXrl1ahZudPHntUSyVf_yVbICVKeLJXCCOmL-a08ETUmbsHw_kRlZWQn_omJbbhSDHhcPxR41iQC6qiCrFMozQXSkuTEdkNW_qonTdE-zhVk0igH0He-yOFsvjCmj4yYfjpsJmgTHMekLIeV_zGo7rK4OebRhZKpxFFXu2apVesBPlrClnLnCuzABzBJCmB7--hV1qpo0fRhQNnaCOgoc9yCoREFiwbapPsVZ8jJ2L1kgTKDQ0-God9l8moII1u6K5CRU64-yssmqqe1z63CAB5nsL8Wmc0rUhSjXoMxyvHEZLwsEan_OzFLRPigxXaqMPOB8RMcMFQ8CbsWg0TAaCZSkT-SG_MjACvLaGQhM2Lb-JKyKrhRi3lX5dlzupE-2TKOYIh4eNOnM-L1SXvRn2Tdg7i0vE6x6vnZ2ALo6YYrsB-GxNx10LYR52fgwBfE_Z5l_ehnf3LBZZOTHnIHyUoS3WsiVuDfnPI7b9ZKNC5UbJei5v8RunMWePEYFQQ7jZk_xPBynpVLlD8WWK6Tqt2P_l1rJq67A1zkCQR5jFubCaKKcV1mpc53TWiHzSxwsZzwY7RYG5UsCbqV_RcQBFqGTcikY2WvGs45NUDSWp_pyOSLKuUPz2vuIWQ==&xkcb=SoDb6_M3sjadC6W0NB0EbzkdCdPP&camk=UoKtGZLa3XKaWKHHP8_a_g==&p=0&fvj=0&vjs=3",
    "description": "Applied Scientist – Research Products\n\nAre you excited about working at the forefront of applied research in an industry setting? Thomson Reuters Labs in the USA is seeking scientists with a passion for solving problems using state-of-the-art information retrieval, natural language processing and generative AI.\n\nWhat does Thomson Reuters Labs do? We experiment, we build, we deliver. We support the organization and our customers through applied research in informational retrieval and natural language processing. We work closely with product and domain experts to identify compelling solutions at the intersection of user needs and technical feasibility. Our team is designing the next generation of search technology for Legal and Tax Professionals globally. We drive AI innovation for Thomson Reuters’ Core Research Products, including Westlaw, Practical Law, and Checkpoint.\n\nAbout the Role\nApplied Scientists are experts in NLP, who contribute to the research and development of AI solutions that enhance Thomson Reuters' products. Their work ensures AI technologies are aligned with business objectives to drive innovation and deliver customer value.\nAs an Applied Scientist, you will:\nTake ideas through the end-to-end model development lifecycle (task design, data creation, training, evaluation and model governance)\nThink creatively about new capabilities generative AI can unlock for our customers\nWork with stakeholders to define scope, determine feasibility, and translate business/customer objectives into technical requirements\nCreate functional POCs to test new capabilities and Product concepts\nWrite clean code, participate in code reviews, and contribute to well-managed software delivery in a production environment\n\nAbout You\nYou’re a fit for the role of Applied Scientist if your background includes:\nBasic qualifications\nPhD or Master’s in a relevant discipline\nExperience researching, building, and evaluating NLP systems\nSolid engineering skills for prototyping; experience contributing to a shared codebase; and familiarity with workflows for remote development (AWS, Azure or similar)\nOutstanding communication, problem-solving, and analysis skills\nDemonstrated ability to communicate AI concepts to a diverse audience\n\nPreferred Qualifications\nExperience designing and implementing solutions with large language models\nRelevant publications at ACL, EMNLP, NAACL, NeurIPS, ICLR, SIGIR, KDD, or similar.\nExperience writing production code and ensuring well-managed software delivery\n\n#LI-SM2\nWhat’s in it For You?\nHybrid Work Model: We’ve adopted a flexible hybrid working environment (2-3 days a week in the office depending on the role) for our office-based roles while delivering a seamless experience that is digitally and physically connected.\nFlexibility & Work-Life Balance: Flex My Way is a set of supportive workplace policies designed to help manage personal and professional responsibilities, whether caring for family, giving back to the community, or finding time to refresh and reset. This builds upon our flexible work arrangements, including work from anywhere for up to 8 weeks per year, empowering employees to achieve a better work-life balance.\nCareer Development and Growth: By fostering a culture of continuous learning and skill development, we prepare our talent to tackle tomorrow’s challenges and deliver real-world solutions. Our Grow My Way programming and skills-first approach ensures you have the tools and knowledge to grow, lead, and thrive in an AI-enabled future.\nIndustry Competitive Benefits: We offer comprehensive benefit plans to include flexible vacation, two company-wide Mental Health Days off, access to the Headspace app, retirement savings, tuition reimbursement, employee incentive programs, and resources for mental, physical, and financial wellbeing.\nCulture: Globally recognized, award-winning reputation for inclusion and belonging, flexibility, work-life balance, and more. We live by our values: Obsess over our Customers, Compete to Win, Challenge (Y)our Thinking, Act Fast / Learn Fast, and Stronger Together.\nSocial Impact: Make an impact in your community with our Social Impact Institute. We offer employees two paid volunteer days off annually and opportunities to get involved with pro-bono consulting projects and Environmental, Social, and Governance (ESG) initiatives.\nMaking a Real-World Impact: We are one of the few companies globally that helps its customers pursue justice, truth, and transparency. Together, with the professionals and institutions we serve, we help uphold the rule of law, turn the wheels of commerce, catch bad actors, report the facts, and provide trusted, unbiased information to people all over the world.\nIn the United States, Thomson Reuters offers a comprehensive benefits package to our employees. Our benefit package includes market competitive health, dental, vision, disability, and life insurance programs, as well as a competitive 401k plan with company match. In addition, Thomson Reuters offers market leading work life benefits with competitive vacation, sick and safe paid time off, paid holidays (including two company mental health days off), parental leave, sabbatical leave. These benefits meet or exceeds the requirements of paid time off in accordance with any applicable state or municipal laws. Finally, Thomson Reuters offers the following additional benefits: optional hospital, accident and sickness insurance paid 100% by the employee; optional life and AD&D insurance paid 100% by the employee; Flexible Spending and Health Savings Accounts; fitness reimbursement; access to Employee Assistance Program; Group Legal Identity Theft Protection benefit paid 100% by employee; access to 529 Plan; commuter benefits; Adoption & Surrogacy Assistance; Tuition Reimbursement; and access to Employee Stock Purchase Plan.\nThomson Reuters complies with local laws that require upfront disclosure of the expected pay range for a position. The base compensation range varies across locations.\nFor any eligible US locations, unless otherwise noted, the base compensation range for this role is $108,500 - $201,500.\nThis role may also be eligible for an Annual Bonus based on a combination of enterprise and individual performance.\nBase pay is positioned within the range based on several factors including an individual’s knowledge, skills and experience with consideration given to internal equity. Base pay is one part of a comprehensive Total Reward program which also includes flexible and supportive benefits and other wellbeing programs.\n\nAbout Us\nThomson Reuters informs the way forward by bringing together the trusted content and technology that people and organizations need to make the right decisions. We serve professionals across legal, tax, accounting, compliance, government, and media. Our products combine highly specialized software and insights to empower professionals with the data, intelligence, and solutions needed to make informed decisions, and to help institutions in their pursuit of justice, truth, and transparency. Reuters, part of Thomson Reuters, is a world leading provider of trusted journalism and news.\nWe are powered by the talents of 26,000 employees across more than 70 countries, where everyone has a chance to contribute and grow professionally in flexible work environments. At a time when objectivity, accuracy, fairness, and transparency are under attack, we consider it our duty to pursue them. Sound exciting? Join us and help shape the industries that move society forward.\nAs a global business, we rely on the unique backgrounds, perspectives, and experiences of all employees to deliver on our business goals. To ensure we can do that, we seek talented, qualified employees in all our operations around the world regardless of race, color, sex/gender, including pregnancy, gender identity and expression, national origin, religion, sexual orientation, disability, age, marital status, citizen status, veteran status, or any other protected classification under applicable law. Thomson Reuters is proud to be an Equal Employment Opportunity Employer providing a drug-free workplace.\nWe also make reasonable accommodations for qualified individuals with disabilities and for sincerely held religious beliefs in accordance with applicable law. More information on requesting an accommodation here.\nLearn more on how to protect yourself from fraudulent job postings here.\nMore information about Thomson Reuters can be found on thomsonreuters.com."
  },
  {
    "title": "Expert Computer Scientist - Quality Assurance Framework (QAF) Accreditation",
    "company": "Peraton",
    "location": "Herndon, VA",
    "salary": "$135,000 - $216,000 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0BWrJOJIc9CpN6yMpv0V0AydpTkzwx7H4nhH8WAx3qz9LO0mISChZgts3QCvI8K0IvF4bKwOmNRf-CZ0hGqBAKpC0INNNg2aseqTCc1EofT_HK7iYPX9PNxfUDn59Gb6x47AUbULzCj9ntgkSKXPx6qtITsYEkm2zXz3soT6XFS5Q_sLbBzZd3MOjYHhN69pzwpa-5OpPekZ_i8Ewx5dwDbX6-HnzyZWrVWXHC9hEznVJncysj9CMsbE5Hky7ybMMstA4dpBDNaHTwgPha3R2kOBuerrKqWJ1DCGSKMGCf_ht3EAMDOcPqYXIMZ9uXgZliFaCep-bgtp1w96QbDgFFdsogkiJVPAeTImAbCtiVm-dzCBmuTyJDbsJLqzwXC9t9FBf_yRn3YnGEhpgQb-W5fRxszdA6M0MuxsrPPlMVvGETzTtIk1vWtKd67-h7YV1ziCrCxqJYS9zpZn9_iEJixn6gr8rdJFx9h4Y0yxqwc439nOfHkjxXG61QhX_9d3a5xkUh8R-F2t05YBM0I_v9rEmWQquGaVlxSpYF0f5mzqIO06DAX9IL1kLs7_yjw_Dyx8Do9ZuWlJLuM0bwHQRTudyY-mmlEtksCuWrGVWRxjEC8TbjCxnPNA6UxZkKSR2z7tkj7AgQXLRLjyuO1Jf3wvGKdttH9VuytunxiuaR4j48dFE_-XcAObjAznhjTPtuIso7hWF9OEpaQ6nFqRUNh0qkxZoqOKKwudoxnMEYjn1MC2BpZ9z1VvUOagE6rkmKSwvoIavM-dpNZ0LbTwSc8aaL19IAv-eGPTM8uUlAbBGRFcynnpNUsEKbhNgqf-sAKJ602TSuSU1DAtvtuudAh-Bul9rUNqKxV_T4HG-HoSsWuhM_5RVes-bDgHnMvDboIiC_DJ-8ku_0Z7nOsc7eVc4wLlvolmS4=&xkcb=SoDV6_M3sjadC6W0NB0ZbzkdCdPP&camk=nUmJqO2E8riLxIhWV1rwzg==&p=3&fvj=0&vjs=3",
    "description": "About Peraton\nPeraton is a next-generation national security company that drives missions of consequence spanning the globe and extending to the farthest reaches of the galaxy. As the world's leading mission capability integrator and transformative enterprise IT provider, we deliver trusted, highly differentiated solutions and technologies to protect our nation and allies. Peraton operates at the critical nexus between traditional and nontraditional threats across all domains: land, sea, space, air, and cyberspace. The company serves as a valued partner to essential government agencies and supports every branch of the U.S. armed forces. Each day, our employees do the can't be done by solving the most daunting challenges facing our customers. Visit peraton.com to learn how we're keeping people around the world safe and secure.\n\nProgram Overview\n\nAbout The Role\n\nPeraton has an opportunity for you to join our military intelligence program (s) of record to deliver, operate and sustain modernized, transformed data science/ data analysis environments worldwide that enable speedy and precise decision making to warfighters .\n\nResponsibilities:\n\nTh e Expert Computer Scientist - Quality Assurance Framework (QAF) Accreditation utilizes expertise in designing, developing, and maintaining data systems and software to create and maintain these systems, develop new technologies and algorithms, and solve complex computing and data system problems . This position will focus on QAF Accreditation . Responsibilities are, but are not limited to:\n\nComputer Scien ce specific :\n\nEmploy mathematics, statics, information science, artificial intelligence, machine learning, network science, probability modeling, data mining, data engineering, data warehousing, data compression, data protection, and/or other scientific techniques .\nC orrelate complex, technical findings into graphical, written, visual and verbal narrative products .\nAssess trends for existing data to identify and leverage other data sources .\nDevelop and utilize machine learning and data mining algorithms, including, but not limited to, Multiple Information Model Synthesis Architecture (MIMOSA) prediction algorithms based on open-source capabilities.\nIntegrate or code algorithms to support Government intelligence search and discovery missions.\nMake best practice recommendations on managing data within hardware, software, storage, and bandwidth constraints.\nEmploy data science techniques to support predictive analysis, social media and crowd-source data analytics, wargaming, and strategy development.\n\nQAF specific :\n\nReview and evaluation of QAF documentation submitted by a dvanced a nalytic product owners.\nE nsure compliance with tradecraft standards and adherence to best practices in A rtificial I ntelligence (AI) system development and deployment.\nAssess QAF documentation for completeness, accuracy, and thoroughness, and provide detailed feedback to advanced analytic product owners and developers.\nSupport maintaining a QAF documentation repository to facilitate knowledge sharing and best practices.\nCollaborate with product owners and developers to identify and address potential issues or gaps in QAF documentation.\nDevelop and deliver training materials and workshops to educate advanced analytic product owners, developers, and stakeholders on the QAF process and its application in AI system development .\nAssist analytic methodologists and advanced analytic product owners in translating technical documentation\ninto analytic tradecraft compliant language.\nCollaborate with stakeholders to develop, implement, and refine best practices for translating technical documentation into tradecraft compliant language .\nReview and edit translated documentation to ensure accuracy, completeness, and adherence to tradecraft standards .\nSupport capability development by contributing, editing, and storing code in Government owned/controlled source version control repositories.\n\nQualifications\n\nRequired Qualifications :\n\nMaster's degree in a relevant field, such as Computer Science , with a minimum of 20 years of work experience.\nExpertise in algorithm development, data structures, and software development practices.\nStrong analytical and critical thinking skills to interpret complex data and draw meaningful conclusions.\nExperienced in utilization of the Quality Assurance Framework and standards.\nExperience d in advanced analytics, machine learning, and data integration methodologies.\nExperience d with intelligence databases, software, and analytical tools.\nAbility to work collaboratively with users and stakeholders.\nCapacity to adapt to changing situations to prioritize tasks effectively.\nExcellent communication , analytical, and problem-solving skills.\n\nPreferred Qualifications :\n\nDoctorate degree in a relevant field , such as Computer Science .\nExperience working in the customer environment is preferred.\n\nS ecurity C learance :\n\nThis Position requires an Active TS/SCI and the ability to obtain a CI Poly, US Citizenship is required t o hold this clearance.\n\nSCA / Union / Intern Rate or Range\n\nDetails\n\nTarget Salary Range: $135,000 - $216,000. This represents the typical salary range for this position. Salary is determined by various factors, including but not limited to, the scope and responsibilities of the position, the individual's experience, education, knowledge, skills, and competencies, as well as geographic location and business and contract considerations. Depending on the position, employees may be eligible for overtime, shift differential, and a discretionary bonus in addition to base pay.\n\nEEO: Equal opportunity employer, including disability and protected veterans, or other characteristics protected by law."
  },
  {
    "title": "Manager, Data Scientist - US Card (New To Credit Team)",
    "company": "Capital One",
    "location": "Chicago, IL 60695 \n(Loop area)",
    "salary": "Full-time",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0C3j_zLGvpMLCdiZ0WC46XqVTA1VMZzOzKXPhAXwYlrNc2ZimNTpf2_4MHwNa_erOwUSIqY2RiVBpYlfh-kkymbg5MRlFoLIBUq4QqplZtxjNcpdJlutiRPtO-ATwLVtOAhD-n11oy-kqE50SpWI7LKc2Pl3YsIOvtCKx2r3VkQ-MZkL4CGXVVrj_qfSPKcRHQ8qRuyQGOs20KZdlxFXyHMjBGFYHO8qDyA4-yeFtTC5Z9KV7aF565_82DsZeoZMAvOqRztgrXIQgOxpRKKeGRTdGR-ZuvDUqjyBJxvl8bPH2QzHnJ7WfNxIS2bBrgVw-Ji9uVTmNzzQ2ugtjqaftoc9VMR_mbXVGNrLB_Kf2jVLkicaqcz9uRCIKvud5pVuPvVD9Kf60_vCoRkV_gIY-Ozv-tBaIBAPlVdhJXhx6GZ7-MRi8LtNPlOiHKrK9VrEyiO5JunVLcdCEGCiV57ItX5sMc4o7kip9FZTsipP0WmRd83KIvaH_zp9whGIAr6x9fzPrysv3g_ODd2X1t0hZCMMW_pwgu_Felb3-RLVCpKs_U6gsYfja_b_agx2GxwmtdVyQZ8gviV4nIYFI99mVAg3QdoJs7FVM4vKkQ0qbNwcIWJfAE4cDcralfcIqZ1I7K0opfJgx183taBRO0CZmNyfAW62-3dKgfQQqjVuoNf3HpsDIiouRUiiFKu1LdmaVREsnmHnwMqETQh-m9FDTHp1p5i74nxqBWTWYdaOUcER2JiZKS-uzIkrhFyGGTcvUWMd0vMWlgNry73SnoPgKYZH5rC_gp2Ieniq0WG4ZPiiBuu2mHizDqHowEX85YxW0rmtPTjfiCpmvtTe0v_TswsPhmxZG_9lQfREMeWSkWd-n5LZLral8hLTcmh7sA79lSTHxKkqDPgQ0w7Zi8_MIk23K0Gr20n-abHbk_qHmAaDfVuu4wJLatVEU2GnS_vQCL3gBG3UXVgVVyIlDPfxNVRNgoEkweUHndXb8-6LbxraK0np3EWlbGiQ0sxxw6njTWU3yHCck-vBRSexNhCXQGjcvh9j9oKxn4LpHTXX5nSCnYgbnM7QJ5CdWWqqNNHN-zCbFMCvAbrjhRuIdxtOokn8p5yeKAy_s8xh39DWI7oMzrD4Vm7DaUnZm_bu0WOxifa8ZTADgIGG7pWIh0Tlt14DAUI-VxIu9PzbyYscxKILoRJg3yBHrETg0-mZYTFMxBFRyIBQQX8ni6eC2y3aF9y_TVk0FAXrcM59H_N68s7yyYbBAwSDtovMnd1tIph6p5au51ULg1d08PzjFN_3wYO&xkcb=SoD86_M3sjadC6W0NB0bbzkdCdPP&camk=4HOcmqOLYrByKel4K0fjog==&p=1&fvj=0&vjs=3",
    "description": "Manager, Data Scientist - US Card (New To Credit Team)\nData is at the center of everything we do. As a startup, we disrupted the credit card industry by individually personalizing every credit card offer using statistical modeling and the relational database, cutting edge technology in 1988! Fast-forward a few years, and this little innovation and our passion for data has skyrocketed us to a Fortune 200 company and a leader in the world of data-driven decision-making.\nAs a Data Scientist at Capital One, you’ll be part of a team that’s leading the next wave of disruption at a whole new scale, using the latest in computing and machine learning technologies and operating across billions of customer records to unlock the big opportunities that help everyday people save money, time and agony in their financial lives.\nTeam Description\nThe New to Credit Data Science team develops machine learning models for marketing, risk, and valuation. These models help our business partners make informed marketing and underwriting decisions throughout the credit card lifecycle. We prioritize advanced modeling techniques, alternative data sources, and robust infrastructure to enhance decision accuracy and efficiency.\nAdditionally, we conduct thorough statistical analysis to generate insights that influence various business strategies. You will collaborate with data scientists, business analysts, and software engineers on all stages of model development. This work will be conducted in a supportive environment that values your contributions, encourages new responsibilities, promotes ongoing learning, and rewards innovation.\nRole Description\nIn this role, you will:\nBuild machine learning models through all phases of development, from design through training, evaluation, validation, and implementation\nLeverage a broad stack of technologies — Python, Conda, AWS, Spark, Kubeflow Pipelines, and more — to reveal the insights hidden within huge volumes of numeric and textual data\nPartner with a cross-functional team of data scientists, software engineers, and product managers to deliver a product customers love\nFlex your interpersonal skills to translate the complexity of your work into tangible business goals\nThe Ideal Candidate is:\nCustomer first. You love the process of analyzing and creating, but also share our passion to do the right thing. You know at the end of the day it’s about making the right decision for our customers.\nInnovative. You continually research and evaluate emerging technologies. You stay current on published state-of-the-art methods, technologies, and applications and seek out opportunities to apply them.\nCreative. You thrive on bringing definition to big, undefined problems. You love asking questions and pushing hard to find answers. You’re not afraid to share a new idea.\nA leader. You challenge conventional thinking and work with stakeholders to identify and improve the status quo. You’re passionate about talent development for your own team and beyond.\nBasic Qualifications:\nCurrently has, or is in the process of obtaining one of the following with an expectation that the required degree will be obtained on or before the scheduled start date:\nA Bachelor's Degree in a quantitative field (Statistics, Economics, Operations Research, Analytics, Mathematics, Computer Science, or a related quantitative field) plus 6 years of experience performing data analytics\nA Master's Degree in a quantitative field (Statistics, Economics, Operations Research, Analytics, Mathematics, Computer Science, or a related quantitative field) or an MBA with a quantitative concentration plus 4 years of experience performing data analytics\nA PhD in a quantitative field (Statistics, Economics, Operations Research, Analytics, Mathematics, Computer Science, or a related quantitative field) plus 1 year of experience performing data analytics\nAt least 1 year of experience leveraging open source programming languages for large scale data analysis\nAt least 1 year of experience working with machine learning\nAt least 1 year of experience utilizing relational databases\nPreferred Qualifications:\nPhD in “STEM” field (Science, Technology, Engineering, or Mathematics) plus 3 years of industry experience in data science, or Master’s Degree plus 5 years of industry experience in data science\nAt least 1 year of experience working with AWS\nAt least 4 years’ experience in Python\nAt least 4 years’ experience with building machine learning models, with at least two years of experience with building GBM models\nAt least 4 years’ experience with SQL\nCapital One will consider sponsoring a new qualified applicant for employment authorization for this position.\nThe minimum and maximum full-time annual salaries for this role are listed below, by location. Please note that this salary information is solely for candidates hired to perform work within one of these locations, and refers to the amount Capital One is willing to pay at the time of this posting. Salaries for part-time roles will be prorated based upon the agreed upon number of hours to be regularly worked.\nChicago, IL: $175,800 - $200,700 for Mgr, Data Science\nMcLean, VA: $193,400 - $220,700 for Mgr, Data Science\nNew York, NY: $211,000 - $240,800 for Mgr, Data Science\n\nCandidates hired to work in other locations will be subject to the pay range associated with that location, and the actual annualized salary amount offered to any candidate at the time of hire will be reflected solely in the candidate’s offer letter.\nThis role is also eligible to earn performance based incentive compensation, which may include cash bonus(es) and/or long term incentives (LTI). Incentives could be discretionary or non discretionary depending on the plan.\nCapital One offers a comprehensive, competitive, and inclusive set of health, financial and other benefits that support your total well-being. Learn more at the Capital One Careers website. Eligibility varies based on full or part-time status, exempt or non-exempt status, and management level.\nThis role is expected to accept applications for a minimum of 5 business days.\nNo agencies please. Capital One is an equal opportunity employer (EOE, including disability/vet) committed to non-discrimination in compliance with applicable federal, state, and local laws. Capital One promotes a drug-free workplace. Capital One will consider for employment qualified applicants with a criminal history in a manner consistent with the requirements of applicable laws regarding criminal background inquiries, including, to the extent applicable, Article 23-A of the New York Correction Law; San Francisco, California Police Code Article 49, Sections 4901-4920; New York City’s Fair Chance Act; Philadelphia’s Fair Criminal Records Screening Act; and other applicable federal, state, and local laws and regulations regarding criminal background inquiries.\nIf you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation, please contact Capital One Recruiting at 1-800-304-9102 or via email at RecruitingAccommodation@capitalone.com. All information you provide will be kept confidential and will be used only to the extent required to provide needed reasonable accommodations.\nFor technical support or questions about Capital One's recruiting process, please send an email to Careers@capitalone.com\nCapital One does not provide, endorse nor guarantee and is not liable for third-party products, services, educational tools or other information available through this site.\nCapital One Financial is made up of several different entities. Please note that any position posted in Canada is for Capital One Canada, any position posted in the United Kingdom is for Capital One Europe and any position posted in the Philippines is for Capital One Philippines Service Corp. (COPSSC)."
  },
  {
    "title": "Senior Data Engineer",
    "company": "Tanaq Technical Services",
    "location": "Hybrid work in Washington, DC",
    "salary": "$120,000 - $130,000 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0Arn5gTsIZf8qnd7YBTCbSQj5St6QbsTNY3c7iqQPfP-DKhiUubksIbRo1v_CnGJTI-96_dZlTyk1bQeQ7QSusE7wQPFUyAY63tcLlLdfC0q-OkemSa2YJ7Vk-SAIbgIFl_7m6_Ut_GWjUvbNu0oBHEwI3XlJASk4LZMV0YiHe7ioHMNJDWaMZ_48MduapztNAXRunLpStOuIiMPrUdLudJ9m9rBwxMadHFtmKlUON5DDZE-JXRdAv6jnpaNH0jciUu-l1uSY53-e7qkwdnLvuzkB18ZinfPueOSI7Wxm3KevExG_Mx8uhglZb4EyJhwjQ0TNbrloHctfLdrHr4a1f35bmsX_um_IMO4HJiakcNboLe0wukuAaUVjck5zTSQzOHmWBCtrnPPmgdiY6zJNdwmjlBVQStS4vOxeoxua8n8l4zLDZGlc322EF5C03fvCCqGd-IguLYecQGry_KRzxNAEWpXxVtsA_zdu4BQSDDcsAmawoBk7y78NxkhyOyzVatKYqOvofE3Fm1GmqtN7bUH7TGUwAERnfLWkgcSP9SlJQFHC9bL0WzQtBfUAGgATUDa7v9C8ZFTu9CAt4BtPEyistVKYejZu45jJNphYgkin1U0pMlOX0FFNKhcHkCXYUKoCChKTTlwVT4j_EvLyTOYcH6d1UCuydsIaf0LVIjt-CGNaX5-ddKhZGMUj3SmZxDc8IOQxqGmuUox6islrh27aMp6y9gGJlcMOZ7XebKItH4s6ld2CMl&xkcb=SoBh6_M3sjadC6W0NB0YbzkdCdPP&camk=UoKtGZLa3XJuskjTpu1n5Q==&p=4&fvj=0&vjs=3",
    "description": "Description:\nOverview\nTanaq Technical Services (TTS), a division of St. George Tanaq (SGT) Corporation, is an 8(a) Alaskan Native Small Business that specializes in delivering Enterprise Integrated Technology Solutions and Support Services to the Federal Government. TTS’s innovative approach combines proactive strategies, efficient processes and emerging technologies to deliver seamless, integrated services for our clients. TTS prides itself in being Mission Driven, People Focused. To learn more about us, visit https://tanaq.com/tanaq-technical-services.\nAbout the Role\nWe are seeking a Senior Data Engineer to design, optimize, and maintain data pipelines and systems that support HUD AI/ML proofs of concept and pilots. The Data Engineer will ensure efficient, scalable, and secure data workflows for machine learning, advanced analytics, and AI integration.\nThis is a hybrid remote position based in Washington, D.C. that will require some onsite work at the customer’s locations. An estimated 25% annual travel within the U.S. will be required.\nResponsibilities\nDesign and optimize data pipelines and architectures for AI/ML workflows on cloud platforms.\nDevelop ETL/ELT processes, ensuring data quality, consistency, and accessibility.\nConfigure and manage AI/ML-ready cloud infrastructure (AWS Bedrock, Azure OpenAI).\nCollaborate with Data Scientists to operationalize models and enable scalable AI solutions.\nImplement data governance, versioning, and lineage tracking for compliance.\nMonitor and maintain high-performance data systems and optimize for throughput.\nRequirements:\nRequired Experience and Skills\n5+ years of experience in data engineering for AI/ML workflows\nExpertise in cloud-native data systems and large-scale data processing\nFamiliarity with AI/ML pipelines, reproducible workflows, and federal compliance\nPrevious experience supporting HUD OCIO preferred.\nAbility to pass required Federal background screening and obtain and maintain both government clearance and customer approval.\nMust be legally authorized to work in the United States without the need for employer sponsorship, now or at any time in the future.\nTechnical Skills\nCloud platforms: AWS Bedrock, Azure OpenAI, S3, Redshift, Data Factory\nETL/ELT frameworks: Airflow, Spark, Databricks\nData modeling, schema design, and optimization for AI workloads\nProgramming: Python, SQL\nVersion control: Git/GitHub/GitLab\nData governance, metadata management, and logging\nCore Competencies\nCollaboration with Data Scientists, DevOps, and UX teams\nProblem-solving for scalable AI/ML pipelines\nDocumentation and reproducible workflows\nAgile development mindset and iterative improvement\nSecurity, privacy, and compliance awareness\nEducation and Training\nBachelor’s degree in Computer Science, Data Engineering, Information Systems, or related field. Master’s degree in related field, preferred.\nCertifications in cloud data platforms (AWS, Azure), preferred.\nPhysical Requirements\nCandidates must reside in or within daily commuting distance of Washington, D.C.\nMust be willing and able to travel an estimated 25% of the time within the U.S.\nProlonged periods of sitting at a desk and working on a computer. May occasionally need to lift up to 25 pounds.\nPay Range\nThe projected annual salary range for this position is $120,000 – $130,000 USD. Please note that the salary information listed is a good faith estimate for this position and a general guideline only. Multiple factors are considered in determining final pay for a position, including, but not limited to, the candidate’s relevant work experience, skills, education, certifications, and competencies that align with the specified role, geographic location, as well as business considerations and contract provisions regarding labor categories that are specific to the position.\nBenefits Information\nBenefits offered may vary depending on the nature of your employment with Tanaq. Full-time US-based employees gain access to healthcare benefits (Medical, Dental, Vision), Basic Life Insurance, Short-Term Disability, Long-Term Disability, 401(k), Flexible Spending Account, EAP, Education Reimbursement, Paid Time Off and Holidays.\nWho We Are\nTanaq Technical Services (TTS) strives to deeply understand and analyze our clients’ vision, needs, and requirements so we may provide alternative solutions, empowering them to choose the best resolution. We aim to achieve excellence by delivering on our commitments to our clients, employees, and partners.\nOur Commitment to Non-Discrimination\nTanaq Technical Services is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to disability, status as a protected veteran or any other status protected by applicable federal, state, or local law. Tanaq complies with the Drug-free Workplace Act of 1988 and E-Verify.\nIf you are an individual with a disability and need assistance completing any part of the application process, please email accommodation@tanaq.com to request a reasonable accommodation. This email is for accommodation requests only and cannot be used to inquire about the status of applications.\nNotice on Candidate AI Usage\nTanaq is committed to ensuring a fair and competitive interview process for all candidates based on their experience, skills and education. To ensure the integrity of the interview process, the use of artificial intelligence (AI) tools to generate or assist with responses during phone, in person and virtual interviews is not allowed. However, candidates who require a reasonable accommodation that may involve AI are required to contact us prior to their interview at accommodation@tanaq.com.\nTo apply for this and other positions with our company, visit:\nhttps://recruiting.paylocity.com/recruiting/jobs/All/31dd0607-5fe1-43cc-a916-35084f250a54/Tanaq-Technical-Services-LLC"
  },
  {
    "title": "Data Scientist",
    "company": "TechOp Solutions International",
    "location": "Tampa, FL 33601",
    "salary": "Full-time",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0Cr3igLpqGRlTrGBlzyymwg6W76EAwesiecHN1VyWi0WS6slbm3p0KfR7owl2XtyUQ7-4n6A2-foI-HrYTWfvXOg6Dh1sekDzLr1nla0Str9FwnW4KII7iLzOODmALTH28RXUPBk5vKKelowgqxXdpnxvf-_d-kf52sEqCHD5t__rJVPWgEHWK4Okt4SxfM2UjJM8ifTfz09-bGNn8-5LdtAck6K9prUhQ2BC323Lv_jUeqpvaBewKcpkW1sKN3Osr4KC_qFI9VUY002akXu4Xh5hTCeY3Ze4eH41GtDbZHJ6WazIwiPnjrCONxbQwWKEYa2yCAinqI4Kx65gqlnUVwUZFcmjRTFD9q-6nwpKldr5tyLtJhUt9GcGL4uU2UC1TyqXO_x6DrDGrAq6NgfnCijWW9-uiLryy_P_Lg8YSGjpUNZbN5zD4DpRkoaSz9-AvVGzy9cQDQVI8G_Fhabf_k8u0o9IVmbjuagFJPC79kW9UkmY21K34BgT801-LAliB0MX9L9YGi2hbmyiLPLvci0uN4bpCULK-YdUb9cvOoGy7JNHdqxJqqgVzjnlGdsXstPO8lnGLVn6P2xzeyajkk-5aK9XcFHbJ4zsJLk-GPn9PyAoz9fvvu&xkcb=SoDv6_M3sjadC6W0NB0fbzkdCdPP&camk=4HOcmqOLYrC-ejQIEttp1Q==&p=5&fvj=0&vjs=3",
    "description": "We are seeking a talented and experienced Data Scientist to join our team. As a Data Scientist, you will play a crucial role in designing, developing, and implementing data science solutions to empower investigators and enhance our capabilities in extracting meaningful information and identifying anomalous patterns of activity.\nResponsibilities:\nCollaborate with subject matter experts, team leads, and third-party vendors to define new features and functions for automation, aiding investigators in extracting meaningful information about a target and their surrounding network.\nDesign, code, test, and document data science microservices primarily in Python.\nSupport the integration of disparate bulk data sources into a unified database.\nDevelop and optimize graph traversal queries and analytic pipelines to support analyst use cases, ensuring smooth transition from development to test and production environments.\nExtract valuable information from unstructured text, including SAR narratives and web scraped data related to cryptocurrency addresses and actors.\nGenerate synthetic data for testing and development environments, as well as for the MM capstone training, adapting to evolving MM training and data holdings.\nRequirements\nProficient in Python programming.\nExperience with graph traversal languages such as Gremlin, Cypher, or GraphML, along with expertise in network analytics, including centrality, community detection, link prediction, pattern recognition, and/or blockchain analytics.\nStrong SQL or other relational database query experience.\nIn-depth knowledge of graph-structured data and analytics.\nKnowledge of GPS technology and its integration into analytical processes.\nExperience with cloud platforms, specifically Amazon Web Services (AWS).\nFamiliarity with containerization platforms, including Docker and Kubernetes\nBachelor's or advanced degree in Computer Science, Data Science, or a related field.\n1-3 years’ experience in a similar role\nStrong communication and collaboration skills.\nAbility to work in a dynamic and fast-paced environment.\nAn active Top Secret clearance is required.\nGreat To Have! ( Preferred)\nFamiliarity with Natural Language Processing (NLP) techniques. Preferred\nWorking knowledge of generative and agentic Artificial Intelligence models, usage, and training techniques. Preferred.\nFull-stack software engineering or development experience. Preferred.\nExpertise in blockchain architecture and cryptocurrency data analytics. Preferred.\nUnderstanding of machine learning algorithms and their application in cybersecurity analytics. Preferred\nIND123"
  },
  {
    "title": "BH/DS Clinician III",
    "company": "City of Virginia Beach",
    "location": "Virginia Beach, VA",
    "salary": "$65,977.73 - $102,265.48 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0C2_CcuJik6466N8f8TreQ8ideCWf2JOfWy-FqCME_PZtdGIih387VIE4PSnyPCDhREw4R7hbTLZJq8tOUv8oeM6dH4I4ZB5Z_p8Oq9SY-_kyUh77zcmvaR3Rh8exRgNlLyLAIEAYJCjkE2cfmnJaV7NiMsXy7Et8P2Ayg2RcMBShGFjfsqiFPO9A22pC6z-nN-HiKfj1e0-XncbsVsnZXa_Iak44OnkOalHMdJ01hdxDz5Gnv5lA06sjgMsF_sOblN5EzmpCl2hH048XVRLa135OoGTw_gLkc2c2I3mTtSrvK5L1dA8qMfL0gFkcb4sGtoSAYVIeoahfhaZ7qwEsI96IB2qVpxd5-hor4X6mhGclBDsOSwtG6nQfTUO4ysNa--Pyug5jXg2LvVbZO4LySa2cB6vNe8UKoPf2DhVgoaKEIGOcriGA1p97DnCDCijEI_BccqGiB411xdqr4df3m-pycv2evavlrYns-IxYFeUktXjTzn3tDfOY6k8vwaKXXLYXRpQ9fIYGlhHZrvlMlY5wbT3F8NnUqpcNGArJMzeiHnGIOKuKUsKywFT3UcBh_mtWcqhp-rikNmWUVunyhWOFWM7MH3UrKxQqccVGi4-GAPabIwpr8W4V95q0misePnJIJncg56jQ26AuePKA1vrIIpqyndqDZ7Yh3G4If8YnAFXHKr9r_DWCa5PPYI-VUtZ0-HCVmi9SOekTNnHbOW43aQ4KNkh8s3C59uRUA4F1LHpiOAT9FPEELTMvUZedzZ0xrEakELsQ==&xkcb=SoDG6_M3sjadC6W0NB0dbzkdCdPP&camk=f416UQcMBpCoDdI4keVdCw==&p=7&fvj=0&vjs=3",
    "description": "Requisition ID:\n44491\nWork Location:\nHuman Services - Birdneck Circle facility\nPay Range:\nA.13, $65,977.73 - $102,265.48\nStarting Salary:\nDepending upon Qualifications\nWork Schedule:\nEvening Shifts. See under Duties Section\nPart Time Hours/Wk:\nJob Open Date:\n6/5/25\nApplication Deadline:\nJob Duties:\nThe City of Virginia Beach Department of Human Services is seeking to hire three licensed candidates dedicated to making a difference in our community for the Clinician III positions for the \"Intensive Outpatient Program\" (IOP). The ideal candidates will have experience conducting individual, group, couples, and family therapy with adults with co-occurring mental health and substance use disorders, Dialectical Behavioral Therapy (DBT), trauma informed care, and harm reduction strategies.\nA $4,000 hiring bonus is being offered for this position. Hiring bonuses shall only be for new hires of original employment or reemployment as defined in Human Resources Policy No. 5.0.\n$1,000 will be awarded in the first paycheck.\n$1,250 will be awarded upon completion of the six (6) month interim performance evaluation with an overall rating of “Meets Expectations.”\n$1,750 will be awarded upon completion of the employee’s one (1) year probationary period and a performance evaluation with an overall rating of “Meets Expectations”.\n\nResponsibilities:\nComplete all complex clinical assessments for annual reviews to include Comprehensive Needs Assessments, Risk Assessments, DLA-20’s, Diagnostic Review, and Columbia Suicide Assessments.\nDevelop and write all treatment plans for individuals entering the Intensive Outpatient Program (IOP) or expanded Substance Use Disorders (SUD) services and complete their quarterly reviews.\nSubmit Medicaid authorizations and re-authorizations.\nProvide both process groups and psychoeducational groups, individual therapy, family and couple’s therapy and crisis counseling.\nIn the absence of the Clinical Supervisor and Program Supervisor, the Clinician III is responsible for delegating tasks, ensuring the safety of all individuals in the program at all times, handling crisis situations, ensuring all work is completed in a timely manner, communicating with the administrative team, and being knowledgeable about policies and procedures.\nResponsible for individual monitoring, answering telephone inquiries, knowledge of referral sources, documentation in individual charts and other duties as assigned.\nAssist in program planning, development, implementation and evaluation to strive for continued program service delivery to individuals.\nThe Clinician III will be the consultant for others on the team to discuss complex case conceptualizations, treatment planning and discharge planning.\n\nWe are hiring for two evening shifts. Please see the work schedules that are available below. Afternoon/evening schedules associated with this position are eligible for shift differential pay according to City policy 2.08.\nMonday - Friday, 2:00 pm - 10:30 pm\nMonday - Friday, 2:30 pm - 11:00 pm\n\nThe City offers a generous benefits package which includes health, dental and life insurance, retirement, and savings plans, maternity/paternity and parental leave, holidays and Paid-Time-Off.\nOfficial City Job Description:\nhttps://virginia-beach-departments-docs.s3.amazonaws.com/city/job-descriptions-pay-plans/BHDS-Clinician-III-02140.pdf\nWorking Conditions:\nhttps://workingcondition-summary-prod.s3.amazonaws.com/B.000410.3.pdf\nMinimum Requirements:\nMINIMUMS: Requires a Bachelors degree in a human services field (such as psychology, behavioral or mental health, special education, social work) and five (5) years of experience associated with such positions as clinician, counselor, therapist, social worker, psychologist or psychiatric nurse OR any combination of education (above the high school level) and/or experience equivalent to nine (9) years associated with such positions as clinician, counselor, therapist, social worker, psychologist or psychiatric nurse.\n\n\n\nSPECIAL REQUIREMENTS: Professional licensure registered with the Virginia Board of Counseling as a Licensed Clinical Social Worker (LCSW), Licensed Professional Counselor (LPC), Licensed Clinical Psychologist (LCP), License Mental Health Professional (LMHP) is required. All employees may be expected to work hours in excess of their normally scheduled hours in response to short-term department needs and/or City-wide emergencies.\nAdditional Requirements:\n\nDMV Transcript: Required\nCDL: Not Required\nDOT History: Not Required\nCPS Check: Required\nPhysical: Not Required\nRespirator: Not Required\nPolygraph Review: Not Required\nPsychological Screening: Not Required\n\nAttachments Required: Resume\nPreferences:\nExperience conducting substance use disorders (SUD) groups.\nExperience conducting individual therapy with SUD adult individuals.\nExperience conducting couples and family therapy with SUD individuals.\nExperience and Knowledge of Dialectical Behavioral Therapy (DBT).\nExperience in trauma informed care.\nExperience with co-occurring mental health and SUD counseling.\nExperience utilizing harm reduction strategies.\nSpecial Instructions:\nMust be licensed as a LPC, LCSW, LCP, or licensed eligible LPC.\n\nThis posting is for three vacancies and will remain open until filled. Applications will be reviewed, and interviews conducted ongoingly until selections are made for all advertised vacancies.\nPlease complete the application in its entirety and include your resume if required by the posting.\nYour responses to any \"Supplemental Questions\", if attached to this requisition, must be supported by the information you provide on your application and/or resume; or otherwise demonstrated during the hiring process.\nYou will not be able to access the details of this job ad once the closing date has passed. If you would like to retain this information, please take a screen shot or print using your browser's printing capability.\nVRS Contribution: All full-time employees are required to contribute 5% of annual salary toward their retirement account; in accordance with VRS retirement provisions. This will be handled through a pre-tax payroll deduction.\nDrug Free Workplace: The City of Virginia Beach maintains a drug free workplace."
  },
  {
    "title": "Senior Data Scientist",
    "company": "Combined Computer Resources",
    "location": "Remote",
    "salary": "$60 - $75 an hour",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0BldYzZX3Rc-W91WsmH5NHExfqmo1VnWi5oaah42hwmwEaUVXGz2km4DuRp5CbFy0FkElwwYIJzB8mvICgDG609pGqfq69AKyxhTxElfd7Xf-pipwjJbPKdQcaMpaXswrYvJYveCKkGcBjvVgBPIlZPoEamnDkh2pP-lvdEp4cJj3aVuGC-AopmpiN7GkgfK6O0FQ-9ubFDzTlc5Y9nNY_Qn5EFDqTJfHq2wZxo6oAZzXJdpG4oerP5vC9LDCOK7ZMlw5k3B2vT6xRwFeKid5wLw1Cmu-Z7zKBMAZJq_FHJWeL3ehyfANHfdUk_bTgVA038k36Edz-58TuTmtbx9L2Lrs6hrE3fpLVc-nUtgtXGzcJO7zRAxXEJcefrLfGrrNxavsCG2Vl5raIspr5_Q73m1NxXpbIifcHjHw2JGbHaOK2YudF9jx5T5oCantHu-JA-7ZpIjuTu13-zLxC_Wl0Lu9cjZjdHkwHjLWjKHvXs_tx8-cLTcXSbg6x3tL8DXzO7T4BtM0CS43zYBLYlv4PBMl3B7fTASooQogTN4Dy_sEUoYtNWcqAjZhVVfY4Mh9e3MYVX-K35kPRADCHleDhbiuIjQ8WFO2VYRB-HFH6PQn9H-HhPFYjY6JKTJis5cU3HT8TCgJ_SRbDxYfOt4-RvsTEMiLSg7dAngOPsb9tDh0NHl96mO2SR&xkcb=SoBb6_M3sjadC6W0NB0ebzkdCdPP&camk=4HOcmqOLYrBof6KEKnBRng==&p=6&fvj=0&vjs=3",
    "description": "We are seeking a highly capable and versatile Data Scientist with expertise in SQL, Python, AWS, PostgreSQL, Natural Language Processing (NLP) and large language models (LLMs). You’ll be at the forefront of building intelligent systems that interpret and analyze both structured and unstructured data, turning complex outputs into clear, actionable insights for business stakeholders.\nThis role is ideal for someone who thrives at the intersection of data science, engineering, and business strategy with the ability to translate business questions into scalable technical solutions. It is a great fit for someone who enjoys problem-solving under pressure, can adapt quickly to shifting priorities, and has the confidence to work with demanding clients and tight deadlines all while maintaining a calm, collaborative approach and a focus on quality.\nKey Responsibilities:\nDesign and execute complex SQL queries, views and functions for large-scale data analysis and reporting.\nDevelop, fine-tune, and implement NLP and LLM-based solutions, such as document summarization, text classification and semantic search.\nBuild robust data pipelines and AI/ML workflows using Python (Pandas, Scikit-learn, Transformers, etc.).\nLeverage AWS services (e.g., Lambda, SageMaker, S3, Glue) for model training, deployment, and data orchestration.\nWork with PostgreSQL to store, create views, create functions, query, and model structured data efficiently.\nTranslate technical findings into actionable insights for business stakeholders in a clear, concise manner.\nConvert complex business needs into technical designs and machine learning applications, collaborating closely with product, engineering, and business teams.\nMonitor model performance, run A/B tests, and iterate on NLP and LLM models.\nStay updated on the latest developments in NLP, generative AI, and machine learning.\nRequired Qualifications:\n3+ years of experience in a data science, artificial intelligence, machine learning role.\nAdvanced SQL proficiency, including performance tuning and complex joins.\nStrong Python coding skills, with hands-on experience in NLP libraries (e.g., Hugging Face Transformers, spaCy, NLTK).\nDemonstrated experience working with and integrating into LLMs (e.g., OpenAI GPT, Cohere, Claude) and prompt engineering.\nExperience developing and deploying NLP models for tasks such as named entity recognition, sentiment analysis, summarization, or question answering.\nProficiency with AWS cloud services, especially SageMaker, Lambda, Glue, and S3.\nStrong working knowledge of PostgreSQL and relational databases.\nProven ability to translate business goals into technical solutions and present results to non-technical audiences.\nPreferred Qualifications:\nMaster’s in Computer Science, Data Science, Computational Linguistics, or a related field.\nExperience with MLOps and model lifecycle management.\nFamiliarity with orchestration and pipeline tools (e.g., Airflow, MLflow).\nExperience integrating NLP and LLM models into production systems or customer-facing tools.\nStrong data visualization and storytelling skills using tools like Tableau, Power BI, or Plotly.\nJob Type: Contract\nPay: $60.00 - $75.00 per hour\nWork Location: Remote"
  },
  {
    "title": "Data Engineer (ETL Developer)- 3-6 Month Assignment",
    "company": "MAXhealth",
    "location": "Hybrid work in Tampa, FL 33607",
    "salary": "$85 an hour",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0DiAk68JSMl3ZZHS5bizvPn2Ec_npTZVD4SV40bPesGlDv8cCVbf7c0M5CZalJFUizkbvSmpVsdxg5dKUW2gxVKyjq_6QVK45UNakaa0Jmq0toSHZRzRUHP1KXnOncel0n666x4cOOX-zXBRMnPygeGysSO_BNVgCTIyvWuIimdO0FqAa9wcefGm2os3CX3u2QU-lpUzRZxp_hMtYq38k79Yh0TZ3cY39qXc5sdGsT-c1TFd_dq_k9QwtRTXhrvOer6w6MmuMSk7ePx-C3V2YDfwoumrQwgoP-pGmSP3z_nBwx1aqm8h33NDNQSvbUE6LFxQuJjrIamy9cjqJCnVcfkP8unZ2nsAwgop08sp_v-JWkH30JyLuF-1POBpl6NvRyYg5UsNqORJ9XDlUesWrTJ8XmzaiDMkRW0Bcji1yPzpBd7KCy8mnXzzl20z6ZoC47Q80Frr4zwJ1jIVM8NtOhBvvjs6y9_tIKuHf0qw4fTRKD_XkazCsG1ydUuUv6Zpgh97t3QKUTx00OcULZ9yRNKrPU5G2hQB2JK11LPs5KJZiLylUR5IxFWd7y1vi6GCXYigIEihuAXiopQ_w7s-37vBHqOYsGzdzvgpoc_Ct7_EkXsGM5sOZZkGnzI5Soc81_2l0EvDuKwhDuEgC8b812D5DqDl7sjLo8=&xkcb=SoBy6_M3sjadC6W0NB0cbzkdCdPP&camk=tQsC0y0u1Lp50gmX-9UkPw==&p=8&fvj=0&vjs=3",
    "description": "MaxHealth is seeking a highly skilled Data Engineer (ETL Developer) to join our data engineering team to modernize and optimize our data pipelines. The Data Engineer (ETL Developer) will be responsible for designing, building, and maintaining scalable ETL pipelines to support our analytics and reporting needs. This individual will leverage Azure Data Factory (ADF), SQL Server Integration Services (SSIS), SQL Server, and modern BI platforms (Domo and Power BI) to ensure accurate, timely, and secure data delivery. The ideal candidate will have experience with healthcare data including: payer raw data, NCQA HEDIS quality data, and Medicare Risk Adjustment datasets.\nLocation- Hybrid/Tampa\n1099 Contractor- Starting salary $85, 000 annum based on experience\nThis is a 3-6 month assignment with the possibility of opportunity for extension into a permanent position.\n\nKey Responsibilities\nDesign, develop, and maintain modernized ETL pipelines using Azure Data Factory, Fabric, Databricks and/or SSIS to integrate multiple data sources into the enterprise data warehouse.\nCollaborate with analysts, data scientists, and business stakeholders to deliver clean, reliable, and well-structured data.\nOptimize and refine existing ETL processes to improve performance, scalability, and maintainability.\nDevelop and maintain and/or convert SQL stored procedures, views, functions, and scripts for analytics and reporting.\nImplement data quality checks, error handling, and monitoring to ensure accurate and consistent data flows.\nUtilize a code repository (Git or similar) to manage, version, and document ETL code.\nSupport integration of healthcare data sources, including claims, eligibility, provider rosters, and quality/risk adjustment data.\nPartner with business teams to enable HEDIS measure calculation, quality reporting, and risk adjustment analytics.\nCollaborate with the BI team to deliver data models and datasets for dashboards in Power BI and Domo.\nEnsure adherence to data governance, compliance, and security best practices (HIPAA, PHI/PII handling).\nTroubleshoot data issues, perform root cause analysis, and implement preventive measures.\n\nJob Qualifications\nBachelor's degree in Computer Science, Information Systems, or a related field; or equivalent experience.\n5+ years of professional experience in ETL development and SQL-based data warehouse engineering.\nStrong expertise with SQL Server Integration Services (SSIS), and T-SQL.\nProven experience integrating and transforming healthcare payer data (claims, eligibility, encounters).\nProficiency with Git or other version control systems for code management.\nExperience supporting data visualization/reporting in Power BI and Domo.\nStrong understanding of data modeling, normalization, indexing, and query optimization.\nStrong problem-solving skills and ability to communicate technical concepts to non-technical stakeholders.\nFamiliarity with HIPAA compliance, data privacy, and PHI/PII handling.\n\nPreferred Skills\nExperience with Azure Data Factory or Fabric (or similar), other Azure services (Azure SQL Database, Data Lake, Synapse).\nWorking knowledge of NCQA HEDIS quality measures and related data sets.\nExperience with Medicare Risk Adjustment (HCC coding, RAF scores) data structures and reporting.\nBackground in healthcare analytics, value-based care, or health plan operations.\nFamiliarity with APIs, scripting (Python/PowerShell), and automation for data pipeline orchestration.\n\nABOUT MAXHEALTH\nMaxHealth is dedicated to simplifying healthcare and ensuring healthier futures. Founded in 2015, MaxHealth is a leading primary care platform focused on providing high-quality, integrated care to adults and senior patients throughout Florida. We provide care for more than 120,000 patients, most of which are beneficiaries of government-sponsored healthcare programs like Medicare, or of health plans purchased on the Affordable Care Act exchange marketplace. MaxHealth is a rapidly growing medical practice with more than 50 clinics spread across central and southern Florida. MaxHealth also partners with independent providers who are like-minded and utilizes its platform to help them provide high-quality care. We are customer-centered; compassionate; results-driven; proactive; collaborative; and adaptable in executing our vision to help patients live their best lives. Our mission is to deliver quality care, a simplified experience, and happiness. One patient at a time.\n#IND123"
  },
  {
    "title": "Senior Manager, Data Science - Credit Model Review",
    "company": "Capital One",
    "location": "Richmond, VA 23218 \n(City Center area)",
    "salary": "Full-time",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0C3j_zLGvpMLCdiZ0WC46XqVTA1VMZzOzKXPhAXwYlrNc2ZimNTpf2_4MHwNa_erOwi-frjd9C-YZQS2EMsk1JSjwON6MfsWtYs231HBGzg0Y2Yai4S2ASqQj4aBVGSwaegvYCpHjAKIMppqPxZA_GoFXxWxU3hIlzU2qmC2MVo_cfvmNauVKIlYHkuHy3jeWefnejcQdJlcswnkGcleEH50AlalL8r-a_9FoI9yBeDQ24qr-edBFCs9M8AMj93u3nr22ZfaE0OqgS_vUfekMxH8O3zBkZkrtYnLvZ_E0YwAJyUY7dH32GRydH_PcX3eFMf4OnhCrpakLeJVx6VqXdTo7QC_Pa6Lq1g58Acp4f_2x3qaqJuROiuV2n4OUQX_zT4-Tf9-lpNaLA8FuWn7fN8CL1Z3WXA0HUp3SgGpHVRVvEYnSuvaZe1patLZSknwIZCTs_Xl5XY7IoBJqm_3VylHdFLboOfzhTnW0fg_qqGfxm5fDOSdWe91pTubHsHcNHHIfYLk2VZVOyWKbZ64MpFjcxck9aqPZBJ2jPUPl5FgsunKcJ8v2CT41ThACNaf7NwST-y7NSj-dVGOe7TsBFdN0qCCYy0J182err2p2IamU3g32ymQa4L8I1fY_BebetYf2--nHJM3Af2ka_4iMsZK6N1sd84FO6Q3si-LU7wFxRNV4ygOf6kJnE2-ryMwfcBsUs8-5U_6Q_35lqRJ6yge7p4sLPz8YFmESd-7RZOsA24_7qBl3PrtED4VHvPi-f04spegl05uI96t1X141atJmDgu-f6FnCAtNQgB1LdDT0qLTd04NgqLjFDJA4tkd9m-Iw88aWgnjwT98QkcaNyfv1ZaAyIG2OhXcG3jhkNzwLyByn6xajNAW4UCby08ruNyB3sW5cZah6JzhmwT8imCAsnAoW3oj_pP1no2AGAtbE_QwKejJoMW7uRR1izUjL-ogB9xGDln7enXUpUGyPhdpPayD_Ms7rI9H6D8OvOCgcYATO-dNQ7nGpvNB53UmV8xe25TPr5j9zAozcQ9WuQv2PtEWM8EjkF1RYgY0ZnvN-IJznIwCZdt6ILQ64lxgRDnoRC_Ok5dn8D_9rYkDVfSLqVtjRmgDdmtljkpgHqfeo8ADmP16eknZEmOLhN9MRn6SnPs1kejOfPtPn9T5YBNoydtK-iuSuXpn35hYq2c-_7nHfZgsHfnm9I5W4qvHjaTF-9zb5WpDRa12RVsvj6sGO7evIH1cm-t1fVGCRDsrrvQ4mnNn6DT0alavOGjhKY0u6P2lfmwrd5rMXFI48W&xkcb=SoCb6_M3sjadC6W0NB0TbzkdCdPP&camk=4HOcmqOLYrByKel4K0fjog==&p=9&fvj=0&vjs=3",
    "description": "Senior Manager, Data Science - Credit Model Review\nData is at the center of everything we do. As a startup, we disrupted the credit card industry by individually personalizing every credit card offer using statistical modeling and the relational database, cutting edge technology in 1988! Fast-forward a few years, and this little innovation and our passion for data has skyrocketed us to a Fortune 200 company and a leader in the world of data-driven decision-making.\nAs a Data Scientist at Capital One, you’ll be part of a team that’s leading the next wave of disruption at a whole new scale, using the latest in computing and machine learning technologies and operating across billions of customer records to unlock the big opportunities that help everyday people save money, time and agony in their financial lives.\nTeam Description\nIn Capital One’s Credit Review Model, Data and Innovative Solutions Team, we defend the company against model failures and find new ways of making better decisions with models. We use our statistics, software engineering, and business expertise to drive the best outcomes in both Risk Management and the Enterprise. We understand that we can’t prepare for tomorrow by focusing on today, so we invest in the future: investing in new skills, building better tools, and maintaining a network of trusted partners.\nWe partner with best-in-class data scientists, analysts, credit risk management experts, and engineers to innovate solutions that directly impact the company’s bottom line in a meaningful way. We do it all in a collaborative environment that values individual insight, encourages each associate to take on new responsibilities, promotes continuous learning, and rewards innovation.\nIn this role, you will:\nPartner with a cross-functional team of data scientists, software engineers, and product managers to deliver a product customers love\nLeverage a broad stack of technologies — Python, Conda, AWS, H2O, Spark, and more — to reveal the insights hidden within huge volumes of numeric and textual data\nBuild statistical and machine learning models to challenge the models in production\nFlex your interpersonal skills to translate the complexity of your work into tangible business goals\nThe Ideal Candidate is:\nInnovative. You continually research and evaluate emerging technologies. You stay current on published state-of-the-art methods, technologies, and applications and seek out opportunities to apply them.\nCreative. You thrive on bringing definition to big, undefined problems. You love asking questions and pushing hard to find answers. You’re not afraid to share a new idea.\nTechnical. You’re comfortable with open-source languages and are passionate about developing further. You have hands-on experience developing data science solutions using open-source tools and cloud computing platforms.\nStatistically-minded. You’ve built models, validated them, and backtested them. You know how to interpret a confusion matrix or a ROC curve. You have experience with clustering, classification, sentiment analysis, time series, and deep learning.\nBasic Qualifications:\nCurrently has, or is in the process of obtaining a Bachelor’s Degree plus 7 years of experience in data analytics, or currently has, or is in the process of obtaining a Master’s Degree plus 5 years of experience in data analytics, or currently has, or is in the process of obtaining PhD plus 2 years of experience in data analytics, with an expectation that required degree will be obtained on or before the scheduled start date\nAt least 3 years’ experience in open source programming languages for large scale data analysis\nAt least 3 years’ experience with machine learning\nAt least 3 years’ experience with relational databases\nPreferred Qualifications:\nPhD in “STEM” field (Science, Technology, Engineering, or Mathematics) plus 4 years of experience in data analytics\nAt least 5 years’ experience in Python, Scala, or R for large scale data analysis\nAt least 5 years’ experience with machine learning\nAt least 5 years’ experience with SQL\nExperience in the Banking or Financial industry\nCapital One will consider sponsoring a new qualified applicant for employment authorization for this position.\nThis role is Hybrid, with associates expected to consistently spend three days per week in the office.\nThe minimum and maximum full-time annual salaries for this role are listed below, by location. Please note that this salary information is solely for candidates hired to perform work within one of these locations, and refers to the amount Capital One is willing to pay at the time of this posting. Salaries for part-time roles will be prorated based upon the agreed upon number of hours to be regularly worked.\nRichmond, VA: $204,900 - $233,800 for Sr Mgr, Data Science\nRiverwoods, IL: $204,900 - $233,800 for Sr Mgr, Data Science\nMcLean, VA: $225,400 - $257,200 for Sr Mgr, Data Science\n\nCandidates hired to work in other locations will be subject to the pay range associated with that location, and the actual annualized salary amount offered to any candidate at the time of hire will be reflected solely in the candidate’s offer letter.\nThis role is also eligible to earn performance based incentive compensation, which may include cash bonus(es) and/or long term incentives (LTI). Incentives could be discretionary or non discretionary depending on the plan.\nCapital One offers a comprehensive, competitive, and inclusive set of health, financial and other benefits that support your total well-being. Learn more at the Capital One Careers website. Eligibility varies based on full or part-time status, exempt or non-exempt status, and management level.\nThis role is expected to accept applications for a minimum of 5 business days.\nNo agencies please. Capital One is an equal opportunity employer (EOE, including disability/vet) committed to non-discrimination in compliance with applicable federal, state, and local laws. Capital One promotes a drug-free workplace. Capital One will consider for employment qualified applicants with a criminal history in a manner consistent with the requirements of applicable laws regarding criminal background inquiries, including, to the extent applicable, Article 23-A of the New York Correction Law; San Francisco, California Police Code Article 49, Sections 4901-4920; New York City’s Fair Chance Act; Philadelphia’s Fair Criminal Records Screening Act; and other applicable federal, state, and local laws and regulations regarding criminal background inquiries.\nIf you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation, please contact Capital One Recruiting at 1-800-304-9102 or via email at RecruitingAccommodation@capitalone.com. All information you provide will be kept confidential and will be used only to the extent required to provide needed reasonable accommodations.\nFor technical support or questions about Capital One's recruiting process, please send an email to Careers@capitalone.com\nCapital One does not provide, endorse nor guarantee and is not liable for third-party products, services, educational tools or other information available through this site.\nCapital One Financial is made up of several different entities. Please note that any position posted in Canada is for Capital One Canada, any position posted in the United Kingdom is for Capital One Europe and any position posted in the Philippines is for Capital One Philippines Service Corp. (COPSSC)."
  },
  {
    "title": "Data Scientist",
    "company": "ManTech",
    "location": "Fort Meade, MD",
    "salary": "Full-time",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0C_-Eyaxwg4bxD6uh_5jIFBuPkrGxkuLZfa77QnGUab3bLqfQXf7dZcxHXA1gBZBwJVqSCcEtlLC2NehNCQMFCaIj41ZX5zxp8a4r4GSrckcD0hYpAUBPusavAMHS2RU4dWZliOLUi7uGCq06zVjtlT6vXFNR4zr2_jszTb0w_oEXKL82nQWVBWf1766o_eKoxVInQ3eVqHt0NsEe5PFb1ihsHFNGAFHOCjxTkBPAkrg88EoGDFxnrq-xnxpy_IAgQ-B5pDLNtoLQHZTxrOH8cNp5uNi08hGHuj27fFVbUGcuy6vf56Mp7oTIpLtmGxC_H_lyxSAl1DG5mj0N3Ag3hL9NpAw1kzDR_X5EuxBuxOMSACEVTwWM_ZorQJuO0JZbx9mXVh46zWIgInsiDSYtYstYFqB2Sqbyi4PDnwsuWWYBRTV7UW7b7sVB6S_NDX_jKCbrs6Z1TTYzEf6emaXZhemIGZz4PmOS78F3X2WJYZPlkuXSvBgCFHe9uKK9gIuLWXb5P5Adzg7eWeJeb28rrDzZAgK3rPK0-M5Tc2BmQ-aU_LwY2gBXGWCMu_Hzr6FwFuuzlfNWxOw-xM-65lGncr_IZ2v7lfG0N7qRDqH5F0aXcw_gV3wTMGWrO80VyiGAulvuQq08dlJi0bSyd2TfVb&xkcb=SoAv6_M3sjadC6W0NB0SbzkdCdPP&camk=UoKtGZLa3XKKAQvZKfVv0g==&p=10&fvj=0&vjs=3",
    "description": "MANTECH seeks a mission-driven and innovative Data Scientist to join our team in Ft. Meade, MD. In this role, you will lead the development of cutting-edge machine learning and statistical analytics to support national security objectives. You will collaborate with subject matter experts and customers to guide analytic development from prototype to production, making an impact by delivering high-value data-driven insights.\nResponsibilities include but are not limited to:\nLeading a team of data scientists across multiple analytic development efforts\nCollaborating with customers and SMEs to define analytic requirements and ensure alignment with mission goals\nGuiding the team in prototyping and transitioning advanced analytics into operational environments\nApplying state-of-the-art machine learning, statistical, and graph-based algorithms to large and complex datasets\nDelegating analytic tasks to team members and overseeing performance to meet project objectives\nMinimum Qualifications:\nBachelor’s degree in a quantitative field (e.g., statistics, mathematics, operations research, engineering, or computer science)\n7+ years of experience analyzing datasets and developing advanced analytics\n7+ years of experience programming with data analysis tools such as R, Python, SAS, or MATLAB\nPreferred Qualifications:\nDemonstrated experience leading multi-disciplinary teams in a data science environment\nFamiliarity with transitioning analytic prototypes into production within secure systems\nStrong knowledge of emerging machine learning algorithms and their operational applications\nClearance Requirements:\nAn active TS/SCI with Polygraph is required to be considered for this position.\nPhysical Requirements:\nMust be able to remain in a stationary position 50% of the time\nConstantly operates a computer and other office productivity equipment, such as a calculator, copy machine, and printer\nFrequently communicates with co-workers, management, and customers, which may involve delivering presentations. Must be able to exchange accurate information in these situations"
  },
  {
    "title": "Data Visualization Specialist /ERP Data Scientist",
    "company": "CGI Group, Inc.",
    "location": "Arlington, VA 22201 \n(Bluemont area)",
    "salary": "$88,200 - $214,800 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0CmPt6JXytAhZscz-5ZOP53MMQ49Xi4hmwETo1lvmuAlZ7fNcZ2Zn_F3aUkaZRnPopPU623ipyhX1D_qi_VTwn2Nc0bMVNjmnsS5wprVqoWczRUmy6q9GW3UtzEvkVTMFuitEBWnfhZDhMvyZ5AVhyZwrzhdZG1UONvljfUWEJgL0KMZKk14xdENDCEtDom3OxN5o2K8u_XwNtZ0dtZg9OFf87bbP2EhXXLIKBkie-jUPHqHwrQoXjrudNBEw3vY6IEnSEdK8TxR012XYVcQPOJMh0vQ0jnI_0jvUnvaVP6UiOcOlEVOD3cO8v2mCQubZt3VDw8xxuQM1MY5Cm6w7vDZG_EH1ArcKApe3ctVWWUFCj-f_MECmIdXymWGTFEA1d97RsAJZJkjxosWOqZfRVR-cbbQihz11EQsLeMaSOIo-GMgVCUD5TOTj828TsrJDsVbd9HvLfpCLJeOvzzqYvUvquDSvlyqra5Nt7zz0Fg9vGGoklSvplNUi95SwSWn2T5izFaY29xkH8K9RXwxAEqXpZolPSmaHTJ9Tkb03Ik2KyweV4kN9lZFkIr3TVYY5VqSD1kti3y4WPPHpw6ub3H5pQNzVcbcwgjJri04OpEQJ-dlyQZ6GNBoZKfxbShqeWPR1q_zF8cLiIquf4qIF0CgWpmnuqyejOSgOsFk-DlWpYgVfs816xr&xkcb=SoCy6_M3sjadC6W0NB0RbzkdCdPP&camk=4HOcmqOLYrDRUgFLBjquYg==&p=11&fvj=0&vjs=3",
    "description": "Position Description:\nWe are seeking a Data Visualization Specialist who is passionate about solving challenging client problems with emerging technology solutions. As a CGI Data Visualization Specialist, you will be joining the International Affairs (IAF) group to support the mission of U.S. security, economic well-being, and worldwide relations. Working with various clients in the US federal space, IAF supports missions that foster national security, foreign relations and resilient democratic societies. Since 1976, CGI has partnered with the U.S. federal government to support a wide variety of organizations and unique missions building solutions that support clients around the world.\n\nThis position is located in Arlington, VA.\nYour future duties and responsibilities:\n. Apply problem-solving skills to modernize overall Business Intelligence technology solutions that will directly impact client missions.\n. Provide a level of expertise in Visualizations with PowerBI.\n. Be able to create dashboards and present data in a way that makes it visually appealing to the customer to promote customer adoption\nRequired qualifications to be successful in this role:\nAn interim Secret clearance is required to begin working onsite with our client, and a Secret clearance must be maintained throughout the project duration. Due to the nature of the government contract requirements and/or clearance requirements, US citizenship is required.\n. Bachelor's degree or Master's degree in Business, Computer Science, Mathematics or STEM related discipline.\n. 3-4 years' experience in Data Technology experience to include BI tools, methodologies, and/or responsibilities\n. Experience in design or development experience with visual analytics tools including PowerBI\n. Experience in visualization design experience to include dashboards, executive briefings, or front-end visualizations\n. Excellent communication and interpersonal skills\n. Proven ability to work creatively and analytically in a problem-solving environment as a part of an agile/client facing team\n. Experience creating data models and using statistical tools\nDesired qualifications/non-essential skills required:\n. Functional Experience in Acquisitions (Procurement) Data\n. Experience with Momentum ERP Tables\n\nCGI is required by law in some jurisdictions to include a reasonable estimate of the compensation range for this role. The determination of this range includes various factors not limited to skill set, level, experience, relevant training, and licensure and certifications. To support the ability to reward for merit-based performance, CGI typically does not hire individuals at or near the top of the range for their role. Compensation decisions are dependent on the facts and circumstances of each case. A reasonable estimate of the current range for this role in the U.S. is $88,200.00 - $214,800.00.\n\nCGI Federal's benefits are offered to eligible professionals on their first day of employment to include:\n.Competitive compensation\n.Comprehensive insurance options\n.Matching contributions through the 401(k) plan and the share purchase plan\n.Paid time off for vacation, holidays, and sick time\n.Paid parental leave\n.Learning opportunities and tuition assistance\n.Wellness and Well-being programs\n\n#CGIFederalJob\n#LI-KK4\nSkills:\nBusiness Process Consulting\nBusiness Strategy\nIT Strategy\nWhat you can expect from us:\nTogether, as owners, lets turn meaningful insights into action.\n\nLife at CGI is rooted in ownership, teamwork, respect and belonging. Here, youll reach your full potential because\n\nYou are invited to be an owner from day 1 as we work together to bring our Dream to life. Thats why we call ourselves CGI Partners rather than employees. We benefit from our collective success and actively shape our companys strategy and direction.\n\nYour work creates value. Youll develop innovative solutions and build relationships with teammates and clients while accessing global capabilities to scale your ideas, embrace new opportunities, and benefit from expansive industry and technology expertise.\n\nYoull shape your career by joining a company built to grow and last. Youll be supported by leaders who care about your health and well-being and provide you with opportunities to deepen your skills and broaden your horizons.\n\nCome join our teamone of the largest IT and business consulting services firms in the world.\n\nQualified applicants will receive consideration for employment without regard to their race, ethnicity, ancestry, color, sex, religion, creed, age, national origin, citizenship status, disability, pregnancy, medical condition, military and veteran status, marital status, sexual orientation or perceived sexual orientation, gender, gender identity, and gender expression, familial status or responsibilities, reproductive health decisions, political affiliation, genetic information, height, weight, or any other legally protected status or characteristics to the extent required by applicable federal, state, and/or local laws where we do business.\n\nCGI provides reasonable accommodations to qualified individuals with disabilities. If you need an accommodation to apply for a job in the U.S., please email the CGI U.S. Employment Compliance mailbox at US_Employment_Compliance@cgi.com. You will need to reference the Position ID of the position in which you are interested. Your message will be routed to the appropriate recruiter who will assist you. Please note, this email address is only to be used for those individuals who need an accommodation to apply for a job. Emails for any other reason or those that do not include a Position ID will not be returned.\n\nWe make it easy to translate military experience and skills! Click here to be directed to our site that is dedicated to veterans and transitioning service members.\n\nAll CGI offers of employment in the U.S. are contingent upon the ability to successfully complete a background investigation. Background investigation components can vary dependent upon specific assignment and/or level of US government security clearance held. Dependent upon role and/or federal government security clearance requirements, and in accordance with applicable laws, some background investigations may include a credit check. CGI will consider for employment qualified applicants with arrests and conviction records in accordance with all local regulations and ordinances.\n\nCGI will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with CGIs legal duty to furnish information."
  },
  {
    "title": "AI/ML Lead - IT Operations - Hybrid in MN or Remote",
    "company": "Optum",
    "location": "Hybrid work in Minnetonka, MN 55305",
    "salary": "$110,200 - $188,800 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0BWpgndjYL01xMr26yTqLCDFb3b3BUdaEwmMV3w6lpNxUsIZLXemk5fkggRKKneAdNFz9j2-4ufPCfYZnlEarFy7yl5wmWKXQ5t49pqGdREYw37biXBmZxoL1kJEseVR9q4IW4yRtOGNlXjBKSoQqQiKl1o1kQ9ZkwYCBQPSSuSztdW1Q4Tqyoo4S3d8qeeRa0SZ2xWoECLpm8DIhfRDB2T5PpFoHNrpseeYBxuxJBJkAQOquhYr6Ph83vqs86dbpCzl6EnpIkkEJcDwD6hzn9MFz_WOZFXhlajjy_1Q_nRzxS7lIPSx0SSIR3yvR6lTOgSxrB3SDMCFLHCSlsT59SRrHYsSRZ8sgCOZ7FfaDH2jEKoj9CSE695CmS91BauB_j3lg1C8NKbBEYFHoxA8Farw83Nzry1Vc1NJDmZiQrTz1m0wXXBT2HvqBPP6rWAxp3IP-AUzlT1Q-W78hcBc8rqb6yxRLzocSBVOHdaznzHssNT807Xk8KsP-u1OIvz6LIZAkdrXnfu36XsnnkRefA5kNIuzSMSE-EdNf3oxrfgSRFZ9Fl2dpoURJSz2ib6_oHJnC3CHCdgKnTEmbusC4n1VRSApWCu3aHulpnuFLonT9r8p1wbbEb6yx_ZE_jlSVkrqHj0fbMU0BQSHn8wiVAzShPPO-Z7GcoXkNjn5U2yn6w5RWdB0hMR2FbLbPqWFKJTHU2VYXfCuDOzdaFQ-mjpt3Zyv6g-wpn5iYMWfeBExjxCIccjrDTAmW3vCeAgxDGQPkIxmWxqwqqMZmir1yMGUg3EWenhknf-i2TikJlcuZj_2pBLeszl&xkcb=SoAG6_M3sjadC6W0NB0QbzkdCdPP&camk=nUmJqO2E8riwP1e3qbvzzw==&p=12&fvj=0&vjs=3",
    "description": "Optum is a global organization that delivers care, aided by technology to help millions of people live healthier lives. The work you do with our team will directly improve health outcomes by connecting people with the care, pharmacy benefits, data and resources they need to feel their best. Here, you will find a culture guided by inclusion, talented peers, comprehensive benefits and career development opportunities. Come make an impact on the communities we serve as you help us advance health optimization on a global scale. Join us to start Caring. Connecting. Growing together.\n\nWe're seeking a visionary AI/ML Lead to drive innovation in IT Operations through intelligent automation, predictive analytics, and agentic AI. This role will lead the design and deployment of scalable machine learning systems that enhance observability, accelerate incident response, and enable self-healing infrastructure across the enterprise.\n\nYou'll enjoy the flexibility to work remotely * from anywhere within the U.S. as you take on some tough challenges. This position follows a hybrid schedule with four in-office days per week.\n\nPrimary Responsibilities:\nData Engineering: Build robust, scalable pipelines to ingest and process structured and unstructured data from tools like Splunk, Dynatrace, ServiceNow, and system logs\nFeature Engineering: Create and maintain high-quality features for ML models supporting anomaly detection, predictive alerting, and automated remediation\nModel Deployment: Collaborate with Data Scientists to operationalize ML models, ensuring they meet performance, scalability, and maintainability standards\nAI-Driven Automation: Integrate ML insights into orchestration platforms (e.g., Jenkins, Interlink) to enable intelligent, self-healing workflows\nAgentic AI Systems: Design autonomous agents capable of reasoning, planning, and executing tasks across IT operations-handling incident triage, root cause analysis, and resolution\nData Governance: Uphold data integrity, lineage, and compliance with enterprise security and governance standards\nInfrastructure Enablement: Leverage cloud-native and hybrid technologies to support real-time analytics and model inference at scale\nCross-Functional Collaboration: Work closely with engineering, operations, and business teams to define requirements, document solutions, and contribute to knowledge bases for RCA and self-healing patterns\nCollaborate with research, engineering, and product teams to translate cutting-edge AI advancements into production-ready capabilities. Uphold ethical AI principles by embedding fairness, transparency, and accountability throughout the model development lifecycle.\n\nYou'll be rewarded and recognized for your performance in an environment that will challenge you and give you clear direction on what it takes to succeed in your role as well as provide development for other roles you may be interested in.\nRequired Qualifications:\nGraduate degree in Computer Science, Data Science, or a related field\n5+ years of experience in AI/ML engineering, with a focus on IT operations or infrastructure\n5+ years of hands-on experience with Python, SQL, and Spark for data processing and model development\n3+ years of experience with cloud platforms such as Azure, AWS, or GCP\n3+ years of experience implementing ML Ops practices, CI/CD pipelines, and containerization using Docker and Kubernetes\n3+ years of experience working with IT operations tools and concepts including CMDB, incident management, and observability platforms\n2+ years of experience integrating ML models into production environments and supporting model lifecycle management\n\nPreferred Qualifications:\n2+ years of experience with NLP, LLM frameworks, and Generative AI techniques\nExperience designing and deploying agentic AI systems for autonomous decision-making in operational contexts\nExperience leading data science projects and mentoring junior team members\nProven solid technical communication skills and experience with collaborative development using GitHub\nProven ability to work in agile environments and deliver high-impact, scalable solutions\n\nAll employees working remotely will be required to adhere to UnitedHealth Group's Telecommuter Policy\n\nPay is based on several factors including but not limited to local labor markets, education, work experience, certifications, etc. In addition to your salary, we offer benefits such as, a comprehensive benefits package, incentive and recognition programs, equity stock purchase and 401k contribution (all benefits are subject to eligibility requirements). No matter where or when you begin a career with us, you'll find a far-reaching choice of benefits and incentives. The salary for this role will range from $110,200 to $188,800 annually based on full-time employment. We comply with all minimum wage laws as applicable.\n\nApplication Deadline: This will be posted for a minimum of 2 business days or until a sufficient candidate pool has been collected. Job posting may come down early due to volume of applicants.\n\nAt UnitedHealth Group, our mission is to help people live healthier lives and make the health system work better for everyone. We believe everyone-of every race, gender, sexuality, age, location and income-deserves the opportunity to live their healthiest life. Today, however, there are still far too many barriers to good health which are disproportionately experienced by people of color, historically marginalized groups and those with lower incomes. We are committed to mitigating our impact on the environment and enabling and delivering equitable care that addresses health disparities and improves health outcomes - an enterprise priority reflected in our mission.\n\nUnitedHealth Group is an Equal Employment Opportunity employer under applicable law and qualified applicants will receive consideration for employment without regard to race, national origin, religion, age, color, sex, sexual orientation, gender identity, disability, or protected veteran status, or any other characteristic protected by local, state, or federal laws, rules, or regulations.\n\nUnitedHealth Group is a drug - free workplace. Candidates are required to pass a drug test before beginning employment.\n#OptumTechPJ"
  },
  {
    "title": "Principal Associate, Data Scientist - Transaction Intelligence",
    "company": "Capital One",
    "location": "New York, NY 10012 \n(SoHo area)",
    "salary": "Full-time",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0C3j_zLGvpMLCdiZ0WC46XqVTA1VMZzOzKXPhAXwYlrNc2ZimNTpf2_4MHwNa_erOzmbJsY_520GMyCO6XbDupeTTz-iHuJBXiXSaG0VIMJum8rsqRPgAJAjxgh732sZtYFQbVIl-j1NiiqdkiVkoZhYFwKvfP-y9n_pBcKji4kJ2s5Umo5PBMDDIa8Im9FanTgyFIq1tu3XQT1W3ce0de5Ok9PKPOIpXb1RaRndK_UTlOnWslK7puInFXOTQl5apoSup6Yrii9TuujSF7-Gy7DgkEnO4eSB8TYo1-i5fRRlQCIZ1JdsOXFjEmD8WXE-oZVkO2KSEm-BgF8OgEVMi67hSPk3Dpo0D4X0UYU386eM6DH-sgZs0ubZF7nkmK-NnWTVc8yM0U6YNPnTHzvt-Bikp52pBPdvOvImu30xsTbXLcVBWXokL_pA5dUCEe5g8VTydR34mtr6oxm4RrD4OSm67k_tmqX8etaK0WSrauTZoVPvQ1aHAP9tXJ9SxpHVBhwst3_P0YHelRj_bGgnhAgy2MvTleryVY1MjwW_zjzMVXE_3Zzco3lwsY5mLqenbwyJikEWZX1JE4CVZSRgQUIs6yf9SC3ACJAgFH_nVdM5R1wyWorHeY8u-_qatcjPgnGld1Ts9l4X3c59empcWHE1F5AnAUntQ2witY3eFtqtR_FyZnNWjRqRp4mYFjn460k5inzWHqLBvot-CC5ejR7wV8lx48V3xFOdiEJwcQ_fKmekjFDdBbibCY4nwiyaDQt2mNsGlK81wfmFZzM-K_qSymEISQJyB65TdnlFzhjoRAL6L31vrALKP6sO4DVzTKOBRmEcoIgkjC0djC5MmglL77k_L5bFRkwPJB4LE_GQAQ1k_JZtcJo7zaIEDINpp3qMThl9uNiDWTyk7g66FGgpax1daJJi4f243LKP_rfRoXY3bWJq0PlGo8r8QWuebdmcdyNLLePToqSUhLbScwNfddW9xG5djdkVdOACt_Uv1_ayORYPpCs--odwANFGSaPFev4Ylky2gGrhXeuxYV0HaeFluJvIR_0UJrDQzDTTJV9UstMgbITC2NTHAxfsi06ECHscjhgQfYjIiBkWIHbEHYID6qTXaJyEbz4ct9WHa3KHuz7dB9WR-RXb64X_7HSvBH4kFC6ksSqvAdoXLWuXcpV--J2KP4AcZxw8FUVmkJVJrIYBN94ntxiZkLVD9F71dIlE8zCC4y0sXgU62B_rIV5ZOLxZlTj-wbVvbDupEZv_URJfZC84Aj-GwkjaevKrUXf6Vuv7U4mTMkWV2lfQr2QtFsFKj8=&xkcb=SoCI6_M3sjadC6W0NB0XbzkdCdPP&camk=4HOcmqOLYrByKel4K0fjog==&p=13&fvj=0&vjs=3",
    "description": "Principal Associate, Data Scientist - Transaction Intelligence\nData is at the center of everything we do. As a startup, we disrupted the credit card industry by individually personalizing every credit card offer using statistical modeling and the relational database, cutting edge technology in 1988! Fast-forward a few years, and this little innovation and our passion for data has skyrocketed us to a Fortune 200 company and a leader in the world of data-driven decision-making.\nAs a Data Scientist at Capital One, you’ll be part of a team that’s leading the next wave of disruption at a whole new scale, using the latest in computing and machine learning technologies and operating across billions of customer records to unlock the big opportunities that help everyday people save money, time and agony in their financial lives.\nTeam Description\nThe Transaction Intelligence team leverages transaction data to power at-scale, real-time experiences that bring simplicity, clarity and confidence to our customers. We use Python, Spark, Snowflake, Databricks and Kubeflow as our tech stack, and build models and tools that serve our customer base as well as our analytical community at Capital One.\nRole Description\nIn this role, you will:\nPartner with a cross-functional team of data scientists, software engineers, and product managers to deliver a product customers love\nLeverage a broad stack of technologies — Python, Conda, AWS, Spark, Databricks, Snowflake, and more — to reveal the insights hidden within huge volumes of numeric and textual data\nBuild machine learning models through all phases of development, from design through training, evaluation, validation, and implementation\nFlex your interpersonal skills to translate the complexity of your work into tangible business goals\nExplore and apply the latest advances in machine learning, such as transformer modeling architectures, to real-world problems facing the financial services industry\nThe Ideal Candidate is:\nInnovative. You can apply the latest developments in machine learning to real-world problems facing the financial services industry.\nTechnical. You’re comfortable with a broad stack of technologies.\nCreative. You are a builder and deployer of machine learning models, with experience in all phases of development, from design through training, evaluation, validation, and implementation.\nA data guru. “Big data” doesn’t faze you. You have the skills to retrieve, combine, and analyze data from a variety of sources and structures. You know understanding the data is often the key to great data science.\nBasic Qualifications:\nCurrently has, or is in the process of obtaining one of the following with an expectation that the required degree will be obtained on or before the scheduled start date:\nA Bachelor's Degree in a quantitative field (Statistics, Economics, Operations Research, Analytics, Mathematics, Computer Science, or a related quantitative field) plus 5 years of experience performing data analytics\nA Master's Degree in a quantitative field (Statistics, Economics, Operations Research, Analytics, Mathematics, Computer Science, or a related quantitative field) or an MBA with a quantitative concentration plus 3 years of experience performing data analytics\nA PhD in a quantitative field (Statistics, Economics, Operations Research, Analytics, Mathematics, Computer Science, or a related quantitative field)\nPreferred Qualifications:\nMaster’s Degree in “STEM” field (Science, Technology, Engineering, or Mathematics) plus 3 years of experience in data analytics, or PhD in “STEM” field (Science, Technology, Engineering, or Mathematics)\nAt least 1 year of experience working with AWS\nAt least 3 years’ experience in Python, Scala, or R\nAt least 3 years’ experience with machine learning\nAt least 3 years’ experience with SQL\nCapital One will consider sponsoring a new qualified applicant for employment authorization for this position.\nThe minimum and maximum full-time annual salaries for this role are listed below, by location. Please note that this salary information is solely for candidates hired to perform work within one of these locations, and refers to the amount Capital One is willing to pay at the time of this posting. Salaries for part-time roles will be prorated based upon the agreed upon number of hours to be regularly worked.\nNew York, NY: $173,000 - $197,400 for Princ Associate, Data Science\n\nCandidates hired to work in other locations will be subject to the pay range associated with that location, and the actual annualized salary amount offered to any candidate at the time of hire will be reflected solely in the candidate’s offer letter.\nThis role is also eligible to earn performance based incentive compensation, which may include cash bonus(es) and/or long term incentives (LTI). Incentives could be discretionary or non discretionary depending on the plan.\nCapital One offers a comprehensive, competitive, and inclusive set of health, financial and other benefits that support your total well-being. Learn more at the Capital One Careers website. Eligibility varies based on full or part-time status, exempt or non-exempt status, and management level.\nThis role is expected to accept applications for a minimum of 5 business days.\nNo agencies please. Capital One is an equal opportunity employer (EOE, including disability/vet) committed to non-discrimination in compliance with applicable federal, state, and local laws. Capital One promotes a drug-free workplace. Capital One will consider for employment qualified applicants with a criminal history in a manner consistent with the requirements of applicable laws regarding criminal background inquiries, including, to the extent applicable, Article 23-A of the New York Correction Law; San Francisco, California Police Code Article 49, Sections 4901-4920; New York City’s Fair Chance Act; Philadelphia’s Fair Criminal Records Screening Act; and other applicable federal, state, and local laws and regulations regarding criminal background inquiries.\nIf you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation, please contact Capital One Recruiting at 1-800-304-9102 or via email at RecruitingAccommodation@capitalone.com. All information you provide will be kept confidential and will be used only to the extent required to provide needed reasonable accommodations.\nFor technical support or questions about Capital One's recruiting process, please send an email to Careers@capitalone.com\nCapital One does not provide, endorse nor guarantee and is not liable for third-party products, services, educational tools or other information available through this site.\nCapital One Financial is made up of several different entities. Please note that any position posted in Canada is for Capital One Canada, any position posted in the United Kingdom is for Capital One Europe and any position posted in the Philippines is for Capital One Philippines Service Corp. (COPSSC)."
  },
  {
    "title": "Machine Learning Scientist III - Causal Inference & CLV Strategy",
    "company": "Expedia Group",
    "location": "Austin, TX 78758 \n(The Domain area)",
    "salary": "$137,500 - $220,000 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0DbIyHopYNdPLgRYRG2FgnuJLz47mHLRnOVu2tY5XDnod2kQ1kD4SQatx4-P_YDUHejCugpGSSnok_-9xBTNy-B4c7xZ_I9atJemtX90CBwXVZ6-9iKSDhlz4yl85mdqMstl7hbYs7ZUkwyhx3IwrUFVvWuNbXFdWz73zqCKh17DhohwlYSPQPCllID4CujM4IYFLPpK0R48vVcD8IkYmwqAzr3t75eK7XjABDKJeveyJzBVEDX5idxIQY86iW1tWvrXrKxTA5RY3SdgYKGTcIW6S5ypVg98PthmmbOanWeJzNwvsfqiaS5R-FVU5uKJHaxRODlKqRNYRMK3IGwqN86hitj17DNboT8wbjpcUz8Y4OLVnwXLVX7I0yOsuxPTXSiuDuM-6Kr0xDl_Lu32PZvpLYb9swHY54dTZtRLlK0NdemfMOeX8rm1kLw40ksnev15oLOJs7s0AtcdsFrjZA8TPc13PdC4JglBXPaxPLdAtMvm0AuQnQUK6EhRARm3v3oea8IBJHL61j_JBV-RKJgx5-CGXBL2-rP-tQzVt8cRDiYVoOWgvUUihHGA79QtfxgyAemkSUGWWvaLNGyGg5y9n4YOGMoHzNVrprnV_2GNjdjZTHBbuUq_A9FgLc22hnoYVV-MwVn5M-EFrFF1gnbY_DCutLJbSQ=&xkcb=SoA86_M3sjadC6W0NB0WbzkdCdPP&camk=UoKtGZLa3XKeFSmBlYB6-g==&p=14&fvj=0&vjs=3",
    "description": "Expedia Group brands power global travel for everyone, everywhere. We design cutting-edge tech to make travel smoother and more memorable, and we create groundbreaking solutions for our partners. Our diverse, vibrant, and welcoming community is essential in driving our success.\nWhy Join Us?\nTo shape the future of travel, people must come first. Guided by our Values and Leadership Agreements, we foster an open culture where everyone belongs, differences are celebrated and know that when one of us wins, we all win.\nWe provide a full benefits package, including exciting travel perks, generous time-off, parental leave, a flexible work model (with some pretty cool offices), and career development resources, all to fuel our employees' passion for travel and ensure a rewarding career journey. We’re building a more open world. Join us.\nExpedia Technology teams partner with our Product teams to create innovative products, services, and tools to deliver high-quality experiences for travelers, partners, and our employees. A singular technology platform powered by data and machine learning provides secure, differentiated, and personalized experiences that drive loyalty and traveler satisfaction.\nWho We Are:\nTravel is a force for good. At Expedia Group (Expedia, Hotels.com, Vrbo, Travelocity, Orbitz, Wotif, and others), our mission is to power global travel for everyone, everywhere—because we know that travel strengthens connections, broadens horizons, and bridges divides.\nPowered by more than 80+ terabytes of data and 20+ years of tech innovation, Expedia Group is one of the world’s largest travel platforms. With unrivaled knowledge of the industry and advanced technology, we’ve built a marketplace that filters through millions of possibilities for travelers and partners worldwide.\nAbout the Team:\nThe Marketplace Machine Learning Science team is launching a high-impact initiative focused on Customer Lifetime Value (CLV)—a key business metric that will shape long-term company performance and executive decision-making. As a Machine Learning Scientist III, you will lead efforts to build causal models and experimentation frameworks that optimize how we serve millions of travelers globally.\nThis is a high-visibility role with direct exposure to executive leadership and cross-functional teams across product, engineering, marketing, customer service, pricing, and more. You’ll be joining a zero-to-one initiative with strong leadership support and urgency to deliver impact starting immediately.\nStrategic Impact & Visibility:\nThis role offers a rare opportunity to shape how Expedia Group measures and optimizes long-term customer value. You’ll be part of a newly formed team with zero existing members on CLV, giving you the chance to influence foundational modeling decisions and build scalable solutions from the ground up.\nIn this role, you will:\nLead the research and implementation of scalable machine learning and data science solutions end-to-end with engineering rigor\nApply causal inference techniques to understand drivers of customer lifetime value and measure the impact of business interventions (e.g., marketing, service, product features)\nDesign and execute robust experiments (e.g., A/B tests, quasi-experimental methods) to evaluate business strategies and validate model performance\nTranslate complex findings into actionable insights for both technical and non-technical stakeholders\nBreak down ambiguous business problems into structured, data-driven solutions\nStay informed on relevant ML and AI research, with support from Expedia’s learning and development resources\nCollaborate with other machine learning and data science teams to foster a strong data science culture across Expedia Group\nMinimum Qualifications:\nAdvanced degree in Computer Science, Statistics, Operations Research, Econometrics, Economics, or a related quantitative field\nTypically requires 4+ years of professional experience, though candidates with equivalent project or research experience are encouraged to apply\nStrong hands-on experience in causal modeling and experimental design\nProven ability to analyze large, complex datasets and generate actionable insights\nPragmatic problem solver focused on scalable and effective methods\nAbility to share ideas effectively with diverse technical and business audiences\nPreferred Qualifications:\nProficiency in Python; familiarity with Spark is a plus but not required - eagerness to learn is valued\nExperience with end-to-end ML solution development\nExperience or interest in applying AI techniques, including large language models (LLMs), is a plus\nExpedia Group is proud to offer a wide range of benefits to support employees and their families, including medical/dental/vision, paid time off, and an Employee Assistance Program. To fuel each employee’s passion for travel, we offer a wellness & travel reimbursement, travel discounts, and an International Airlines Travel Agent (IATAN) membership. View our full list of benefits.\nThe total cash range for this position in Austin is $137,500.00 to $192,500.00. Employees in this role have the potential to increase their pay up to $220,000.00, which is the top of the range, based on ongoing, demonstrated, and sustained performance in the role.\nStarting pay for this role will vary based on multiple factors, including location, available budget, and an individual’s knowledge, skills, and experience. Pay ranges may be modified in the future.\nExpedia Group is proud to offer a wide range of benefits to support employees and their families, including medical/dental/vision, paid time off, and an Employee Assistance Program. To fuel each employee’s passion for travel, we offer a wellness & travel reimbursement, travel discounts, and an International Airlines Travel Agent (IATAN) membership. View our full list of benefits.\nAccommodation requests\nIf you need assistance with any part of the application or recruiting process due to a disability, or other physical or mental health conditions, please reach out to our Recruiting Accommodations Team through the Accommodation Request.\nWe are proud to be named as a Best Place to Work on Glassdoor in 2024 and be recognized for award-winning culture by organizations like Forbes, TIME, Disability:IN, and others.\nExpedia Group's family of brands includes: Brand Expedia®, Hotels.com®, Expedia® Partner Solutions, Vrbo®, trivago®, Orbitz®, Travelocity®, Hotwire®, Wotif®, ebookers®, CheapTickets®, Expedia Group™ Media Solutions, Expedia Local Expert®, CarRentals.com™, and Expedia Cruises™. © 2024 Expedia, Inc. All rights reserved. Trademarks and logos are the property of their respective owners. CST: 2029030-50\nEmployment opportunities and job offers at Expedia Group will always come from Expedia Group’s Talent Acquisition and hiring teams. Never provide sensitive, personal information to someone unless you’re confident who the recipient is. Expedia Group does not extend job offers via email or any other messaging tools to individuals with whom we have not made prior contact. Our email domain is @expediagroup.com. The official website to find and apply for job openings at Expedia Group is careers.expediagroup.com/jobs.\nExpedia is committed to creating an inclusive work environment with a diverse workforce. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. This employer participates in E-Verify. The employer will provide the Social Security Administration (SSA) and, if necessary, the Department of Homeland Security (DHS) with information from each new employee's I-9 to confirm work authorization."
  },
  {
    "title": "",
    "company": "",
    "location": "",
    "salary": "",
    "url": "https://www.indeed.com/viewjob?jk=456789abcdef0123",
    "description": "None"
  }
]