[
  {
    "title": "Machine Learning Engineer",
    "company": "Skild AI",
    "location": "San Mateo, CA",
    "salary": "$100,000 - $300,000 a year",
    "url": "https://www.indeed.com/rc/clk?jk=98bf3f98c18a89d7&bb=eGq16L8opQ76n6wwbbBPJViEMW3D8cR2S-U35-2ZIRcFJIDoqNlJki_uw7QPiulquGT6yU7QkMP_rhWNUKOGPz03DKhHPyrq3bJwfsfseLJ2DW6Tl7OcnoSPsGzsc3GxR9NGb3HfCB_wZxxMHY9GJg%3D%3D&xkcb=SoDq67M3sjCcH_xbtB0MbzkdCdPP&fccid=85f9e141c020f85c&vjs=3",
    "description": "Company Overview\nAt Skild AI, we are building the world's first general purpose robotic intelligence that is robust and adapts to unseen scenarios without failing. We believe massive scale through data-driven machine learning is the key to unlocking these capabilities for the widespread deployment of robots within society. Our team consists of individuals with varying levels of experience and backgrounds, from new graduates to domain experts. Relevant industry experience is important, but ultimately less so than your demonstrated abilities and attitude. We are looking for passionate individuals who are eager to explore uncharted waters and contribute to our innovative projects.\nPosition Overview\nWe are looking for a Machine Learning Engineer to be responsible for designing and implementing cutting-edge reinforcement learning algorithms, conducting experiments, and optimizing these models to perform efficiently in real-world robotic environments. This will require close collaboration with our robotics, research, and engineering team. Your work will directly impact the development of intelligent, adaptable robots capable of learning and performing complex tasks autonomously.\nResponsibilities\nDevelop and implement state-of-the-art reinforcement learning algorithms for robotic applications.\nDesign and conduct experiments to train RL models and conduct real-world tests.\nCollaborate closely with researchers to explore novel methods of scaling up reinforcement learning model training.\nCommunicate effectively with inference, application, and deployment engineers to integrate RL models into robotic systems and iterate on methods to enable robust deployment.\nAnalyze and interpret experimental results, iterating on model design to achieve desired performance.\nStay up-to-date with the latest research and advancements in reinforcement learning.\nPreferred Qualifications\nBS, MS or higher degree in Computer Science, Robotics, Engineering or a related field, or equivalent practical experience.\nProficiency in Python, C++, or similar and at least one deep learning library such as PyTorch, TensorFlow, JAX, etc.\nDeep understanding and practical experience with various reinforcement learning algorithms and techniques (model-free, model-based, multi-task, hierarchical, multi-agent, etc.).\nStrong background in algorithms, data structures, and software engineering principles.\nExperience with physics simulation engines and tools for training RL.\nDeep understanding of state-of-the-art machine learning techniques and models.\nExtensive industry experience with reinforcement learning and robotic systems."
  },
  {
    "title": "AI/ML Engineer",
    "company": "General Motors",
    "location": "Hybrid work in San Francisco, CA",
    "salary": "$118,000 - $188,400 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0BqJjBsvJkVIRVupdyx-l7jJlkPL5nU6SVET5Mq4mDejegpz4R4z9X6QNcQ1GgqKr52FoFZAej3CEuCsw3--cnmn9yQP4-jK0Jyhs1a-lYOWKIFYtUOf_NpTp3XEpnLezfugqZX1TPdIKGvbcAa0FN8Y9tapjzTjRMoEywrZePVqJT_utA5nXfhQlkZJyJ3cixLWQ0PjMP_mMqMjL9TBcdDaR6z17rytb5V_yghw6z-x_uSy_HqFJHQvfsoEtQbrvKV5ASlVryZC1ZYkwQRfZ9HJXSXliWgz2mzQC9qDihlJZeUrF6DRi2_GgpM3b7tWfj-CkAOLOrzLGy1TJp0i6cmv7qENpq2gP4lHC9dekbwQThJTpqwP3H_7nPlaF4yzgqa2ghtlzHJDAXMJ_qOm-knJ5-Gy-EzvC2jmx9doYFbehSd80sZ8QKSbx3QHSyO3UjILSqsPuwdb3Ll09bfLXc36vpNuYgqYu5xtMKIFf-bCZgr5TslH-LlNeIrZgVTRDS-DfBfr998ihJHetZyTGxo4GplOtCW6K-yQqrQ9uiAT9NUAgF38ZBJBTuehxWBTk0uJbSgLzr7D3UBzw6EiycBoNkqWSKOIKaGUks6csGF7TcRkBsqqFaSQDuyfylfKF8rTC-U8EnYDA7_6x1oFGMVrEmbcUyehbd1aD3ukIa6rYUmrzYxBh0wgJ9kzR8rXii4zgVjMucRvCeeWAyl3KnwnIDP_CLB4Xu0rHAlEt91fsXoo9bWQQ4ZX13BTpAsbRdE4RD_klylu6NU31mbrBgKRA60tN_JI4_RDl9nwCbqPsmOjPFztPXo9iNHekRBHEk=&xkcb=SoDN6_M3sjCcH_xbtB0FbzkdCdPP&camk=nUmJqO2E8rh8JLMt8M-EVQ==&p=12&fvj=0&vjs=3",
    "description": "Job Description\nRole: As a n AI/ML Engineer on the Metrics Frameworks team, part of the Sim ulation, Evaluation, and Data organization, you will be an individual contributor focused on developing and optimizing infrastructure to accelerate autonomous vehicle development, testing, and deployment by creating specialized ana lytics frameworks and tools. We are seeking experienced software engineers to build ana lytical frameworks and tools that empower internal users to construct quantitative ana lysis pipelines and develop metrics. These metrics will support and accelerate feature design, prioritization, and development, as well as evaluate the impact of recently released features. Our ana lytics framework equally supports road event monitoring, data mining and training, and sim ulation metrics.\nAbout the Organization: The Simulation, Evaluation, and Data organization is dedicated to advancing the development of autonomous vehicles through cutting-edge simulation technologies. The Metrics Frameworks team within this organization focuses on creating, maintaining , and evolving the analytics framework that supports GM's goal of safe, high-performing, and scalable driverless technology. The team delivers robust and scalable tools that facilitate data-driven decision-making throughout the AV feature development lifecycle. We collaborate closely with Simulation Evaluation, Embodied AI, and System and Test Engineering teams to enhance productivity across the organization by developing automation tools and shared libraries for all engineering teams. We are accountable for the performance, reliability, and scalability OKRs of the analytics framework. This includes, but is not limited to, developing customized analytics workflows, improving operational telemetry and dashboards to track relevant KPIs for prioritization, and identifying, designing, and implementing solutions to achieve key results.\nWhat You’ll Do:\nCreate tooling that can receive signals from various sources ( Sim ulation, Road, etc ) and allow users to easily build quantitative ana lysis pipelines to extract usable insights.\nAccelerate team’s effectiveness and efficiency by designing and implementing scalable automation tools for test creation, data collection and ana lysis, debugging, and performance monitoring.\nDesign and implement extensible and well-tested shared libraries that will be used by many engineers across the organization.\nCollaborate with other frameworks and data i nfra teams to build and deploy tools to improve productivity.\nWork closely with autonomous vehicle engineering to enable rapid development and model feedback.\nMaintain a high technical standard for code quality on the team, through architectural design and code reviews.\nYour Skills & Abilities:\nExperience developing scalable software solutions that will be used by many developers\nExperience writing Python and C++ in a production environment (unit testing, code review, algorithm performance and tradeoffs, etc.)\nExperience developing automation scripts (Python and Bash scripts)\nBS in Computer Science, Electrical Engineering, Mechanical Engineering, or Aerospace Engineering\n5+ years of industry experience\nStrong organizational and communication skills\nWhat Will Give You A Competitive Edge:\nExperience with SQL and related tools/tech (Big Query, DuckDB , etc )\nExperience with time-series data ana lysis and online performance monitoring tools\nExperience building high performance framework / infrastructure and performance optimization in C++/Python\nFamiliarity with ROS, Pandas, Python bindings for C++, and plotting/visualization libraries\nFamiliarity with Data orchestration and transformation tools like AirTable, AirFlow , DBT, etc\nCompensation : The salary range for this role is ($118,000 and $188,400). The actual base salary a successful candidate will be offered within this range will vary based on factors relevant to the position.\nHybrid: This role is categorized as hybrid. This means the successful candidate is expected to report to the Mountain View, San Francisco, Warren or Milford Technical Center three times per week, at minimum.\n&#xa;&#xa;\nAbout GM\nOur vision is a world with Zero Crashes, Zero Emissions and Zero Congestion and we embrace the responsibility to lead the change that will make our world better, safer and more equitable for all.\nWhy Join Us\nWe believe we all must make a choice every day – individually and collectively – to drive meaningful change through our words, our deeds and our culture. Every day, we want every employee to feel they belong to one General Motors team.\nBenefits Overview\nFrom day one, we're looking out for your well-being–at work and at home–so you can focus on realizing your ambitions. Learn how GM supports a rewarding career that rewards you personally by visiting Total Rewards resources .\nNon-Discrimination and Equal Employment Opportunities (U.S.)\nGeneral Motors is committed to being a workplace that is not only free of unlawful discrimination, but one that genuinely fosters inclusion and belonging. We strongly believe that providing an inclusive workplace creates an environment in which our employees can thrive and develop better products for our customers.\nAll employment decisions are made on a non-discriminatory basis without regard to sex, race, color, national origin, citizenship status, religion, age, disability, pregnancy or maternity status, sexual orientation, gender identity, status as a veteran or protected veteran, or any other similarly protected status in accordance with federal, state and local laws.\nWe encourage interested candidates to review the key responsibilities and qualifications for each role and apply for any positions that match their skills and capabilities. Applicants in the recruitment process may be required, where applicable, to successfully complete a role-related assessment(s) and/or a pre-employment screening prior to beginning employment. To learn more, visit How we Hire .\nAccommodations\nGeneral Motors offers opportunities to all job seekers including individuals with disabilities. If you need a reasonable accommodation to assist with your job search or application for employment, email us or call us at 800-865-7580. In your email, please include a description of the specific accommodation you are requesting as well as the job title and requisition number of the position for which you are applying."
  },
  {
    "title": "MACHINE LEARNING EXPERT",
    "company": "Handshake AI",
    "location": "Remote",
    "salary": "Up to $160 an hour",
    "url": "https://www.indeed.com/rc/clk?jk=55914f1cb74a8b70&bb=eGq16L8opQ76n6wwbbBPJSt5Dru9c2kROfK1N7xsbSd3gJJzveELW_pb1XTPDyaj3AqVNJHMccrcXFWicc6QwnrzG9wRZqUGOQTZ539Q9oNgw1LhH7T66GEW6UAfa-lfdoYw61SkAwbCL_1sUEe_PQ%3D%3D&xkcb=SoDD67M3sjCcH_xbtB0ObzkdCdPP&fccid=20fc6e1718f395db&vjs=3",
    "description": "Up to $160/hr\nDepending on the project\nPh.D's\n,\nPostdocs\nRemote\nPart-time\nFlexible hours\nOverview\nHandshake is recruiting exceptional Machine Learning doctoral graduates and post-docs to join our AI research community. This program brings subject-matter experts together to enhance the capabilities of Large Language Models (LLMs) within specialized domains and subdomains. The Handshake AI Fellowship program runs year-round, though project availability will vary by domain.\nDetails\nThe program runs year-round. Once part of the MOVE program, you will be matched to collaborative projects with labs based on your background and area of expertise.\nProject work includes developing and answering Machine Learning prompts and evaluating responses from Large Language Models for accuracy.\nThe position is remote and asynchronous - work independently from wherever you are.\nFlexible hours, ranging from 10 to 15 hours per week.\nLearn new skills while contributing to the changing world of AI across various disciplines.\nPlacement into a project will be dependent on project availability.\nQualifications\nPhD graduates, postdoctoral researchers, and in PhD in progress students specializing in machine learning\nAble to participate in primarily asynchronous work in partnership with leading AI labs.\nBelieve your expertise can outmatch current AI systems in understanding and explaining key concepts in your field.\nThis program is open to U.S.-based doctoral students, candidates, and recent graduates with valid work or training authorization (e.g., F-1/OPT, J-1, H-1B).* Participants are responsible for ensuring compliance with their visa conditions and confirming eligibility with their program or visa sponsor prior to applying.\nAt this time, we are unable to accommodate candidates on STEM OPT who require an i-983. Fellows with already approved i-983s, as well as those on pre-grad OPT, CPT, J-1, or H-1B, are not impacted. This position may be subject to change in the future.\nThe application process\n1\nApply and pass a practice task\n2\nGet matched with a project\n3\nChallenge & improve AI models\n4\nBuild with fellows and specialists"
  },
  {
    "title": "Data Scientist - QA Test",
    "company": "IBM",
    "location": "Austin, TX 78716",
    "salary": "Full-time",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0C1ihjj1FYx73_02yGTS96r3SNeUtc-9S9zmnK0ry7bjnQ6Jf2s4KR_7BSE-wQz5x-GUQw7VXD-yufTzgJvXMCacofirUC5DwuQ_hFRilDSdFqaMbX921dHYMDYyZy9u62Ss_ZipDE8gmDTVL8RMubJeLKw_-NZUbnTX115OMkRWJk2aGs-tOlxJ6Yn010eODsbDI5JpDbwy62vuakn9UTt9rJA-uDK6bqhz5QgefJLd-2m_B45V4DDvLHH3GKJO5Y7n7Ons3A3qoNTQhhdLbPOwR6cvmgZUyBXIpyecDbEgFVbqBVVEa3stGvM_kyUsPwSU9D2Rj0hopyYnLq9rZU7sYj69snpQO9_z1Md1rwXB5ABfZ4_j9tBNoslmsip_uPv4680TifEM2jY7bEoKMjGcnFshpUx3ZFWBHO02OzO0p3HWT2473i_QPtFx4wjqDLU9OS15_Dp6JkNYsUX8J0hcpeaa_95At_unnsZx4hRAv2Me0Yyt3_TUxe-UDPMRCLxGWzVhd-QzVm6WR8XbBVj9oT8rGxKyLHd53Ncgcd6WAbLy0Njg1vd9K6Shl1X2RuLVDsxsxZ7X2hA5T43zfvvK-4thvk5fUtXjvUlYEpSLBT1XMIE2y676z7fHsLty6ilc-sGLedAkFjGQOvL5jDi3NDbNYaAZ6A=&xkcb=SoB56_M3sjCcH_xbtB0EbzkdCdPP&camk=UoKtGZLa3XLGJ1QJWibkvA==&p=13&fvj=0&vjs=3",
    "description": "Introduction\n\nA career in IBM Software means you'll be part of a team that transforms our customer's challenges into solutions.\n\nSeeking new possibilities and always staying curious, we are a team dedicated to creating the world's leading AI-powered, cloud-native software solutions for our customers. Our renowned legacy creates endless global opportunities for our IBMers, so the door is always open for those who want to grow their career.\n\nIBM's product and technology landscape includes Research, Software, and Infrastructure. Entering this domain positions you at the heart of IBM, where growth and innovation thrive\n\nYour role and responsibilities\n\nThe Data Scientist role requires a highly analytical individual proficient in Python programming, database management, and data science methodologies. You'll focus on extracting insights from data, developing and implementing machine learning models, managing big data infrastructure, and supporting AI-driven product development.\n\nKey Responsibilities:\n\nData Collection and Cleansing: Collect and cleanse data from diverse sources to ensure high-quality datasets for decision-making.\n\nData Exploration and Visualization: Explore and visualize data using advanced techniques to uncover insights and trends.\n\nStatistical Analysis: Apply statistical and mathematical techniques to provide robust analytical foundations for predictive modeling.\n\nMachine Learning and Deep Learning: Develop and implement machine learning and deep learning models to address business challenges.\n\nML-Ops / AI-Ops: Demonstrate expertise in ML-Ops / AI-Ops practices to ensure efficient model deployment and management.\n\nBig Data Management: Manage big data infrastructure and execute data engineering tasks for efficient data processing.\n\nVersion Control and Collaboration: Utilize version control systems like Git for maintaining codebase integrity and fostering collaboration.\n\nAI-Driven Product Development: Design, create, and support AI-driven products to deliver impactful solutions aligned with user needs and business objectives.\n\nRequired education\n\nHigh School Diploma/GED\n\nPreferred education\n\nBachelor's Degree\n\nRequired technical and professional expertise\n\n\nFundamental education in hardware or test\nStrong communication skills\nPassion to pursue career path in engineering\nGrowth minded, trusted, team focused, courageous, resourceful, and outcome focused\n\n\n\nPreferred technical and professional experience\n\nPursuing a Bachelor's or Master's Degree in: Electrical Engineering, Computer Engineering, Computer Science, Mechanical Engineering, Materials Science, Chemical Engineering, Physics, Optics Engineering, Biomedical Engineering or related majors\n\nABOUT BUSINESS UNIT\n\nIBM Systems helps IT leaders think differently about their infrastructure. IBM servers and storage are no longer inanimate - they can understand, reason, and learn so our clients can innovate while avoiding IT issues. Our systems power the world's most important industries and our clients are the architects of the future. Join us to help build our leading-edge technology portfolio designed for cognitive business and optimized for cloud computing.\n\nYOUR LIFE @ IBM\n\nIn a world where technology never stands still, we understand that, dedication to our clients success, innovation that matters, and trust and personal responsibility in all our relationships, lives in what we do as IBMers as we strive to be the catalyst that makes the world work better.\n\nBeing an IBMer means you'll be able to learn and develop yourself and your career, you'll be encouraged to be courageous and experiment everyday, all whilst having continuous trust and support in an environment where everyone can thrive whatever their personal or professional background.\n\nOur IBMers are growth minded, always staying curious, open to feedback and learning new information and skills to constantly transform themselves and our company. They are trusted to provide on-going feedback to help other IBMers grow, as well as collaborate with colleagues keeping in mind a team focused approach to include different perspectives to drive exceptional outcomes for our customers. The courage our IBMers have to make critical decisions everyday is essential to IBM becoming the catalyst for progress, always embracing challenges with resources they have to hand, a can-do attitude and always striving for an outcome focused approach within everything that they do.\n\nAre you ready to be an IBMer?\n\nABOUT IBM\n\nIBM's greatest invention is the IBMer. We believe that through the application of intelligence, reason and science, we can improve business, society and the human condition, bringing the power of an open hybrid cloud and AI strategy to life for our clients and partners around the world.\n\nRestlessly reinventing since 1911, we are not only one of the largest corporate organizations in the world, we're also one of the biggest technology and consulting employers, with many of the Fortune 500 companies relying on the IBM Cloud to run their business.\n\nAt IBM, we pride ourselves on being an early adopter of artificial intelligence, quantum computing and blockchain. Now it's time for you to join us on our journey to being a responsible technology innovator and a force for good in the world.\n\nIBM is proud to be an equal-opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, gender, gender identity or expression, sexual orientation, national origin, genetics, pregnancy, disability, neurodivergence, age, or other characteristics protected by the applicable law. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.\n\nOTHER RELEVANT JOB DETAILS\n\nSupplemental 1 employees may be eligible for up to 8 paid holidays, minimum of 56 hours paid sick time and the IBM Employee Stock Purchase Plan. IBM offers paid family medical leave and disability benefits to eligible employees where required by applicable law.\nThis position was posted on the date cited in the key job details section and is anticipated to remain posted for 15 days from this date or less if not needed to fill the role.\nWe consider qualified applicants with criminal histories, consistent with applicable law.\n\nIBM will not be providing visa sponsorship for this position now or in the future. Therefore, in order to be considered for this position, you must have the ability to work without a need for current or future visa sponsorship."
  },
  {
    "title": "Machine Learning Engineer",
    "company": "FSS Government Solutions",
    "location": "Woodlawn, MD 21207",
    "salary": "$130,000 - $175,000 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0C8CFb-8zGxOPtkHo2PYJArMiaWqlD2upb9iJrLckFKpvQCLxFSpeOyKyFM6cRorgEycKp5lVApMzd81xvHT_DIUZ_DiBbChlX46HrF6Pnfh9CPuB7eCE-guOz08P8BqRfkn4WunpyJsg7KZyF5sVqD9NYFsVT3ZSKxhQ4FYphcxikUbkVwwcwX8cwvQ4QxWNv1XvAaZ9BtYTd2sjhB7uOu1XV-gXZQKjgxajg3rbrAts092_EhI22rJ8VaVhZH4nIUvEv8TjQ2Fn3CEyT9-vMVxswkRuogYavVj_Eg9cTTnoNhw86CxswSEWpdBQy7Jhlby9dWsaMRKFMD1ir1uRGkDe2OxVHRB5pu8oVyQTaZ3BF3YyD0akp5tHvf71O2Bcg4HwhimSc_8Nc6m1oeuqGkIxWHXxvxkliFokkqUocBMj6oZ-q2DqS5e2UxDHJFTkvELrA401qqpz80LaNycHqgx-4Oeb1zxK1RjEi-LwTGkWjRED9BB3rG7KUF45CIpl6b9uCdVvMz8qodxtKpuTXtmsJge3kULXe_p3-JZypIJ0trbfh6ay4woeR4lZpTH5nxfIFTI8IEOfWVPWxD0jIFTzSgaAOjs4_b3tM0QsazfFQWHgxu6YmaI1IugubY-ZWyLBRanuvVvmim_OKSLjEnkEclR37SeNs=&xkcb=SoDe6_M3sjCcH_xbtB0BbzkdCdPP&camk=UoKtGZLa3XJ3x6B61meRMA==&p=8&fvj=0&vjs=3",
    "description": "We are seeking a skilled ML Engineer with deep expertise in developing, optimizing, and deploying machine learning models, with a focus on healthcare applications. This role will center on creating AI models to analyze clinical data, including structured and unstructured medical records, and integrating human-in-the-loop feedback to enhance model performance. You will work hands-on with large language models (LLMs) and other machine learning techniques, collaborating closely with data engineers, software engineers, and clinical stakeholders to integrate AI solutions into scalable system architectures. The ideal candidate will have experience in healthcare data environments and a strong understanding of the challenges associated with clinical datasets.\nRequired Qualifications & Experience\nMust be located within 50 miles of client headquarters in Woodlawn, MD.\nRequired to work onsite in Woodlawn 5 days per week.\n5+ years of experience in machine learning development with a focus on healthcare or related domains, using frameworks such as TensorFlow, PyTorch, or Scikit-learn.\nExperience developing and optimizing machine learning models for tasks such as predictive modeling, anomaly detection, and classification.\nProficiency in processing structured and unstructured data, using techniques such as feature engineering, data preprocessing, and embeddings (e.g., TF-IDF, Word2Vec, BERT).\nExperience maintaining high-throughput ML models in production environments.\nExpertise in managing dev/test/prod deployment pipelines, with a strong understanding of structuring pipelines for efficient model training and inference.\nProficiency with cloud platforms (AWS, Azure), containerization (Docker), and CI/CD pipelines for machine learning model deployment.\nAdvanced expertise in Python, with experience in libraries such as Transformers, Scikit-learn, Pandas, NumPy, and PyTorch.\nRequires proficiency in query languages such as SQL (PostgreSQL) and NoSQL (MongoDB).\nStrong knowledge of programming concepts and tools, including regular expressions and version control (Git).\nExperience building and fine-tuning LLMs, with an understanding of challenges such as model scalability, compute resource constraints, and bias mitigation.\nExperience deploying machine learning models, including Generative AI, in production environments.\nFamiliarity with hyperparameter tuning and model evaluation in production pipelines.\nUnderstanding of ethical AI principles and their application in sensitive domains like healthcare.\nMaster’s degree in Data Science, Machine Learning, Computer Science, or a related field with 10+ years of experience, or a PhD with 4+ years of experience.\nStrong ability to articulate technical challenges and solutions effectively.\nExcellent written and verbal communication skills.\nKnowledge of Agile development methodologies.\nPreferred Skills\nIdeally, the above experience is in a clinical or healthcare context.\nThe ideal candidate will excel if they have experience working with healthcare data (e.g., electronic health records, lab results, physician notes, imaging reports), familiarity with healthcare data standards and formats (e.g., HL7, FHIR, ICD codes, SNOMED), and exposure to clinical workflows or medical terminologies.\nExperience integrating human-in-the-loop feedback into ML systems, leveraging tools like SciPy or NumPy to improve model accuracy and reliability.\nFamiliarity with advanced machine learning techniques, including deep learning, reinforcement learning, and transformers applied to healthcare data.\nJob Type: Full-time\nPay: $130,000.00 - $175,000.00 per year\nBenefits:\n401(k)\nDental insurance\nFlexible schedule\nHealth insurance\nPaid time off\nTuition reimbursement\nVision insurance\nWork Location: In person"
  },
  {
    "title": "ADVERSARIAL PROMPT EXPERT",
    "company": "Handshake AI",
    "location": "Remote",
    "salary": "Up to $80 an hour",
    "url": "https://www.indeed.com/rc/clk?jk=c7249d3e71aa6879&bb=eGq16L8opQ76n6wwbbBPJZ4EI7hYWUthfSOQ1CBN2j-Wpxjk4iQ8MSf1ecp1pb-xmNTST0A24v38QuduSvau7oN2T-WxLFiDoTom7L6Dz3E7dteLkgMpX-wvH22Mq643H6DUrxt3fbLvxXj0t7o3yA%3D%3D&xkcb=SoBe67M3sjCcH_xbtB0NbzkdCdPP&fccid=20fc6e1718f395db&vjs=3",
    "description": "Up to $80/hr\nDepending on the project\nBachelor's\n,\nMaster's\n,\nPh.D's\n,\nPostdocs\nRemote\nPart-time\nFlexible hours\nOverview\nYou’ll be part of a red teaming project focused on probing large language models for failure modes and harmful outputs. Your work will involve crafting prompts and scenarios to test model guardrails, exploring creative ways to bypass restrictions, and systematically documenting outcomes. You’ll think like an adversary to uncover weaknesses, while collaborating with engineers and safety researchers to share findings and improve system defenses.\n\nDetails\nThe position is remote and asynchronous - work independently from wherever you are.\nFlexible hours and the ability to work remotely, with a commitment of approximately 10 to 20 hours per week.\nProject work includes and is not limited to developing domain-specific prompts and evaluating LLM responses.\nDedicate time researching topics that are interesting to you, with the assistance of AI.\nLearn new skills while contributing to the changing world of AI across various disciplines.\nPlacement into a project will be dependent on project availability.\nQualifications\nHeavy LLM Usage — hands-on experience with multiple models (open- and closed-source), comfort experimenting across systems.\nPrompt Engineering & Jailbreaking — skill in crafting prompts, evasion techniques, and creative ways to bypass restrictions.\nAdversarial / Security Mindset — ability to think like an attacker, with bonus points for any red teaming or offensive security background.\nPersistence & Creativity — willingness to try many variations, think outside the box, and push edge cases.\nClear Documentation — ability to log attempts and outcomes systematically, and communicate issues clearly.\nEthical Awareness — understands boundaries and handles sensitive content responsibly.This program is open to U.S.-based students, candidates, and recent graduates with US work authorization.\nThis program is open to U.S.-based doctoral students, candidates, and recent graduates with valid work or training authorization (e.g., F-1/OPT, J-1, H-1B).* Participants are responsible for ensuring compliance with their visa conditions and confirming eligibility with their program or visa sponsor prior to applying.\nAt this time, we are unable to accommodate candidates on STEM OPT who require an i-983. Fellows with already approved i-983s, as well as those on pre-grad OPT, CPT, J-1, or H-1B, are not impacted. This position may be subject to change in the future.\nThe application process\n1\nApply and pass a practice task\n2\nGet matched with a project\n3\nChallenge & improve AI models\n4\nBuild with fellows and specialists"
  },
  {
    "title": "Machine Learning Engineer",
    "company": "QuinStreet",
    "location": "Remote",
    "salary": "$140,000 - $170,000 a year",
    "url": "https://www.indeed.com/rc/clk?jk=48d33cf490158f04&bb=eGq16L8opQ76n6wwbbBPJdHjW0ihfitnfwIiiElg-GYxYqyi7guQCYJwHjDJ3C0HvHaUfJwhpBKWz5218olzyVwXKiVnZJpBhPs2O-mpNBRGcXOrzPb-uFCbhSKZIqy5d1EIvyoW3UJu5j77LwSBaQ%3D%3D&xkcb=SoD567M3sjCcH_xbtB0IbzkdCdPP&fccid=887caf99ec3af58f&vjs=3",
    "description": "Powering Performance Marketplaces in Digital Media\nQuinStreet is a pioneer in powering decentralized online marketplaces that match searchers and \"research and compare\" consumers with brands. We run these virtual- and private-label marketplaces in one of the nation's largest media networks.\nOur industry leading segmentation and AI-driven matching technologies help consumers find better solutions and brands faster. They allow brands to target and reach in-market customer prospects with pinpoint segment-by-segment accuracy, and to pay only for performance results.\nOur campaign-results-driven matching decision engines and optimization algorithms are built from over 20 years and billions of dollars of online media experience.\nWe believe in:\nThe direct measurability of digital media.\nPerformance marketing. (We pioneered it.)\nThe advantages of technology.\nWe bring all this together to deliver truly great results for consumers and brands in the world's biggest channel.\n\nJob Category\nWe're looking for an extremely smart Algorithms Engineer to become a core member of the team that creates algorithms for pricing, targeting, demand fulfillment, and fraud detection in our marketing platform.\n\nResponsibilities\nUse your expertise in machine learning and statistical learning techniques such as classification and regression to produce models applicable to pricing and targeting.\nApply mathematical optimization techniques to solve network problems.\nExperiment and build models that improve the capabilities of our marketing platform and allow for increases in yield.\nWork with our Engineering and Business teams to implement scalable, reliable and useful solutions for our various business units.\nRun numerous experiments in a fast-paced, analytical culture so you can quickly learn and adapt your work.\nGet the satisfaction of knowing that you helped connect millions of visitors to our affiliates and internal properties to the products and services they are searching for.\nRequirements\n2+ years' experience in software development\nMS in Computer Science or related area, or relevant work experience\nDeep experience in applied machine learning, statistical learning, mathematical optimization and scalable computing\nExperience with both supervised and unsupervised learning on large datasets\nSucceed as an individual but to collaborate and strive for the success of your team\nStrong sense of ownership in everything you build\nStrong experience building production level code (Python is a plus)\nThe expected salary range for this position is $140,000 USD to $170,000 USD annually. This salary range is an estimate, and the actual salary may vary based on the Company's compensation practices. The salary may be adjusted based on applicant's geographic location. The position is also eligible to receive performance bonus or commission and equity in the form of restricted stock units. This position is eligible to participate in the Company's standard employee benefits programs, which currently include health care benefits; (2) retirement benefits; (3) the amount of paid days off (paid sick leave, parental leave, paid time off, or vacation benefits); (4) any other tax-reportable benefits.\n#LI-REMOTE\n\nQuinStreet is an equal opportunity employer. We do not discriminate on the basis of race, color, religion, national origin, pregnancy status, sex, age, marital status, disability, sexual orientation, gender identity or any other characteristics protected by law.\nPlease see QuinStreet's Employee Privacy Notice here."
  },
  {
    "title": "Human-Centered Design (HCD) Specialist",
    "company": "Tanaq Technical Services",
    "location": "Hybrid work in Washington, DC",
    "salary": "$100,000 - $125,000 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0Arn5gTsIZf8qnd7YBTCbSQj5St6QbsTNY3c7iqQPfP-DKhiUubksIbhLdBteaon2zFj4Mhbcm7uksH_ICgu35tvJ1pHIZZuFeQ2yMPcxh193H-hN53UV0qMsVUkw9ulfEG4L9Oq_ZzUVnTbtn7Be46aMwx15QnGNxe2bEvjr6mlCHa6kH7JKSgC8QcS7W1EjD6Sl7w-dyF1rmiFOEIm8lPH6Zh83HfnNrPv9_lWuOhQEJXHEIg0aVhZDERfOANcyKjToEpKol0h7-CLC0zrGZjjSQ28ds0HXmaf_MykTH8_on_q8A1dhCngZuA_4-vpCpq-eJKfgb3DyhnTpvoH3-DIOX4PBLbcvVWi9bb6sFno0Jfc1yn2c_rkqvsTilp5aBdd5Q92um8Nw24Zqar1GdliCEFBvGdBzZFXRxo2Hs37OzMSgOel3snvkx1VgfxfR3ZMSRVd8wAutj-9CXpQexw0AAZO36jbKAikzkQmjz44HIk5oQuKdjLofkMzIwxu3IcrOn3yinNTIfTI9lODkqXSBOn48tB77rE-vhb0vZpyxzOqDwRb-b-iQfE215BCXYnlGPt_xvpXqC2FAeCR1ZwPabJBx2Ky1794bo8tkT50DfLOsla8rPn7i4IV1dTmgJFBADrcrYzXCx04DFjDsAkFXT0fLjBtNewdbH9vyqwjgMu_OlhNJWVPNJ6CdLJWdQTIZJRZJkL0LPHQ-RNQhxamQbZIvWN9MwcwVhlQhGe3tyfSmaDj3j0jWbMI51nHp-cqn9MFJqqew==&xkcb=SoBD6_M3sjCcH_xbtB0CbzkdCdPP&camk=UoKtGZLa3XLhmdrZHNclVg==&p=7&fvj=0&vjs=3",
    "description": "Description:\nOverview\nTanaq Technical Services (TTS), a division of St. George Tanaq (SGT) Corporation, is an 8(a) Alaskan Native Small Business that specializes in delivering Enterprise Integrated Technology Solutions and Support Services to the Federal Government. TTS’s innovative approach combines proactive strategies, efficient processes and emerging technologies to deliver seamless, integrated services for our clients. TTS prides itself in being Mission Driven, People Focused. To learn more about us, visit https://tanaq.com/tanaq-technical-services.\nAbout the Role\nWe are seeking a Human-Centered Design (HCD) Specialist to support HUD’s Application Development Programming Services (ADPS) program by conducting research and analysis to ensure AI modernization solutions are designed around the needs of HUD stakeholders, citizens, and mission users.\nThis role emphasizes user research, design thinking support, and customer experience (CX) validation to help ensure that AI-enabled systems are ethical, accessible, and aligned with HUD’s mission. The HCD Analyst will work closely with senior designers, data scientists, developers, and program leadership to translate user insights into actionable inputs for proofs of concept (PoCs) and pilots.\nThis is a hybrid remote position based in Washington, D.C. that will require some onsite work at the customer’s locations. An estimated 25% annual travel within the U.S. will be required.\nResponsibilities\nSupport user research activities, including stakeholder interviews, surveys, usability studies, journey mapping, and service blueprinting.\nAssist in developing personas, user stories, and experience maps that inform system and interface design.\nContribute to design thinking workshops by capturing insights, refining requirements, and documenting outcomes.\nPartner with UX, UI, and development teams to ensure user insights are reflected in 508-compliant digital interfaces.\nDevelop and maintain HCD artifacts (personas, journey maps, wireframes, service design documentation).\nSupport CX validation efforts, including survey design, data collection, and basic analysis to measure the impact of AI-enabled capabilities.\nDocument and maintain HCD-related artifacts in HUD’s repositories to support transparency, compliance, and knowledge sharing.\nAssist in preparing presentations, demos, FAQs, and communication materials that summarize design insights for HUD leadership and stakeholders.\nRequirements:\nRequired Experience and Skills\n2 or more years of experience applying Human-Centered Design in IT modernization, digital transformation, or AI/ML projects.\nExperience conducting user research and usability testing in multi-stakeholder environments.\nFamiliarity with federal IT programs or regulated industries preferred.\nExposure to AI/ML solution design or experience addressing explainability, bias, or user trust challenges is preferred.\nPrevious experience supporting HUD OCIO preferred.\nAbility to pass required Federal background screening and obtain and maintain both government clearance and customer approval.\nMust be legally authorized to work in the United States without the need for employer sponsorship, now or at any time in the future.\nTechnical Skills\nProficiency with design and prototyping tools (Figma, Adobe XD, Sketch, Miro, InVision).\nKnowledge of user research methods (interviews, surveys, contextual inquiry, usability testing).\nFamiliarity with journey mapping, persona development, and service design methods.\nUnderstanding of Section 508 accessibility standards.\nAbility to translate technical or AI concepts into intuitive, user-friendly artifacts.\nCore Competencies\nDetail-oriented and analytical mindset with strong problem-solving skills.\nStrong written and verbal communication skills, including documentation.\nCollaborative team player able to support UX, AI/ML, DevOps, and program staff.\nCommitment to inclusivity, ethical design, and accessibility.\nFlexibility to adapt in Agile, fast-paced environments with multiple concurrent initiatives.\nEducation and Training\nBachelor’s degree in Human-Centered Design, Service Design, Psychology, Human Factors, Human-Computer Interaction (HCI), Information Science, or related field.\nCertifications in Design Thinking, UX, or CX methodologies preferred.\nMaster’s degree in Data Science, AI, or related field preferred.\nPython, machine learning, or data science certifications preferred\nPhysical Requirements\nCandidates must reside in or within daily commuting distance of Washington, D.C.\nMust be willing and able to travel an estimated 25% of time within the U.S.\nProlonged periods of sitting at a desk and working on a computer. May need to lift up to 25 pounds occasionally.\nPay Range\nThe projected annual salary range for this position is $100,000 – $125,000 USD. Please note that the salary information listed is a good faith estimate for this position and a general guideline only. Multiple factors are considered in determining final pay for a position, including, but not limited to, the candidate’s relevant work experience, skills, education, certifications, and competencies that align with the specified role, geographic location, as well as business considerations and contract provisions regarding labor categories that are specific to the position.\nBenefits Information\nBenefits offered may vary depending on the nature of your employment with Tanaq. Full-time US-based employees gain access to healthcare benefits (Medical, Dental, Vision), Basic Life Insurance, Short-Term Disability, Long-Term Disability, 401(k), Flexible Spending Account, EAP, Education Reimbursement, Paid Time Off and Holidays.\nWho We Are\nTanaq Technical Services (TTS) strives to deeply understand and analyze our clients’ vision, needs, and requirements so we may provide alternative solutions, empowering them to choose the best resolution. We aim to achieve excellence by delivering on our commitments to our clients, employees, and partners.\nOur Commitment to Non-Discrimination\nTanaq Technical Services is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to disability, status as a protected veteran or any other status protected by applicable federal, state, or local law. Tanaq complies with the Drug-free Workplace Act of 1988 and E-Verify.\nIf you are an individual with a disability and need assistance completing any part of the application process, please email accommodation@tanaq.com to request a reasonable accommodation. This email is for accommodation requests only and cannot be used to inquire about the status of applications.\nNotice on Candidate AI Usage\nTanaq is committed to ensuring a fair and competitive interview process for all candidates based on their experience, skills and education. To ensure the integrity of the interview process, the use of artificial intelligence (AI) tools to generate or assist with responses during phone, in person and virtual interviews is not allowed. However, candidates who require a reasonable accommodation that may involve AI are required to contact us prior to their interview at accommodation@tanaq.com.\nTo apply for this and other positions with our company, visit:\nhttps://recruiting.paylocity.com/recruiting/jobs/All/31dd0607-5fe1-43cc-a916-35084f250a54/Tanaq-Technical-Services-LLC"
  },
  {
    "title": "Data Scientist (AI / ML Focus)",
    "company": "Tanaq Technical Services",
    "location": "Hybrid work in Washington, DC",
    "salary": "$122,900 - $140,000 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0Arn5gTsIZf8qnd7YBTCbSQj5St6QbsTNY3c7iqQPfP-DKhiUubksIb-5MDT6SAGl-w0SJt-s9yYFT2j3d7AMIZGajf7G_lQ3ezbDdx6eXhwNp90wH0PqPwzlrrmxRtw-Ndw5ao696ISyCEUJGEObmG-2ZqPNsZbe-EaUvAU9NFPUUPLUlNTt6FWT_RIW99GSTMgrNymOsaK2U6zd-El_iRBQ31B6h7TuWE47qGuZhyGt_JLPH8d4KHs6_MIuCgnK_kZP4RGRHgzACHhjz2r0jf59G_pN7BZ7dkw1P0u2wrOVuU8E-KROh27s9_7X6xzlI2VzLOSOV8bkV4rwE-wdGU2riSFYAXEGml-hjazU_yuiwKAA5M8humhlHOboTLLkyswhaRQM8FpEI1To8keTFm5O8fAKnzWKSBPIooDfraergcImR20V42aAmIntLmFC4qYFX_KYvJtuRbfDaX7sJvkRsV5cugHbUrBixEZk8i1vMYZgTcmJ22FalEEfMplEh6YR7w1qGjb1ug0rlPoiCi6Xny_kQv7P-AR9aetKoQX5YZgT07Ffcqq7cVw1OAalmcf2-twt9Chv1eHjxQjpvXEsvccUk60wMJ0KaQTVCkLFtLAKZox2Gn42PJZV5pjVmTkCQXd-t9j1Bh_9A1YReNQH-BzPGwCsX1VpgL4_k5gFKX5YUFc01NBT4dX5H9aG4bJduApU5BrmHy8ALMGle_ml22JVo17WCiKD9Pjez4XHhVZHshfXmStBmh5-jAezY=&xkcb=SoDk6_M3sjCcH_xbtB0HbzkdCdPP&camk=UoKtGZLa3XLvQk9KtYNmtw==&p=10&fvj=0&vjs=3",
    "description": "Description:\nOverview\nTanaq Technical Services (TTS), a division of St. George Tanaq (SGT) Corporation, is an 8(a) Alaskan Native Small Business that specializes in delivering Enterprise Integrated Technology Solutions and Support Services to the Federal Government. TTS’s innovative approach combines proactive strategies, efficient processes and emerging technologies to deliver seamless, integrated services for our clients. TTS prides itself in being Mission Driven, People Focused. To learn more about us, visit https://tanaq.com/tanaq-technical-services.\nAbout the Role\nWe are seeking a Data Scientist to support the Department of Housing and Urban Development’s Office of the Chief Information Officer (HUD OCIO). The Data Scientist will analyze, model, and simulate data supporting HUD AI/ML proofs of concept and pilots. Additionally, the Data Scientist will develop predictive models, simulations, and decision-theory frameworks to enhance system functionality, operational efficiency, and mission alignment.\nThis is a hybrid remote position based in Washington, D.C. that will require some onsite work at the customer’s locations. An estimated 25% annual travel within the U.S. will be required.\nResponsibilities\nDevelop statistical models, machine learning algorithms, and simulations using Python.\nAnalyze HUD datasets, implement data preprocessing, and assess data quality for AI workflows.\nCollaborate with HCD/UX and front-end teams to ensure models are operationalized effectively.\nEvaluate model performance, validate results, and iterate for improvement.\nSupport AI governance by documenting models, decisions, assumptions, and ethical safeguards.\nMaintain version-controlled code and reproducible workflows for HUD audit and compliance.\nRequirements:\nRequired Experience and Skills\n5+ years of experience in data science, statistical modeling, or AI/ML projects.\nExperience developing predictive models, simulations, and decision-support tools.\nFamiliarity with federal datasets and AI governance requirements preferred.\nStrong Data processing, cleaning, transformation, and engineering capabilities.\nFederal-scale datasets, such as SQL, NoSQL, Spark, Kafka, or cloud-native pipelines.\nPrevious experience supporting HUD OCIO preferred.\nAbility to pass required Federal background screening and obtain and maintain both government clearance and customer approval.\nMust be legally authorized to work in the United States without the need for employer sponsorship, now or at any time in the future.\nTechnical Skills\nPython (pandas, NumPy, scikit-learn, TensorFlow/PyTorch)\nStatistical modeling, simulation, and decision theory\nData visualization: Matplotlib, Seaborn, Plotly\nVersion control: Git/GitHub/GitLab\nExperience with AI/ML lifecycle and reproducible workflows\nCore Competencies\nAn analytical and problem-solving mindset\nCollaboration with UX, DevOps, and front-end teams\nDocumentation and knowledge transfer for governance compliance\nIterative testing and validation of AI-enabled solutions\nEthical and privacy-conscious model design\nEducation and Training\nBachelor’s degree in Statistics, Data Science, Mathematics, Computer Science, or related field (required)\nMaster’s degree in Data Science, AI, or related field (preferred)\nPython, machine learning, or data science certifications preferred\nPhysical Requirements\nCandidates must reside in or within daily commuting distance of Washington, D.C.\nMust be willing and able to travel an estimated 25% of time within the U.S.\nProlonged periods of sitting at a desk and working on a computer. May need to lift up to 25 pounds occasionally.\nPay Range\nThe projected annual salary range for this position is $122,900 – $140,000 USD. Please note that the salary information listed is a good-faith estimate for this position and a general guideline only. Multiple factors are considered in determining final pay for a position, including, but not limited to, the candidate’s relevant work experience, skills, education, certifications, and competencies that align with the specified role, geographic location, as well as business considerations and contract provisions regarding labor categories that are specific to the position.\nBenefits Information\nBenefits offered may vary depending on the nature of your employment with Tanaq. Full-time US-based employees gain access to healthcare benefits (Medical, Dental, Vision), Basic Life Insurance, Short-Term Disability, Long-Term Disability, 401(k), Flexible Spending Account, EAP, Education Reimbursement, Paid Time Off and Holidays.\nWho We Are\nTanaq Technical Services (TTS) strives to deeply understand and analyze our clients’ vision, needs, and requirements so we may provide alternative solutions, empowering them to choose the best resolution. We aim to achieve excellence by delivering on our commitments to our clients, employees, and partners.\nOur Commitment to Non-Discrimination\nTanaq Technical Services is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to disability, status as a protected veteran or any other status protected by applicable federal, state, or local law. Tanaq complies with the Drug-free Workplace Act of 1988 and E-Verify.\nIf you are an individual with a disability and need assistance completing any part of the application process, please email accommodation@tanaq.com to request a reasonable accommodation. This email is for accommodation requests only and cannot be used to inquire about the status of applications.\nNotice on Candidate AI Usage\nTanaq is committed to ensuring a fair and competitive interview process for all candidates based on their experience, skills and education. To ensure the integrity of the interview process, the use of artificial intelligence (AI) tools to generate or assist with responses during phone, in person and virtual interviews is not allowed. However, candidates who require a reasonable accommodation that may involve AI are required to contact us prior to their interview at accommodation@tanaq.com.\nTo apply for this and other positions with our company, visit:\nhttps://recruiting.paylocity.com/recruiting/jobs/All/31dd0607-5fe1-43cc-a916-35084f250a54/Tanaq-Technical-Services-LLC"
  },
  {
    "title": "AI-Enabled Early Operational Strategy Leader",
    "company": "Sanofi",
    "location": "Cambridge, MA 02238 \n(Mid-Cambridge area)",
    "salary": "$172,500.00 - $249,166.66 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0C0xan_tKoKpHlPk2i4OCCo2ULsOmeqWWaTHcPP_CkOCZjUBRCmxlFYrfLLfDJ54Md8qQcG8FkKYj41tumq-B8h7hrL3eRD-ZFAPXTy4CoDQGcShbxGAUx5XqwJqBWKN7TQlnksjtxCo-VCceF-ByybAtxc-_qV6NEWjy3OMxDDNWmJBFDs5xQex4NG6oZUjbQzVm5LMTJlL40y6pq5BlEM7TUA7o3OjVu8miR45RHaaxY71Lh0UgPelaaoCr0LL6HRMe5_ovAh-qJ61-6WUvkSs9RxLr9ge63UCj8fpSWtp-Q0CQKEBmB3Uabbcz2vAbtlOBZSNGccth1DrWF7a7beUnfIUbgDSVPq0PUkl1SqBapbaW4jznHbL57gkvxawWVc7Y628rfWqaKlHqO7hWA-GGT6nq3XtE5-HLUBHtkWsRGWOVnV5mECxgRazuZuxEDv4Xckg51GcHOYj6ndKnQs1cH-3Lizq5RxAf-ZgIzNhtyepHWnDZPkKC3f2Ksl0jg7M2OfWzv1OAdu27HqqvEkl6-erjl9ude8j22BpvzLkVsc1zGYc05Ng-ea7sqziA_6ROY4kjatkH3exw-bRryhmuiECEF6ItQTOFvRvcG3BRmmVmqf-ee9Ytd9wASJjxJSX8hntOwVlr_PN3FMPOe_qrwOd024Rvje02D5e_0NJIKlAAjXqnCz1zGssud0ylbg3udFKSYR9XuaHmYqNpXt7T5DFTowkEMeHHbV9K-KSTP7PGL9fUfkGboKQgiSyHTJsBUfRNIuyGodvdsHF-Eeeil4649c4F4KsSbOeJihTwrcXsTPq05I&xkcb=SoD36_M3sjCcH_xbtB0DbzkdCdPP&camk=ethIe0s0hedPb98J5kRevA==&p=6&fvj=0&vjs=3",
    "description": "Job Title: AI-Enabled Early Operational Strategy Leader\nLocation: Cambridge, MA Morristown, NJ\nAbout the Job\nAre you ready to shape the future of medicine? The race is on to speed up drug discovery and development to find answers for patients and their families. Your skills could be critical in helping our teams accelerate progress.\nWe are at the forefront of digital transformation in clinical operations, leveraging cutting-edge AI technologies to revolutionize how we prepare and execute clinical studies. Our team is passionate about using data-driven approaches to accelerate drug development and ultimately improve patient outcomes. We work in a collaborative, innovative environment where your AI expertise will directly impact the efficiency and success of our clinical trials.\nWe are seeking an initiative-taking and experienced AI-Enabled Early Operations Strategy Leader to support the digital transformation of preparation for clinical studies. This role will be pivotal in driving innovation and efficiency in our processes for providing tailored operational insights and strategies.\nThe ideal candidate will possess a deep understanding of current digital technologies and innovations as well as direct experience implementing these related roadmaps, including experience in methodology to assess business case, go-no go stage gates, and ROI. The incumbent must have strong leadership and change management skills, and a passion for delivering transformative approaches for our patients.\nWe are an innovative global healthcare company with one purpose: to chase the miracles of science to improve people’s lives. We’re also a company where you can flourish and grow your career, with countless opportunities to explore, make connections with people, and stretch the limits of what you thought was possible. Ready to get started?\n\nMain Responsibilities:\nInfluences and leads critical elements of the digital transformation of early operations strategy.\nLeads the development of AI-powered prescriptive models that not only identify what will happen but determine the optimal course of action to achieve desired outcomes, significantly enhancing operational efficiency and strategic planning capabilities.\nRotates through the roles within the Early Operations Strategy organization to identify and rapidly propose and deploy solutions to transform our clinical trial preparation activities globally.\nThis person will serve as a catalyst for digital change within the organization and offer expert perspectives on potential solutions and changes for ways of working.\nThrough the early generation of operational insights to support indication-level and study-level planning, organizing and execution of clinical studies, this person will assess firsthand areas for change.\nDevelop a transformation plan to solve shared challenges or develop / propose digital solutions.\nTransform Early Operations Strategy for increased efficiency, modernization, and acceleration to support our future ambitions.\nContribute to Sanofi’s commitment to accelerate the development of new drugs for all patients through our clinical trials.\nLead the identification and implementation of AI-powered solutions to transform early operations strategy.\nDrive digital innovation by assessing business cases, establishing go/no-go criteria, and measuring ROI for AI initiatives.\nCoordinate data-driven feasibility activities including eHealth records analyses, site identification, and enrolment modelling.\nDevelop and support the implementation of AI solutions that enhance the accuracy, efficiency, and quality of our clinical trial planning.\nCollaborate with cross-functional teams to integrate AI technologies into operational workflows.\nEvaluate and select AI vendors, managing relationships and overseeing implementation.\nPresent data-driven insights to study teams and leadership to inform strategic decision-making.\nStay current with emerging AI technologies and industry trends, identifying opportunities for application.\nLead and oversee the strategic management of indications, programs, and/or studies, ensuring alignment with organizational goals.\nFoster a culture of continuous improvement and digital adoption across the organization.\nAbout You\nEducation:\nMaster’s Degree in relevant field or equivalent combination of education and experience.\nAt least 3 years of experience with identification and implementation of AI-enabled solutions in the pharmaceutical or healthcare industries.\n\nExperience:\nExperience in the conduct of clinical trials or related experience is highly valued.\nStrong English communication skills (verbal and written).\nProven track record implementing AI/ML solutions in clinical development or healthcare settings.\nExperience building business cases and measuring ROI for digital transformation initiatives.\nDemonstrated success in leading change management for technology implementations.\nTechnical skills:\nStrong understanding of AI/ML technologies and their practical applications in pharmaceutical clinical operations.\nData science expertise with ability to translate complex analyses into actionable insights.\nProficiency with digital tools for data visualization and communication.\nKnowledge of clinical development processes and regulatory considerations.\nSoft skills:\nStrategic thinking with ability to identify opportunities for digital innovation.\nExceptional communication skills to explain technical concepts to diverse stakeholders.\nCollaborative leadership style that inspires teams to embrace new technologies.\nProblem-solving mindset with focus on practical, impactful solutions.\nAdaptability to navigate evolving technologies and changing business needs.\nDemonstrates strong emotional intelligence by skilfully navigating interpersonal relationships, adapting communication style to different audiences, resolving conflicts constructively, and fostering a positive team environment.\nSkilled at mobilizing diverse stakeholders toward common goals by establishing trust, articulating compelling visions, and creating mutual value in matrix environments where formal authority is limited.\nCore knowledge, competencies & skills:\nDigital: Advanced\nLeadership skills: Intermediate\nRisk Management skills: Intermediate\nProject Management skills: Intermediate\nScientific Background: Intermediate\nBusiness Acumen: Advanced\nClinical Development Knowledge: Intermediate\nProblem Solving skills: Advanced\nChange Management skills: Advanced\nEmotional Intelligence: Advanced\nVendor Management skills: Intermediate\nWhy Choose Us?\nBring the miracles of science to life alongside a supportive, future-focused team.\nDiscover endless opportunities to grow your talent and drive your career, whether it’s through a promotion or lateral move, at home or internationally.\nEnjoy a thoughtful, well-crafted rewards package that recognizes your contribution and amplifies your impact.\nTake good care of yourself and your family, with a wide range of health and wellbeing benefits including high-quality healthcare, prevention and wellness programs and at least 14 weeks’ gender-neutral parental leave.\nSanofi Inc. and its U.S. affiliates are Equal Opportunity and Affirmative Action employers committed to a culturally diverse workforce. All qualified applicants will receive consideration for employment without regard to race; color; creed; religion; national origin; age; ancestry; nationality; marital, domestic partnership or civil union status; sex, gender, gender identity or expression; affectional or sexual orientation; disability; veteran or military status or liability for military status; domestic violence victim status; atypical cellular or blood trait; genetic information (including the refusal to submit to genetic testing) or any other characteristic protected by law.\n#GD-SA\n#LI-SA\n#LI-Onsite\n#vhd\nAll compensation will be determined commensurate with demonstrated experience. Employees may be eligible to participate in Company employee benefit programs, and additional benefits information can be found here."
  },
  {
    "title": "Machine Learning Engineer",
    "company": "NIKE",
    "location": "Remote in Beaverton, OR 97005",
    "salary": "",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0CLAFIAocNJ4Wfrhm82ciahvtobYpoaf72Vrs-CtZeLT_ILOwoZihKlzfNjHCtQsEquSoV9QjzJQkHXQ8XJSdsfQzmvB1CPiJwEuq69rPs3dAIH33648XXevf8RizlXrt738_tHfXRsnDmISC2gzRNMwL1k7Ag-jCE5pyWkObEXu_WxMxUDt2UhVbAsRPsP3CZjD6g1ZuRx7nqw66Uo0Vis6tP7sBsXR5Z1dps3NcDGuPu4nBgekGOq-pTjxMo_zCUL8drGVqYuG02NCJH-eQpxREDAYZKxmq46_bNdKut_IiCL1fMBAW0v9oZoK8wMji1gPydXaKQWtiDtVjZ2QGv6KiTAeC87SNzf43aAbeAeCOEEOA_QARFVQZOulp4NrS_UmTX-eD_heb8-6ODrxkHpZJ4Lfhw3flDlap7ocpI6oWwxcbdy3Dg2q48x-JfiVlNesD7Ccl2UQmNzxXCAPvJ-DEMG93p-dWfsB2HxNbUi_C3ZsZfskWtOfGyCpgwtkgkiSuibSPhNuc20cuIER8NYbYUnh_YoyBIVAKsn59KINc2Pog-8ehkQcPce5NAMbNeY6yHVd2Z9yvCPQrIDDNdU10JL_23HySi0Dl5qhHwJIqfrNPVIGP57I6pS8-F481XePjj9L3AQOddheJQbWnwj3urKfhJOtlo=&xkcb=SoBq6_M3sjCcH_xbtB0AbzkdCdPP&camk=UoKtGZLa3XK3McxbXcXWcw==&p=9&fvj=0&vjs=3",
    "description": "Machine Learning Engineer – Nike USA Inc.- Beaverton, OR. Develop robust advanced analytics and machine learning solutions that have a direct impact on the Supply Chain infrastructure; own projects end-to-end - from conception to operationalization, demonstrating an understanding of the full software development lifecycle; provide technical vision and guidance to your teammates; work with the Artificial Intelligence and Machine Learning (AI/ML) team; work to solve machine learning problems at scale; design and implement scalable applications that leverage prediction models and optimization programs to deliver data driven decisions that result in immense business impact; contribute to core advanced analytics and machine learning platforms and tools to enable both prediction and optimization model development; develop and share new skills, mentor, and contribute knowledge and software back to the analytics and engineering communities both within Nike and at-large; and work closely with the global team, along with commercial and consumer analytics, and enterprise architecture teams. Telecommuting is available from anywhere in the U.S., except from SD, VT, and WV\nMust have a Master’s degree in Computer Science and Engineering, Machine Learning, Data Science, Computer Information Systems, and 2 years of experience in the job offered or an Engineering-related occupation. Experience must include:\n\nAgile Software Development\nETL\nGit\nDocker\nREST API\nPython\nAWS\nPandas\nMachine Learning\n\nApply at www.Nike.com/Careers (Job# R-70336)\n#LI-DNI\nWe offer a number of accommodations to complete our interview process including screen readers, sign language interpreters, accessible and single location for in-person interviews, closed captioning, and other reasonable modifications as needed. If you discover, as you navigate our application process, that you need assistance or an accommodation due to a disability, please complete the Candidate Accommodation Request Form."
  },
  {
    "title": "Senior Data Scientist",
    "company": "Combined Computer Resources",
    "location": "Remote",
    "salary": "$60 - $75 an hour",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0BldYzZX3Rc-W91WsmH5NHExfqmo1VnWi5oaah42hwmwEaUVXGz2km4DuRp5CbFy0FkElwwYIJzB8mvICgDG609pGqfq69AKyxhTxElfd7Xf-pipwjJbPKdQcaMpaXswrYvJYveCKkGcBjvVgBPIlZPoEamnDkh2pP-lvdEp4cJj3aVuGC-AopmpiN7GkgfK6O0FQ-9ubFDzRA33g9JS7bDoznkKqN2GGyu-GKv62erL0ZFxNc27wy5YTpl4-gWOsSLbQwFQpcO9FfYu2aCXiK00saYKPJccoV3B9De2i3O-CbidDXxjhcKvSI-ZVCHhj1sM9neqnLwvFJdzktjwB9V3ggae0mK4sYDZFZvt9CPmlI3PHNG4RDUydNqXHjOf2UltkBCZ0lVzrthygLa-CbFevNM8N_CDxN125kXn2WSGdFPmacNSkc1eH9ObyNlxhJ1fLN9gNzAoFGnm3B6775H64Ue9BKlv3WHKcqjc9cs_dfVJRPZBYiHq7H2to4jOF4ulizzfX6yDfc6EQg8oPUP_VNY-se7rXgTPoTERKqvLheIWxDVmJ3EdJT3u2koAypprkotI3XnirRWf-OUDIZPR5J9PSGUWsJbVwNyzjs_SKGvcHj0dqhUCXclgvOf79ifWUz1tCseoRTvBCxMP8cmjgrMzTkuYXQSUkcZuRqrWGUqtQy_z03V&xkcb=SoBe6_M3sjCcH_xbtB0bbzkdCdPP&camk=4HOcmqOLYrBof6KEKnBRng==&p=14&fvj=0&vjs=3",
    "description": "We are seeking a highly capable and versatile Data Scientist with expertise in SQL, Python, AWS, PostgreSQL, Natural Language Processing (NLP) and large language models (LLMs). You’ll be at the forefront of building intelligent systems that interpret and analyze both structured and unstructured data, turning complex outputs into clear, actionable insights for business stakeholders.\nThis role is ideal for someone who thrives at the intersection of data science, engineering, and business strategy with the ability to translate business questions into scalable technical solutions. It is a great fit for someone who enjoys problem-solving under pressure, can adapt quickly to shifting priorities, and has the confidence to work with demanding clients and tight deadlines all while maintaining a calm, collaborative approach and a focus on quality.\nKey Responsibilities:\nDesign and execute complex SQL queries, views and functions for large-scale data analysis and reporting.\nDevelop, fine-tune, and implement NLP and LLM-based solutions, such as document summarization, text classification and semantic search.\nBuild robust data pipelines and AI/ML workflows using Python (Pandas, Scikit-learn, Transformers, etc.).\nLeverage AWS services (e.g., Lambda, SageMaker, S3, Glue) for model training, deployment, and data orchestration.\nWork with PostgreSQL to store, create views, create functions, query, and model structured data efficiently.\nTranslate technical findings into actionable insights for business stakeholders in a clear, concise manner.\nConvert complex business needs into technical designs and machine learning applications, collaborating closely with product, engineering, and business teams.\nMonitor model performance, run A/B tests, and iterate on NLP and LLM models.\nStay updated on the latest developments in NLP, generative AI, and machine learning.\nRequired Qualifications:\n3+ years of experience in a data science, artificial intelligence, machine learning role.\nAdvanced SQL proficiency, including performance tuning and complex joins.\nStrong Python coding skills, with hands-on experience in NLP libraries (e.g., Hugging Face Transformers, spaCy, NLTK).\nDemonstrated experience working with and integrating into LLMs (e.g., OpenAI GPT, Cohere, Claude) and prompt engineering.\nExperience developing and deploying NLP models for tasks such as named entity recognition, sentiment analysis, summarization, or question answering.\nProficiency with AWS cloud services, especially SageMaker, Lambda, Glue, and S3.\nStrong working knowledge of PostgreSQL and relational databases.\nProven ability to translate business goals into technical solutions and present results to non-technical audiences.\nPreferred Qualifications:\nMaster’s in Computer Science, Data Science, Computational Linguistics, or a related field.\nExperience with MLOps and model lifecycle management.\nFamiliarity with orchestration and pipeline tools (e.g., Airflow, MLflow).\nExperience integrating NLP and LLM models into production systems or customer-facing tools.\nStrong data visualization and storytelling skills using tools like Tableau, Power BI, or Plotly.\nJob Type: Contract\nPay: $60.00 - $75.00 per hour\nWork Location: Remote"
  },
  {
    "title": "AI Solution Engineer",
    "company": "CGI Group, Inc.",
    "location": "Hybrid work in Fairfax, VA 22032",
    "salary": "$88,200 - $195,200 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0CmPt6JXytAhZscz-5ZOP53MMQ49Xi4hmwETo1lvmuAlRL2OAxsFRorduI7SZmWktX7AMQKaLgzYs9G5OQ5BV0PTPMVUQehkB7SXFH2ZPUG6aYZ8pIf2qPJ6b4chiqYj7QJmo_VAAfohYC3zHbhlYj3Xc54TnsFOCQm_N0jLYiplM60NezkvFt1akcKboji5jgVPL4YzR82mpMAWI5YjQbbK_s6sXOfhf9HxFqRlvVAVTg9xrANbPJrThvLXQG11faUvie5STxJluYYYv43BQQqz8k8Axjvi4xTCVuhneP8ecWhZWMO5iPIFtoy0gxv3GdKeztC4LGrrxuErCxqk30I-M7u6UkllAlOI5HWkHPdZSrbu9cHn6MVOqgRovDXQFFpmzugv2CWIc5lJA_t1K96h1puaeeZ3y9K5hSWHK5qCL7FNXoAdu-p9rOqT3Cnb4uzTNGWC5U9zSViJ-t_U7txJfgtJS4j5OeuF_6PCM2N4QlmaJIcPMB5UKLIexKcLxYVgiiqB5Hhz6uxc4Hg6waFXNqR-OVKY8yM4PEsl4WuFosXmjmfr8tN0nfXQMfUgG6N8TMiQvzuFJbGGrGXBPtTzPW8-PGTibGwhBJ5hyeQyxXYYTgsGjJIrWrFsehGrkIG0RYvBfGzaOCRUgzjzAZrNOIy1PL7bn0CzAVh0bAs1g==&xkcb=SoBQ6_M3sjCcH_xbtB0GbzkdCdPP&camk=4HOcmqOLYrD3MDZWBKj-EA==&p=11&fvj=0&vjs=3",
    "description": "Position Description:\nCGI is seeking an AI Solution Engineer who can bridge the gap between AI technology and real-world business challenges. In this role, you will work closely with cross-functional teams to identify high-value use cases and design, prototype, and deliver end-to-end AI solutions that directly address those needs using CGI Pulse AI platform. You must be both technically skilled and business-savvy to translate complex problems into scalable AI-driven products or tools.\n\nThis is a full-time hybrid position, requiring on-site presence at your nearest CGI office two to three days per week.\nYour future duties and responsibilities:\nDesign and develop AI-powered pipelines to process and extract information from documents including PDFs, scanned images, and digital text.\nApply OCR (e.g. Azure Form Recognizer, Google Document AI or Open-source models) and layout analysis tools to digitize and structure document content.\nEngineer end-to-end document processing workflows, including data ingestion, classification, entity recognition, and validation\nCollaborate with business stakeholders to understand pain points and identify high-impact AI use cases.\nRapidly build a POC on CGI Pulse AI platform, including data pipelines, models, APIs, and basic UI components, for validation and testing.\nEvaluate feasibility and ROI of potential AI solutions; prioritize based on business value and technical complexity.\nResponsible for making the POC successful by outline clear operational or financial gains.\nResponsible for transitioning from POC to full end to end implementation and leading the delivery into Production.\nResponsible for analyzing platform/solution design and cost on CGI Pulse AI platform with comparable capabilities with Azure or GCP.\nResponsible for designing AI solutions which can scale up and down and provide a PaaS offering to clients.\nResponsible for designing Access control, Data Security and Responsible use of AI.\nResponsible for client demonstration, creating Blog and presenting CGI Pulse AI capabilities in reputed tech forums and conferences.\nResponsible to work with Pulse AI product owners to add new features and contribute on Product development.\nNeed to be able to debug Application backend Issues, API issues, Performance issues and Platform issues of CGI Pulse AI product and come up with solution to fix production showstopper issues.\nResponsible for Performance testing of the AI Solution as well as Penetrations/Security testing of the implementation.\nResponsible for tracking and managing and vulnerability fixes of all open-source products being used on the implementation.\nResponsible to define and create operations strategy and support manuals for the AI solutions being implemented on the Pulse AI platform.\nResponsible for setting up Monitoring and Alerting of AI Solution Accuracy and Performance drifts.\nRequired qualifications to be successful in this role:\nEducational Background: Bachelor's or Master's degree in computer science, artificial intelligence, or a related field.\n5+ years of experience in software engineering and AI/ML development roles.\n3+ years track record of building and deploying AI-driven solutions in production.\n5+ years of strong programming skills in Python and experience with ML frameworks.\nMust have experience with both structured and unstructured data.\n3+ years of experience with REST APIs, microservices, and cloud platforms.\n3+ years of experience of LLMs, RAG (retrieval-augmented generation), and generative AI tools.\nExperience in data privacy, compliance, and ethical AI principles\nExperience working with business domains such as healthcare, finance, insurances, utilities, or retail is a Plus.\nMust Have One end to end production implementation experience with IDP (Intelligent Document Processing) using LLMA/Gemini/GPT4.0 Models.\nMust Have One end to end production implementation experience with Chatbots to build an application to provide Q/A on Structures and Unstructured data using GenAI.\n\n\nCGI is required by law in some jurisdictions to include a reasonable estimate of the compensation range for this role. The determination of this range includes various factors not limited to skill set, level, experience, relevant training, and licensure and certifications. To support the ability to reward for merit-based performance, CGI typically does not hire individuals at or near the top of the range for their role. Compensation decisions are dependent on the facts and circumstances of each case. A reasonable estimate of the current range for this role in the U.S. is $88,200.00 - $195,200.00.\n\nAt CGI we call our professionals partners to reinforce that all who join our team are, as owners, empowered to participate in the challenges and rewards that come from building a world-class company.\n\nCGI s benefits include:\nCompetitive base salaries\nEligibility to participate in an attractive Share Purchase Plan (SPP) in which the company matches dollar-for-dollar contributions made by eligible employees, up to a maximum, for their job category.\n401(k) Plan and Profit Participation for eligible members\nGenerous holidays, vacation, and sick leave plans\nComprehensive insurance plans that include, among other benefits, medical, dental, vision, life, disability, out-of-county emergency coverage in all countries of employment.\nBack-up childcare, Pet insurance, a Member Assistance Program, a 529 college savings program, a personal financial management tool, lifestyle management programs and more.\n\n#LI-KB5\nSkills:\nArtificial Intelligence\nPython\nRESTful (Rest-APIs)\nWhat you can expect from us:\nTogether, as owners, lets turn meaningful insights into action.\n\nLife at CGI is rooted in ownership, teamwork, respect and belonging. Here, youll reach your full potential because\n\nYou are invited to be an owner from day 1 as we work together to bring our Dream to life. Thats why we call ourselves CGI Partners rather than employees. We benefit from our collective success and actively shape our companys strategy and direction.\n\nYour work creates value. Youll develop innovative solutions and build relationships with teammates and clients while accessing global capabilities to scale your ideas, embrace new opportunities, and benefit from expansive industry and technology expertise.\n\nYoull shape your career by joining a company built to grow and last. Youll be supported by leaders who care about your health and well-being and provide you with opportunities to deepen your skills and broaden your horizons.\n\nCome join our teamone of the largest IT and business consulting services firms in the world.\n\nQualified applicants will receive consideration for employment without regard to their race, ethnicity, ancestry, color, sex, religion, creed, age, national origin, citizenship status, disability, pregnancy, medical condition, military and veteran status, marital status, sexual orientation or perceived sexual orientation, gender, gender identity, and gender expression, familial status or responsibilities, reproductive health decisions, political affiliation, genetic information, height, weight, or any other legally protected status or characteristics to the extent required by applicable federal, state, and/or local laws where we do business.\n\nCGI provides reasonable accommodations to qualified individuals with disabilities. If you need an accommodation to apply for a job in the U.S., please email the CGI U.S. Employment Compliance mailbox at US_Employment_Compliance@cgi.com. You will need to reference the Position ID of the position in which you are interested. Your message will be routed to the appropriate recruiter who will assist you. Please note, this email address is only to be used for those individuals who need an accommodation to apply for a job. Emails for any other reason or those that do not include a Position ID will not be returned.\n\nWe make it easy to translate military experience and skills! Click here to be directed to our site that is dedicated to veterans and transitioning service members.\n\nAll CGI offers of employment in the U.S. are contingent upon the ability to successfully complete a background investigation. Background investigation components can vary dependent upon specific assignment and/or level of US government security clearance held. Dependent upon role and/or federal government security clearance requirements, and in accordance with applicable laws, some background investigations may include a credit check. CGI will consider for employment qualified applicants with arrests and conviction records in accordance with all local regulations and ordinances.\n\nCGI will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with CGIs legal duty to furnish information."
  },
  {
    "title": "Machine Learning Researcher",
    "company": "Schrödinger",
    "location": "New York, NY 10036 \n(Midtown area)",
    "salary": "$120,000 - $160,000 a year",
    "url": "https://www.indeed.com/rc/clk?jk=49979a5e61e6f70f&bb=eGq16L8opQ76n6wwbbBPJbVB-fxxSHyx4Qc_MaNW9A4ExXkuyldVXKB2F03YRPtJUNwQWmaABYOSneRqIJniq8xmn2RTX6Gyq04ZwkDlP5VqpjA5j5NwQ-v-hQuAjUEXgRIPnY6nmw4fu-AD2ddcUQ%3D%3D&xkcb=SoB367M3sjCcH_xbtB0PbzkdCdPP&fccid=8b03edb481500fa4&vjs=3",
    "description": "We're seeking a Machine Learning Research Engineer to join us in our mission to improve human health and quality of life through the development, distribution, and application of advanced computational methods!\nAs a member of our Machine Learning team, you'll deal with DNA, RNA, small molecule design, materials design, and/or quantum physics. Previous experience in these domains is not required, but an interest in learning is.\nWho will love this job:\nAn engineer who can run independent projects end to end and is familiar with tensorflow, pytorch, Pandas, and sklearn\nA self-directed researcher who can wade through technical domains to get to \"the real problem\"\nAn excellent communicator who loves collaborating in a team environment\nWhat you'll do:\nCollaborate closely with scientists, developers, and drug hunters to deliver new research that meet business and product goals\nGiven a clean slate, assess the merit of an idea and help the team decide whether to develop it into a full feature\nUse your own judgment and with support from teammates to architect and implement proof-of-concept solutions\nParticipate in a code reviewing environment that encourages learning and high code quality\nWhat you should have:\nBasic understanding of statistics\nAbility to work with multi-dimensional data and solve data munging problems with python\nBS, MS, or PhD, in Computer Science, Software Engineering, Machine Learning, Mathematics, Physics, or Chemistry\nWe'd prefer to hire someone with...\nFamiliarity with source control (GIT, SVN, etc.)\nUnderstanding of continuous integration\nBackground in large-scale distributed computing (pbs, slurm, etc.)\nExperience with building systems that operate on more than ten machines\nKnowledge of log processing and data analysis\nAn independent interest in science (an undergraduate major or minor is a plus!)\nPay and perks:\nSchrödinger understands it's people that make a company great. Because of this, we're prepared to offer a competitive salary, equity-based compensation, and a wide range of benefits that include healthcare (with dental and vision), a 401k, pre-tax commuter benefits, a flexible work schedule, and a parental leave program. We have regular catered meals in the office, a company culture that is relaxed but engaged, and over a month of paid vacation time. Our Office Management team also plans a myriad of fun company-wide events. New York is home to our largest office, but we have teams all over the world. Schrödinger is honored to have been included in Crain's New York Best Places to Work, BuiltIn's NYC Best Place to Work, and Newsweek's list of America's 100 Most Loved Workplaces.\nSound exciting? Apply today and join us!\nEstimated base salary range: $120,000 - $160,000. Actual compensation package is dependent on a number of factors, including, for example, experience, education, degrees held, market data, and business needs. If you have any questions regarding the compensation for this role, do not hesitate to reach out to a member of our Strategic Growth team.\nAs an equal opportunity employer, Schrödinger hires outstanding individuals into every position in the company. People who work with us have a high degree of engagement, a commitment to working effectively in teams, and a passion for the company's mission. We place the highest value on creating a safe environment where our employees can grow and contribute, and refuse to discriminate on the basis of race, color, religious belief, sex, age, disability, national origin, alienage or citizenship status, marital status, partnership status, caregiver status, sexual and reproductive health decisions, gender identity or expression, sexual orientation, or any other protected characteristic. To us, \"diversity\" isn't just a buzzword, but an important element of our core principles and key business practices. We believe that diverse companies innovate better and think more creatively than homogenous ones because they take into account a wide range of viewpoints. For us, greater diversity doesn't mean better headlines or public images - it means increased adaptability and profitability."
  },
  {
    "title": "Financial Analyst - AI Trainer",
    "company": "DataAnnotation",
    "location": "Atlanta, GA",
    "salary": "From $40 an hour",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0CnM4TERr6XuVBW3VTRACvDXDx9S3Pbn6a0SwhkmoLTiJ7-WtU1cq8uTuDtQdhMlg0QWxJuZObLW0M7LD5xgfHjdDr3YgmPp8DsXnSBDZnJpkSbAp22KAeQyophr3jkwcttMoYUK6KuC8ZjUOrdC0vZtMPMhffPzyMcPTiGrVWlojuThgO7H_1pGa-XhNQN2gY7ydQopXBQW3qRjJj4HwHRD6VKL7FCZO7ZxF7SOBm_7OQE1VpxBsUBuWMYQo0eaX4vESJ-VYeLv5yoqGJUZqHijcYAm3Yw0aKAmfwcN7vpMRAtN3PHgwGj-VpPu1q9igQrbeLloiXFgzFv_na3w_Qi0Qg7ZYzrULh4kJlHg7dq2-ETNkR2skB8iMv_K9Vnx2PPQUt_F_672FSAhDmiekqx8S5gvhgTfoD0tyV8DFj1zQpj2Jn-EZ_hMVJIlBbbpseIzv18WspnW1R4BsOURTDqqR7W3u_V7Ns63DAA-NN1w7QsZpO861j65HsLB7Md1XtVjg2ztiw9Q-lasLsOrHmaOa2htDMuWOgPDsuirFC_Pg4ciKjUDLrZlFuL7SqEAsXI0PYoeXwxGqvapnYKlamKln6YQoQWRtahX54dtQg--_foiGJeQ1PdW6eid1kftvFUp8W2JpOMILgSpJ53d6YRI9wQG_mA8FOgjwW07IJrCa941vbF5yHYldM2P1xTzWs0f4GDV2JEICnZwdp7FFiudgGACN9D_BzArimqJKHvbso2D3q298BbdyzLbtQIfCgyAm7Puuk3s0EsfKtiYcr_oIXUY1ROY-0s7hkyJCyCzILLbwM9XXJr_1Xl-pBcHCqTw4Pp9RscXryviuj7Xp6oDD7P-fvj_lDqa7ZEfb7QJA==&xkcb=SoC56_M3sjCcH_xbtB0JbzkdCdPP&camk=UoKtGZLa3XLY2BMv4_jUOw==&p=0&fvj=0&vjs=3",
    "description": "We are looking for a finance professional to join our team to train AI models. You will measure the progress of these AI chatbots, evaluate their logic, and solve problems to improve the quality of each model.\nIn this role you will need to hold an expert level of financial reasoning- a completed or in progress Bachelors/Masters/PhD is preferred. Other related fields include, but are not limited to: Financial Accounting, Investment Banking, Wealth Management, and Insurance Planning.\nBenefits:\nThis is a full-time or part-time REMOTE position\nYou’ll be able to choose which projects you want to work on\nYou can work on your own schedule\nProjects are paid hourly starting at USD $40+ per hour, with bonuses on high-quality and high-volume work\nResponsibilities:\nGive AI chatbots diverse and complex problems and evaluate their outputs\nEvaluate the quality produced by AI models for correctness and performance\nQualifications:\nFluency in English (native or bilingual level)\nDetail-oriented\nProficient in financial analysis, financial modeling, data analysis, and other reasoning exercises related to finance management\nA current, in progress, or completed Masters and/or PhD is is preferred but not required\nNote: Payment is made via PayPal. We will never ask for any money from you. PayPal will handle any currency conversions from USD. This role is only available for those located in the US, UK, or CA. This is an independent contract position.\n#INDUSFIN\nJob Type: Contract\nPay: From $40.00 per hour\nBenefits:\nFlexible schedule\nWork Location: Remote"
  },
  {
    "title": "",
    "company": "",
    "location": "",
    "salary": "",
    "url": "https://www.indeed.com/viewjob?jk=890abcdef0123456",
    "description": "None"
  },
  {
    "title": "Technical AI Instructor and Forward-Deployed Engineer (Specialist Senior)",
    "company": "Deloitte",
    "location": "Houston, TX 77002 \n(Downtown area)",
    "salary": "$107,600 - $198,400 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0DIXU_djF9v0NrX_xbLRwj6RWFeuMEgTY6VvwKgvleOVG4FVVS6URhro_sUU09TyEirnz5HC8VHY6iZ2j0LtZT_Ws5KRA7Es3l8sjWXUKn5Y8jwVXATjpItl6YEhDBOf8yhh8uczGI6NW7BfSvd7jqi9-jc_g6AJq0GoXy_RApDGM5Vy5R0VpJ9MqvXUCKR7YKfu9v6YGNvRgsXabd-4Jeltiob6fJlNSIPSnnmzjgeqy3unGUoRNq1yJTpfD5nyKq-P9Qycvbr-Xo-nmKGvsDn_ab7SKpZEWHWmocJuEt6y-zpqi5gcJ7QpolfV9_o0WGibZTuP6NYQRCXFRZ3J98B7_qG__F1JrWTG4aDE2lIV10osEa_03bOD7Q7dRL2znz_OcGFHPrkIXbebhtD7WEvGQAs4Kyv_EDUnKFQZaHsApZxXfgDjOrSFAOzbIcZQhLSzngfAafd6WwgPcmguKmcDH6HuJ4nz7MUPQyKqeSxl7kkrwzTlMOIhgirqbSzVZ1RCoeJTtLKCPgm01t03KtRk6KN_P90XZSLXZ3jBmPGnf4DU0l2Eyk45WbhUu_GhrthzyEib-xy957E6ymX6emHnfwaHmTs0I425qJephHCG2_9ouy20szH7hk3eOqeX_T0HKh3XlpJ9ThtObsAxGfMsSiXbaJ108YnsyAzTm2e3zF_pa56Z0yn&xkcb=SoBV6_M3sjCZAoQByh0KbzkdCdPP&camk=ethIe0s0heeMtepOIg2GuA==&p=1&fvj=0&vjs=3",
    "description": "Technical AI Instructor and Forward-Deployed Engineer (Specialist Senior)\n\nOur Deloitte Customer team empowers organizations to build deeper relationships with customers through innovative strategies, advanced analytics, Generative AI, transformative technologies, and creative design. We can enhance customer experiences and drive sustained growth and customer value creation and capture, through customer and commercial strategies, digital products and innovation, marketing, commerce, sales, and service. We are a team of strategists, data scientists, operators, creatives, designers, engineers, and architects. Our team balances business strategy, technology, creativity, and ongoing managed services to solve the biggest problems that affect customers, partners, constituents, and the workforce.\n\nRecruiting for this role ends on November 24, 2025\n\nWork you'll do\n\nWe are seeking a highly skilled and passionate individual to join our team as a Technical AI Instructor and Forward-Deployed Engineer. This role involves teaching technical AI skills, engaging in early-stage engineering work, and incubating innovative products from concept to code. The position will have both client-facing responsibilities and an internal enablement component.\n\nIn this role, you will help shape and lead early stage product development and product incubation projects with a focus on rapid prototyping using cutting edge generative AI tools. You'll additionally support our teams by teaching them to use and implement the tools, frameworks and patterns needed for rapid prototyping with generative AI.\n\nKey Responsibilities Include:\nTeaching Technical AI Skills: Develop and deliver comprehensive training programs on generative AI technologies, including tools such as GitHub Copilot, Cursor, Replit, Airtable, and platforms like OpenAI, Anthropic, and Gemini. Tailor content to various skill levels and ensure practical, hands-on learning experiences for designers, engineers, and product managers.\nEarly-Stage Forward-Deployed Engineering: Collaborate with cross-functional teams to design and implement AI solutions for real-world problems. Engage in rapid prototyping and iterative development to validate concepts and refine solutions.\nProduct Incubation: Lead the incubation of new AI products, from ideation to deployment. Work closely with product managers, designers, and engineers to bring innovative ideas to life and ensure successful product launches.\nClient-Facing and Internal Enablement: Serve as a key point of contact for clients, providing expert guidance and support on AI initiatives. Additionally, enable internal teams by sharing knowledge, best practices, and facilitating collaboration.\n\nThe Team\n\nDeloitte's Advertising, Marketing & Commerce team creates content and experiences that inspire action. We design and implement technology platforms for personalized marketing across all digital touchpoints, specializing in customer-centric B2B and B2C solutions. Our in-house agency engages customers throughout their journey, working on projects like AdTech, MarTech, campaign automation, CRM, and lead-to-loyalty orchestration. Join us to drive impactful customer interactions and business growth.\n\nQualifications\n\nRequired\n2+ years experience in AI, machine learning, and/or data science.\nExperience with generative AI tools for software development, user experience, design, and product management.\nMust be legally authorized to work in the United States without the need for employer sponsorship, now or at any time in the future\nAbility to travel up to 50% on average based on the work you do and the clients and industries/sectors you serve\n\nPreferred\nExperience with cloud platforms such as AWS, Azure, or Google Cloud.\nKnowledge of software development best practices and agile methodologies.\nFamiliarity with product management and user experience design principles.\nExcellent problem-solving skills and the ability to work in a fast-paced, dynamic environment.\n\nInformation for applicants with a need for accommodation: https://www2.deloitte.com/us/en/pages/careers/articles/join-deloitte-assistance-for-disabled-applicants.html\n\nThe wage range for this role takes into account the wide range of factors that are considered in making compensation decisions including but not limited to skill sets; experience and training; licensure and certifications; and other business and organizational needs. The disclosed range estimate has not been adjusted for the applicable geographic differential associated with the location at which the position may be filled. At Deloitte, it is not typical for an individual to be hired at or near the top of the range for their role and compensation decisions are dependent on the facts and circumstances of each case. A reasonable estimate of the current range is $107,600 to $198,400.\n\nYou may also be eligible to participate in a discretionary annual incentive program, subject to the rules governing the program, whereby an award, if any, depends on various factors, including, without limitation, individual and organizational performance.\n\n#Customer_US\n\n#AMC_US"
  },
  {
    "title": "Principal Software Engineer",
    "company": "SNC",
    "location": "Lone Tree, CO 80124",
    "salary": "$165,010.00 - $226,889.04 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0D62_JHbrgYxlviA7FwbPsL4TkqsqsoMMqCOTnkHNAsjBlj38648WFpSVddWW6mLFDMAG0Eq2-l94_a6HoEgCF01bfRWDhRV-v3IvneFOkOVPFFxjH0KinH8ZH8r9ZTB8I8zxHb8hqPEO5U2U0DXfPI0Z5l7VQinOhntMByPEi3nLeXUw3aZXgCQJx92SbvQYEe-MnNK-kozAbPZnUtZ9MPyQnL-uZv_5FFjn6n156aFbJObhufZhEZXcKHiq2bygmEAcCBGoVsaLEQj4kEfdXsk66UhOWJbv7c7AlV-3H18ziuj06yMLFSHVl-PTRTZjkJ_Fj3nfVD707Yu7Cvhtvxh7nO5eCadLU9fWD22o71s6NaYeCL-tHQT34DnskVsYA9WE-qfI3k-sKZwHWAAEBIGKiTvY2m2npAbEyGtfAMZ-evs4T92VbN6k27T-Ra8CeD0OMYBVXm2YU28AZoqRv3tK8t6JbFvuNn4vsB2fCXvZYdloL2YzbCHeTpqO2eRboV9mK3fHYdWyMp6Pbu8GKgEdMlNeAVhsBsPonm3sVP3nYW5kPMvSLgWm-LqUVsf0Novqtw8WumJetOYyb4RXwxRCTkLyoUQAU2aW59dV2WYJ1GEHLkFGVth2s-nwZoW8uKttXD2noYOgjWrMSi9NjPHU7H7U04Ses=&xkcb=SoDb6_M3sjCZAoQByh0NbzkdCdPP&camk=ethIe0s0hefIK0xtHVJpVQ==&p=6&fvj=0&vjs=3",
    "description": "Do you enjoy developing new products and services? Join us! Our Software Engineers work in an agile, collective environment. You will be using your skills and expertise to define, design, develop, test, certify and improve cutting-edge software products. These cover a very wide range from advanced mission payloads and electronic systems through highly integrated aircraft to orbital and space exploration systems. You'll perform coding, debugging, testing, and troubleshooting of systems and software throughout our development process. Your technical duties involve the design and development of new software products throughout the product lifecycle.\nThe ISR (Intelligence, Surveillance & Reconnaissance), Aviation, and Security (IAS) business area is a leader in ISR and aviation, it is a leading prime manned and unmanned aircraft systems integrator for innovative, high-performance ISR and aviation systems. Its end-to-end Command, Control, Computers, Communications and Intelligence, Surveillance & Reconnaissance (C4ISR) capabilities encompass design, integration, test, certification, ground/flight training and complete logistics support. IAS tailors solutions to customer cost, performance, and schedule requirements and designs to consistently exceed expectations – with an unrivaled record of on time and on (or under) budget deliveries.\nResponsbilities:\nProvide deep technical understanding of software, software system design, and systems engineering\nOwn the software architecture and baseline for command and control mission systems and autonomous systems\nProvide definition of software practices and procedures\nDesign system of systems from clean sheet design and solve complex problems on existing systems\nContribute to software engineering proposals where you will perform task definition and estimating work to accomplish those tasks\nWork across the organization to align software needs and ensure a consistent product\nQualifications You Must Have:\nBachelor's of Science degree Computer Science, Software Engineering or other related discipline and typically 14 or more years of relevant experience\nHigher education may substitute for relevant experience\n3 or more years of relevant software architecture and system design experience\nAdvanced capabilities using Computer Aided Engineering tools\nDemonstrated knowledge of engineering principles and practices\nExperience working in multi-disciplinary teams\nKnowledge of software engineering principals, practices, and processes including software life cycle, DevOps, configuration management, testing, hardware integration, cybersecurity\nCommunication skills to effectively technical concepts and software architectures to technical and non-technical audiences\nKnowledge of Government Reference Architectures (GRA)\nExperience architecting and developing command and control systems\nExperience using a Modular Open System Approach (MOSA) to develop modular and open system architectures\nExperience developing software using open system standards such as Open Mission Systems (OMS) and Future Airborne Capability Environment (FACE)\nExperience in the aerospace and defense industry\nDesire to drive system architecture making an impact on a software engineering team\nActive Top Secret U.S. Security Clearance w/ SCI eligibility is required\nQualifications We Prefer:\nModel Based Systems Engineering (MBSE) experience\nExperience in mentoring software engineers\nUnderstanding of industry standard software languages such as C, C#, C++, HTML, Java, Python, and Bash\nExperience with software tools for requirements tracking, code reviews, static analysis, library and artifact repository, and automated build\nExperience with containers and orchestration technologies\nExperience developing safety critical software using safety-critical software standards (DO-178C)\nExperience in the design and development of autonomous platforms\nExperience integrating and implementing AI/ML into system designs\nMasters Degree in Computer Science\nAt Sierra Nevada Corporation (SNC) we deliver customer-focused technology and best-of-breed integrations in the aerospace and defense sectors. SNC has been honored as one of the most innovative U.S. companies in space, a Tier One Superior Supplier for the U.S. Air Force, and as one of America’s fastest-growing companies. Learn more about SNC\nThis posting will be open for application for a minimum of 5 days and may be extended based on business needs.\nEstimated Starting Salary Range: $165,010.21 - $226,889.04. Compensation varies depending on a wide array of factors, such as candidates' key skills, relevant work experience, and education/training/certifications. The disclosed range estimate may be adjusted for any applicable geographic differential associated with the location at which the position may be filled.\nSNC offers annual incentive pay based upon performance that is commensurate with the level of the position.\nSNC offers a generous benefit package, including medical, dental, and vision plans, 401(k) with 150% match up to 6%, life insurance, 3 weeks paid time off, tuition reimbursement, and more.\nIMPORTANT NOTICE:\nThis position requires current/active Top Secret with SCI eligibility U.S. Security Clearance. U.S. Citizenship status is required as this position needs an active U.S. Security Clearance for employment. Non-U.S. Citizens may not be eligible to obtain a security clearance. The Department of Defense Consolidated Adjudications Facility (DoD CAF), a federal government agency, handles the adjudicative aspects of the security clearance eligibility process for industry applicants. Adjudicative factors which affect the outcome of the eligibility determination include, but are not limited to, allegiance to the U.S., foreign influence, foreign preference, criminal conduct, security violations and illegal drug use.\nLearn more about the background check process for Security Clearances.\nSNC is a global leader in aerospace and national security committed to moving the American Dream forward. We’re known and respected for our mission and execution focus, agility, and disruptive and rapid innovation. We provide leading edge technologies and transformative solutions that support our nation’s most critical security needs. If you are mission-focused, thrive in collaborative environments, and want to make our country stronger with state-of-the-art technologies that safeguard freedom, join our team!\nSNC is an Equal Opportunity Employer committed to an environment free of discrimination. Employment decisions are made based on merit without regard to race, color, age, religion, sex, national origin, disability, status as a protected veteran or other characteristics protected by law."
  },
  {
    "title": "Technical AI Instructor and Forward-Deployed Engineer (Specialist Senior)",
    "company": "Deloitte",
    "location": "New York, NY",
    "salary": "$107,600 - $198,400 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0DIXU_djF9v0NrX_xbLRwj6RWFeuMEgTY6VvwKgvleOVG4FVVS6URhro_sUU09TyEirnz5HC8VHY5Npjs8NfwYCS2RJvaY6y00kz7Cw0RcvDk4dXpQda2aGLPdLhn67xjP1bqlFzy3jnMbm2B2Swy3Uxd2Xv0jF9RXs2b3k9MAIN7fZNeDpMSwZ_mELXsmbaKkN2VA5MNIS1hSdYpiRtIivG1m3BVpGYdFjg0EsUjYSqKQAMfIaI8Fxgn6pl0r7cYNETXbrEYjdHmlDlJrwV8oLoatb7AA-64AWxHRYfioabbbPGwxBUZqGe0bkI5zKG2d_ERBbZLGY0oFPQNIrEzGXIqJWhyq6prtFMm2JVbZtGonhjT3Iv19eJsqPAWkQSJL41t-UGBd4kdIej6wP1ziXE6H2-gRq4D9wdoaIfiftO26Fj-X0zirP_Lge5nQROjxyh7Gtgit0May9cuDgbBNG0D2LuAWf_-KMXzO4frJF2NEDTdK4SyNXPDi3Rk4qRIXqkGN_Qy9rlrtd4sKcmjuCe7me5MUHisjpvzrxTzTOmPEFcynPGONIiZ0QpHzBMyb6hkIpdyFHtWDxW6Bs_5ZTcQQWfFFyhH21cbIGUrUBt2RV8pkTlRgWjBiwGLf2ClJtOHaZO7HYstlx0yX6YowYXhRliH3vYpI3BkFPbD1T1gro02mKrapk&xkcb=SoDy6_M3sjCZAoQByh0PbzkdCdPP&camk=ethIe0s0heeMtepOIg2GuA==&p=4&fvj=0&vjs=3",
    "description": "Technical AI Instructor and Forward-Deployed Engineer (Specialist Senior)\n\nOur Deloitte Customer team empowers organizations to build deeper relationships with customers through innovative strategies, advanced analytics, Generative AI, transformative technologies, and creative design. We can enhance customer experiences and drive sustained growth and customer value creation and capture, through customer and commercial strategies, digital products and innovation, marketing, commerce, sales, and service. We are a team of strategists, data scientists, operators, creatives, designers, engineers, and architects. Our team balances business strategy, technology, creativity, and ongoing managed services to solve the biggest problems that affect customers, partners, constituents, and the workforce.\n\nRecruiting for this role ends on November 24, 2025\n\nWork you'll do\n\nWe are seeking a highly skilled and passionate individual to join our team as a Technical AI Instructor and Forward-Deployed Engineer. This role involves teaching technical AI skills, engaging in early-stage engineering work, and incubating innovative products from concept to code. The position will have both client-facing responsibilities and an internal enablement component.\n\nIn this role, you will help shape and lead early stage product development and product incubation projects with a focus on rapid prototyping using cutting edge generative AI tools. You'll additionally support our teams by teaching them to use and implement the tools, frameworks and patterns needed for rapid prototyping with generative AI.\n\nKey Responsibilities Include:\nTeaching Technical AI Skills: Develop and deliver comprehensive training programs on generative AI technologies, including tools such as GitHub Copilot, Cursor, Replit, Airtable, and platforms like OpenAI, Anthropic, and Gemini. Tailor content to various skill levels and ensure practical, hands-on learning experiences for designers, engineers, and product managers.\nEarly-Stage Forward-Deployed Engineering: Collaborate with cross-functional teams to design and implement AI solutions for real-world problems. Engage in rapid prototyping and iterative development to validate concepts and refine solutions.\nProduct Incubation: Lead the incubation of new AI products, from ideation to deployment. Work closely with product managers, designers, and engineers to bring innovative ideas to life and ensure successful product launches.\nClient-Facing and Internal Enablement: Serve as a key point of contact for clients, providing expert guidance and support on AI initiatives. Additionally, enable internal teams by sharing knowledge, best practices, and facilitating collaboration.\n\nThe Team\n\nDeloitte's Advertising, Marketing & Commerce team creates content and experiences that inspire action. We design and implement technology platforms for personalized marketing across all digital touchpoints, specializing in customer-centric B2B and B2C solutions. Our in-house agency engages customers throughout their journey, working on projects like AdTech, MarTech, campaign automation, CRM, and lead-to-loyalty orchestration. Join us to drive impactful customer interactions and business growth.\n\nQualifications\n\nRequired\n2+ years experience in AI, machine learning, and/or data science.\nExperience with generative AI tools for software development, user experience, design, and product management.\nMust be legally authorized to work in the United States without the need for employer sponsorship, now or at any time in the future\nAbility to travel up to 50% on average based on the work you do and the clients and industries/sectors you serve\n\nPreferred\nExperience with cloud platforms such as AWS, Azure, or Google Cloud.\nKnowledge of software development best practices and agile methodologies.\nFamiliarity with product management and user experience design principles.\nExcellent problem-solving skills and the ability to work in a fast-paced, dynamic environment.\n\nInformation for applicants with a need for accommodation: https://www2.deloitte.com/us/en/pages/careers/articles/join-deloitte-assistance-for-disabled-applicants.html\n\nThe wage range for this role takes into account the wide range of factors that are considered in making compensation decisions including but not limited to skill sets; experience and training; licensure and certifications; and other business and organizational needs. The disclosed range estimate has not been adjusted for the applicable geographic differential associated with the location at which the position may be filled. At Deloitte, it is not typical for an individual to be hired at or near the top of the range for their role and compensation decisions are dependent on the facts and circumstances of each case. A reasonable estimate of the current range is $107,600 to $198,400.\n\nYou may also be eligible to participate in a discretionary annual incentive program, subject to the rules governing the program, whereby an award, if any, depends on various factors, including, without limitation, individual and organizational performance.\n\n#Customer_US\n\n#AMC_US"
  },
  {
    "title": "GenAI Program Manager",
    "company": "Genworth",
    "location": "Hybrid work in Raleigh, NC 27601",
    "salary": "Full-time",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0DveHtaohNZTTr4NJ6iQ6LvBAugsddynFItxJfHbw6F-Apcu9BSZNSXnXhmpJE8pof9lWdZBldN1eg4oulsxM70ZTeDjgMKKFz_HHtcBh9ZkfXDB5ybESYm69He0qQvABUsfKUuX_QWQoiyebdjByByaA5FrhvFiLsVDtwPxpeMQLfNzDrfiaXhcswWvPt_RqCjUDFCHSxUoOqa3M3lD8Tlx7RebHsuVP-dqulv3_qhkV8STs23BVy8l2bta2laUHU8wjVPZxQydkTo72OdsAAA3PVNKkRcjOp3BG2ErsiV8H5ZLFjllzLzNFoQ-7W6mukt6BL_YxxzJnwgjh-xksGLq4U5blpXBusNtNpLb3UDhXunH3_KHFoyPvocIsceCbdPpoT1oLcYSTK_fBakcMgfBftjGx7xAyFVTqvWpIELl8Ni1hNJhAj4yqLx3d6B0p0J6a0n38yulZEIQuEGPieN7zYQu-20JQ2rNHMls5b3Pik3oghUoj8R_-CgolvMgHU9KOsiTH-BgVAZsyJGazev8C_U_5y2V5KzJgF6vlHv2v4c85vSu0nKp1QP8D_HgMa4zNj9vtzXdKVZu9ITeOI9gXaRyHmFOEMXtwwr_2mSZpWKkvJQK-m_petqHvkXMsW0b_kjZO0R2mifjmJWgMiXfi_QHg43yXs=&xkcb=SoAb6_M3sjCZAoQByh0AbzkdCdPP&camk=H-lBaXMUocIc1YQlBXi0qQ==&p=11&fvj=0&vjs=3",
    "description": "At Enact, we understand that there’s no place like home. That’s why we bring our deep expertise, insightful offerings, and extra mile service to work every day to help lenders put more people in homes and keep them there.\nWe’re looking for a Generative AI Program Manager in Raleigh, NC to join us in fulfilling our mission, while utilizing our values of excellence, improvement, and connection. In this role, you will drive organization-wide adoption of Generative AI (GenAI) technologies. This role will report directly to the CIO and serve as the central catalyst for Enact’s GenAI transformation, working across all departments to educate on the art of the possible, identify opportunities, coordinate implementations, and measure business impact. The ideal candidate will combine strategic thinking with hands-on execution to accelerate our GenAI-driven innovation while ensuring responsible and effective adoption.\nLOCATION\nEnact Headquarters, Raleigh, NC – Hybrid Schedule\nYOUR RESPONSIBILITIES\nProgram Coordination\nChair and manage the GenAI Governance Committee\nProvide operational support to executive leadership\nCollaborate with department heads to identify and prioritize high-value GenAI use cases\nEnsure cross-functional alignment on GenAI initiatives and implementations\nCoordinate GenAI pilot programs and proof-of-concept projects\nFacilitate knowledge sharing and success story dissemination across teams\nCollaborate with the Enterprise Analytics team where appropriate to drive optimization efforts\nEducation Leadership\nFoster a GenAI-forward culture through sustained education and change management\nPartner with HR to develop comprehensive GenAI education strategy and curriculum\nCurate DataCamp learning paths and explore leveraging other GenAI training platforms\nEstablish and maintain strategic vendor relationships for GenAI training and tools\nDesign and deliver organization-wide awareness sessions and workshops\nCreate resource libraries and best practice documentation\nProgress & Impact Measurement\nDevelop and track key performance indicators for GenAI adoption and usage\nReport on business impact, ROI, and success metrics to leadership\nConduct regular assessments of adoption barriers and opportunities\nPromote and showcase successful implementations across the organization\nYOUR QUALIFICATIONS\nBachelor’s degree, preferably in a relevant field like Computer Science, Information Technology, Statistics, Mathematics, etc.\n5+ years of experience leading projects, programs, or change management initiatives with a track record of successfully delivering complex projects\nExperience prioritizing and ensuring key initiatives move forward, managing multiple cross-functional stakeholders, and working with urgency\n1+ year experience working with LLMs, prompt engineering, and fine-tuning\n1+ years of AI experience, either in product management, technology or consulting capacity\nCritical thinking and analytical skills\nExecutive presence and effective communications skills\nTrack record of embracing ambiguity and operating effectively in a fast-paced environment\nPREFERRED QUALIFICATIONS\nExperience working in the mortgage industry or financial services\nCOMPANY\nEnact Holdings, Inc. (Nasdaq: ACT), operating primarily through its wholly owned subsidiaries, is a leading publicly traded U.S. private mortgage insurance provider, offering borrower-centric products that enable lenders and other partners across the U.S. to help people responsibly achieve and maintain the dream of homeownership.\nBy empowering customers and their borrowers, Enact seeks to positively impact the lives of those in the communities in which it serves in a sustainable way. Headquartered in Raleigh, North Carolina, we play an active role in supporting a prosperous Triangle community. We also support our colleagues’ philanthropic efforts in their home communities across the U.S. Enact values all perspectives, characteristics and experiences, along with providing a positive and inclusive culture for employees to grow and succeed. We strive to create an environment where employees can bring their full, authentic selves to work to help each other and their customers.\n\nWe are proud to be an equal opportunity employer and all hiring decisions are based on merit, qualifications, and business needs. We do not discriminate based upon race, religion, color, national origin, gender (including pregnancy), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics.\nWHY WORK AT ENACT\n\nWe bring innovative thinking to the situations at hand\nWe seek out and incorporate diverse views to strengthen our outcomes\nWe work on challenging and rewarding projects\nWe offer competitive benefits:\nHybrid work schedule (in-office days Tues/Wed/Thurs)\nGenerous Time Off\n40 Hours of Volunteer Time Off\nTuition Reimbursement and Student Loan Repayment\nPaid Family Leave and Flexible Spending Accounts\n401k with up to 5% employer match\nFitness and Emotional Wellness Reimbursements\nOnsite Gym"
  },
  {
    "title": "AI & DATA ENGINEER",
    "company": "Fayetteville Public Works Commission",
    "location": "North Carolina",
    "salary": "$79,165.72 - $104,300.84 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0Acigsikwqu4M3AFW1gGUo2VvpP1U50qNdccqMposhtuIhkWiAwTZIywmusEA0gwvwC3qHFelRvuZGKRY1DNNzxpuMoFwZqVXgNhEG6Nx9NLHuRVztIYeb_ioisfUEnl-0tK_mePKLVIKF4kElh1zTlXB7WczRAf4k27Zjo95ztEqf9HHMjxJ79-7UZHuTX54VdanDnraRBoQ4nx-5DyNSGyeBdpTcpqy-rxWzjCRzXHA_Smlu3KbyLF1ZRoyPaK0dDYJ7z-yQQuBNF5M-Up_IQLMbkSJ71PeTHZX_qDCxraWNfnCv0Qcr2dFMENhA6a29QTVi9a2gWkxtBgvhNvWGS9VUepdMIvQr4h2SnOcLzOM3IpFzqRvXf023NN6tCH4RpjxJYCzZsYRVmcKy9-WsDIuKyGQGHMPPtMGuFoP5YjJkcElvmbVGYbWqLSfgwuFZa4I-74TEQlVqUgbSj-jIvRpQFu9WAAAEP-FfqKezLMtq57AKsNfhn78zRbaawovadoqDFg-xZ2IBMbqUdEmDTpLsKMg9aNao4onOcEYCbmw58aiGsmY3uvepfoRtPVMmcTUmXsxQ2GQYuO18mQSPjKD0Sr9Sn_nLrZEHYkXwKkoRprPx0IJ0AZSq7HBNLtZfinyRiC1wHbzW0_bMFRKBGL9JPbdeDMDj3wqWlfOu7SaQoLwLUP0VH_CDf-LDEHqbwXzmBUgQ-DpLYoWDMnR_pO_CW2f9sg9U=&xkcb=SoDI6_M3sjCZAoQByh0JbzkdCdPP&camk=xqnMBGaf-K9OfE4IaI0dGw==&p=2&fvj=0&vjs=3",
    "description": "Fayetteville Public Works Commission is seeking a technically skilled and forward-thinking AI & Data Engineer to join our Data Analytics team. This role is essential in designing, implementing, and maintaining scalable data infrastructure to support advanced analytics, AI, and machine learning initiatives. If you're passionate about building data-driven solutions and leveraging AI to solve real-world challenges, we encourage you to apply.\nKey Responsibilities\nDevelop business intelligence dashboards, reports, and visualizations.\nCreate and optimize data models for analytics and reporting.\nBuild and maintain scalable data pipelines, data lakes, and data warehouses.\nDesign and implement AI/ML models for predictive analytics and decision-making.\nCollaborate with cross-functional teams to translate business needs into data solutions.\nSupport deployment of BI tools such as Oracle Analytics Cloud and BI Publisher.\nConduct data validation, performance tuning, and troubleshooting.\nImplement CI/CD pipelines and contribute to data governance and metadata management.\nPerform other related duties as assigned.\nRequired Skills & Abilities\nProficiency in SQL, Python, and PySpark.\nExperience with data pipeline development and AI/ML applications.\nKnowledge of data warehousing, data lake architecture, and Oracle Fusion Analytics.\nFamiliarity with machine learning, AI, and Generative AI technologies.\nStrong analytical, problem-solving, and communication skills.\nAbility to work collaboratively in a fast-paced, cross-functional environment.\nEducation, Experience, and Certifications\nGraduation from an accredited university or college with a degree in business, technology, data management, or a related field and/or an equivalent combination of education, training, and experience.\n1–3+ years of relevant experience in AI & Data Engineer\nMust possess and maintain one or more of the following certifications:\nOracle Cloud Infrastructure AI Foundations Associate\nOracle Cloud Infrastructure Developer Professional\nOracle Cloud Infrastructure Data Science Professional\nOracle Cloud Infrastructure Generative AI Certified Professional\nOr an equivalent certification\nPhysical Requirements\nProlonged periods of sitting and working on a computer.\nNo significant lifting (>15 lbs).\nWhy Join PWC?\nAt Fayetteville Public Works Commission, we are committed to innovation, sustainability, and service excellence. Join a team that values professional growth, collaboration, and the opportunity to make a meaningful impact in the community.\nEMPLOYER’S RIGHTS: This job description is general and illustrative of the kind of duties required of this position. It is not exhaustive and does not contain a detailed description of all the duties that may be assigned to the incumbent occupying this position.\nApplicants must be currently authorized to work in the United States on a full-time basis.\nPWC does not offer employment-based visa sponsorship now or in the future.\nGrade 413X $79,165.72 - $104,300.84\n#FPWCSJ"
  },
  {
    "title": "Senior Machine Learning Scientist",
    "company": "Expedia Group",
    "location": "San Jose, CA",
    "salary": "$187,000 - $299,000 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0DbIyHopYNdPLgRYRG2FgnuJLz47mHLRnOVu2tY5XDnod2kQ1kD4SQatx4-P_YDUHctlMtNYnJzivJ_29kCeSXD1za25v74-ZS4i3uR0cm1JcLzjg5qyrhIwM5UL-PzYhiCVhbL1CVAiY9Zo7pXB5IDycpWXPzkl2pqFBisU8slzMNXQ4zEPukQEi1hUb9r5ArZmhzl17ICVL3xv9spEd8-k5_MTsw4KobhsOgxRv7xPjnDqWKTnXyJXceeb12bcdx_HnNIFOz1TwuQftwUy3FPtpfQnjl0cGB95i45a0bMfLYJbZ_VQsH8FofEjKKbdYa7QpY_TfKlK7LV9GAE09ArkN-bQ8pBb5esPUneooZnAOrYcWvNgokUymPEgtW9mAGvkjcvZbTMGl0Zs-eH-bgL2ziAkPww3hRO7BD8OE1w7thnBtiZy-VC1XlcT4prl8GvE83HiWrlOzsue8ZBwb9eX3E8ZwZ3RxQbQoguaY7lp4mlQO2meCO_r0FO1iylIq0CVqnrfJuV6DhRHcYx-OPUv9Hn5lzM4akqsbuCaWG9p1PYRrH19tGKoQOqs55XCHula5ekLGMBSV8M9tIrk3eH4ikeGYEIt2FPdbomLe_nB7Bbur28g7d5ufF5fpTkXaySBxcg45uV9iLH987Rma6rjmy-d5QTIko=&xkcb=SoAy6_M3sjCZAoQByh0CbzkdCdPP&camk=UoKtGZLa3XKeFSmBlYB6-g==&p=9&fvj=0&vjs=3",
    "description": "Expedia Group brands power global travel for everyone, everywhere. We design cutting-edge tech to make travel smoother and more memorable, and we create groundbreaking solutions for our partners. Our diverse, vibrant, and welcoming community is essential in driving our success.\nWhy Join Us?\nTo shape the future of travel, people must come first. Guided by our Values and Leadership Agreements, we foster an open culture where everyone belongs, differences are celebrated and know that when one of us wins, we all win.\nWe provide a full benefits package, including exciting travel perks, generous time-off, parental leave, a flexible work model (with some pretty cool offices), and career development resources, all to fuel our employees' passion for travel and ensure a rewarding career journey. We’re building a more open world. Join us.\nSenior Machine Learning Scientist\nIntroduction to the Team:\nExpedia Technology teams partner with our Product teams to create innovative products, services, and tools to deliver high-quality experiences for travelers, partners, and our employees. A singular technology platform powered by data and machine learning provides secure, differentiated, and personalized experiences that drive loyalty and traveler satisfaction.\nThe Traveler Engagement & Loyalty team at Expedia is at the forefront of innovation in AI-driven recommendation systems. We're dedicated to enhancing customer experiences, increasing engagement, and strengthening traveler relationships through cutting-edge machine learning solutions. Our work directly impacts millions of travelers worldwide, shaping their journey from dreaming to booking and beyond.\nJoin a newly formed Machine Learning Science team at Expedia Group focused on transforming Customer Relationship Management (CRM) through intelligent, personalized outbound communications. From crafting tailored travel recommendations to optimizing engagement strategies, your work will directly influence millions of travelers globally. This is a rare opportunity to build foundational systems in a high-impact domain, backed by Expedia’s AI-first vision.\nIn this role, you will:\nBuild and optimize recommendation models for CRM use cases, including personalized email campaigns and retention strategies\nApply deep learning and causal inference to sparse, noisy, and dynamic customer interaction data\nDesign and analyze A/B experiments to validate model performance and drive product decisions\nCollaborate with ML Engineers to deploy models at scale, ensuring robustness and reliability in production environments\nTranslate business objectives into measurable machine learning goals aligned with customer engagement outcomes\nStay current with advancements in recommendation research, deep learning architectures, and personalization systems\nMentor junior scientists and engineers, sharing best practices in ML modeling, experimentation, and deployment\n\nMinimum Qualifications:\nPhD, MS, or BS in Computer Science, Machine Learning, Statistics, Engineering, or a related field; or equivalent professional experience\n8+ years of related industry experience\nExperience building production-grade recommendation or personalization systems\nStrong understanding of collaborative filtering, deep learning for recommendations, reinforcement learning, and causal inference\nProficiency in Python and ML frameworks such as TensorFlow or PyTorch\nExperience with distributed systems like Apache Spark\nFamiliarity with A/B testing and experimentation methodologies\nAbility to work with large-scale, real-world data with attention to bias, fairness, and privacy\nExcellent communication skills for both technical and non-technical audiences\nPreferred Qualifications:\nExperience in the travel or e-commerce industry\nFamiliarity with cloud platforms (AWS, GCP, Azure)\nPublications in top-tier ML conferences or journals\nContributions to open-source ML projects\nExperience in personalization systems or CRM-focused ML applications\nExperience taking models from prototype to production in collaboration with Machine Learning Engineering teams\nThe total cash range for this position in San Jose is $187,000.00 to $261,500.00. Employees in this role have the potential to increase their pay up to $299,000.00, which is the top of the range, based on ongoing, demonstrated, and sustained performance in the role.\nStarting pay for this role will vary based on multiple factors, including location, available budget, and an individual’s knowledge, skills, and experience. Pay ranges may be modified in the future.\nExpedia Group is proud to offer a wide range of benefits to support employees and their families, including medical/dental/vision, paid time off, and an Employee Assistance Program. To fuel each employee’s passion for travel, we offer a wellness & travel reimbursement, travel discounts, and an International Airlines Travel Agent (IATAN) membership. View our full list of benefits.\nAccommodation requests\nIf you need assistance with any part of the application or recruiting process due to a disability, or other physical or mental health conditions, please reach out to our Recruiting Accommodations Team through the Accommodation Request.\nWe are proud to be named as a Best Place to Work on Glassdoor in 2024 and be recognized for award-winning culture by organizations like Forbes, TIME, Disability:IN, and others.\nExpedia Group's family of brands includes: Brand Expedia®, Hotels.com®, Expedia® Partner Solutions, Vrbo®, trivago®, Orbitz®, Travelocity®, Hotwire®, Wotif®, ebookers®, CheapTickets®, Expedia Group™ Media Solutions, Expedia Local Expert®, CarRentals.com™, and Expedia Cruises™. © 2024 Expedia, Inc. All rights reserved. Trademarks and logos are the property of their respective owners. CST: 2029030-50\nEmployment opportunities and job offers at Expedia Group will always come from Expedia Group’s Talent Acquisition and hiring teams. Never provide sensitive, personal information to someone unless you’re confident who the recipient is. Expedia Group does not extend job offers via email or any other messaging tools to individuals with whom we have not made prior contact. Our email domain is @expediagroup.com. The official website to find and apply for job openings at Expedia Group is careers.expediagroup.com/jobs.\nExpedia is committed to creating an inclusive work environment with a diverse workforce. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. This employer participates in E-Verify. The employer will provide the Social Security Administration (SSA) and, if necessary, the Department of Homeland Security (DHS) with information from each new employee's I-9 to confirm work authorization."
  },
  {
    "title": "Executive Director, Artificial Intelligence",
    "company": "Broadcast Music, Inc",
    "location": "Hybrid work in Nashville, TN",
    "salary": "",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0Czhm7K5KzP2jkkMillAjtWCVxzUUQj_mEz2A4Ivv1Ls9cexVCePfBE1iPdZi-que4bHCDDplq4ZqfdQtYhdFQQJLe16ACXEWVUkoV497aKP13-6grbzQNDWAKqu_hU1Jel7jTLqpsi-lCy8r2SnrUA0tHmd5XGcbMD3IPxDtclFS71ioszrc7EkKqDYrz2WlOG4J8aV1opWgfaLvjCGJhbpP33xb4JY1U6EUwGFq8Fn3cWIXHWYUC1TvmLre1X6SJ7wcDeo6nL-JJOUx_cXYWpYGyuyDy_gXJctpS9pYF2yKL2fXSkwDAk9SgpMq-k2crR_Y9_HaXrKEBXtOtHO-I8wzUdY4W1tXvFUsyq4t33Ts8uc9jCSx8mWsLyZonpULWCwtAnU69PnAKY--tiZROzon_TbZUFoPozzCy9x5_hqlv47QwlFfYBCAyHTtJRJ6GgKuh6jc3wlQPgrxbN7DhazNe7dZ-muZTwsPxUTd1OGZDQ_LxkbuMb_p_qsdiGlMCaIkwKDN8jEZBLlKhEniD2auoLKjAfVW2jIVwUahPj1EyPausbSdu4X7F-LTJoRWRzvuDOxp6sEibHmX66dIpGAdEyTV9_dsRBSy9qArk0mBPTxQLlMgKM9vnhmu1Jr5rpdHoJNSVK34lYXKNDSPzT&xkcb=SoAh6_M3sjCZAoQByh0GbzkdCdPP&camk=H-lBaXMUocJ93787h_hJag==&p=13&fvj=0&vjs=3",
    "description": "POSITION SUMMARY\nSets the company’s overall artificial intelligence (AI) strategy, including the design, development and implementation of technologies that will drive business transformation and enhance customer experiences.\n\nLOCATION\nRemote - (US)\n\nFUNCTIONS OF THE JOB\nEssential Functions: which may be representative but not all inclusive of those commonly associated with this position.\nPrepares the strategy for ensuring BMI’s use of ethical AI, including spearheading an inter-department AI governance team and oversees implementation of ethical AI across identified projects.\nIdentifies new business models that could be enabled using AI technologies.\nIdentifies AI projects of high business impact including both product-related projects and research projects.\nDetermines the AI projects/products implementation processes including project inception, exploration phase, model building phase, model deployment, and model retraining.\nPrepares annual roadmap for implementation of identified AI projects.\nPrepares the plan and oversees the implementation of the AI platform which will be used to deploy and host ML models.\nIdentifies technologies that will be used for development, testing and deployment of AI/machine learning models.\nImplements quality assurance, performance testing and model acceptance processes.\nImplements continuous delivery/deployment strategies (A/B testing, canary testing etc.) of machine learning models.\nImplements machine learning pipeline automation to be used for automated ML model retraining and testing.\nOversees the implementation of AI infrastructure to be used for model training/retraining and model deployment in production.\nEnsures the use of cloud services in relation to local infrastructure for fulfilling different requirements.\nCommunicates BMI’s AI strategy to stakeholders including affiliates, customers, partners, employees and the public as appropriate.\nOther duties as assigned.\nRegular attendance.\nSupports BMI core values and cultivate a culture of diversity and inclusion.\nSUPERVISORY RESPONSIBILITIES\nDirectly and indirectly supervises team members responsible for technology innovation, product and application development, IT operations and project management. Carries out supervisory responsibilities in accordance with the organization's policies and applicable laws. Responsibilities include interviewing, hiring and training employees; planning, assigning, directing and ensuring reliability of work; appraising performance; rewarding and disciplining employees; addressing complaints and resolving problems.\nPOSITION QUALIFICATION REQUIREMENTS\nEducation: Bachelor’s degree in related field; equivalent experience considered.\nExperience: Ten (10) years’ related technical and leadership experience within IT architecture and/or development areas.\nSKILLS AND ABILITIES\nWhich may be representative but not all inclusive of those commonly associated with this position.\nIn-depth knowledge of current AI research areas and current trends.\nExperience building machine learning models including data preparation techniques, feature engineering techniques, machine learning models (ML) and related ML algorithms.\nKnowledgeable of current developments in the field of AI – Safe AI, Ethical AI, Fair AI etc.\nExperience with Cloud AI/ML services on AWS, GCP, Azure.\nExperience with Cloud computing services.\nKnowledgeable of Big Data technologies and related cloud services.\nExperience with software development lifecycle, project implementation methodologies such as agile, etc.\nExperience with software engineering principles.\nExperience with DevOps concepts for ML pipeline automation.\nInfrastructure knowledge related to physical/virtual m/c for model retraining etc.\nSALARY RANGE\nThe specific base salary offered to a successful applicant will be based on individual qualifications, skills, experience, and education. The pay range is subject to change at any time based on various internal and external factors. The position may also be eligible for one or more performance-based bonuses. In addition to cash compensation, BMI offers a competitive portfolio of benefits to its employees, as described below.\nWhat We Give to You:\nHealth, dental, and vision insurance\n401K with employer match\nFlexible spending accounts\nPaid vacation and paid sick/personal time\n12 paid calendar holidays\nPaid volunteer time off\nSummer hours that offer more time for fun in the sun\nCompany paid life insurance\nUp to 12 weeks paid parental leave\nTuition assistance for qualified team members\nCommuter benefits (New York)\nAmazing and engaging culture\nEmployee Resource Groups\nBROADCAST MUSIC, INC. IS AN EQUAL OPPORTUNITY EMPLOYER: All applicants will receive equal opportunity for employment without regard of race, color, sex, religion, nationality, age, sexual orientation, gender identity and/or expression, veteran’s or marital status, disability, or any other cultural factor.\n#LI-Hybrid"
  },
  {
    "title": "Systems Engineer (Modeling and Simulation, Sensors / Radars experience)",
    "company": "Roccomar, Inc.",
    "location": "Hybrid work in Washington, DC 20004",
    "salary": "$105,000 - $150,000 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0AdSgmVLF8hIGdDziBfaMH6TGkuug8OgHmbuz4ML49eUTMTZuU-ryZnesKSb29d7n8Dy-iw_hg63KbHsn7UY8rVWGLPcSgP0KET_Je0A9Nc3YGI4pmTvDMNikESxGmv6VdNBHiBo7179zJ3k1UmhQahS-D0zmdStlJqkul3vX7tdP6T0XH7inMJUPpBfJvYS4MjIGgiPV8u3AfzE-qBsIDTIGTo-1Ao1_H44XvBcWm6rt99bvfm7djbSvEhXnakF7_ANoabVGrHTkm8yfB3ROJ-yAmGho3-r11LOwW8vkvm7dencurh9GD9Xm6XWDMvpY_tvogywQ3pztPWfr4Go_D3Om4Ni674MW1ECvLKyhZ_xkUqy0wGmygSInYE5hnev50aa_MKx0bnMsDU030CA-EgQ4jSl5MkulYxrXdgZjNZiH3rMNFmZI5WhktQrYpgVx_8ftb-iRs5GRgQdKmjVlm2WLh0hSoOJlJ9RHKeaBHR-iL9z7MZLT7eYyzkE_Cv-wr5NJ1AR43OqA6Lmy4KjDdASjnsO2OY87wySkY1qmh5LHHu22HXr62Cj3lhfsH5KlkFgvPZ45mTQB6bjzJyWH_nmDXDdSjFbMwxXDxg0AEqfEX4JTxn6OdtPvvc-OU52hOUZbiEaGV08FKhFwJ9mSsoICn8cM4ZmPn6h7JL7WnXQ1I2oa5cl3-5hXtvWH0hFrcZ0yUNxsAiFCUKresiV7_O_v0PTjWjUKuEARHVhmBs4Q==&xkcb=SoBv6_M3sjCZAoQByh0MbzkdCdPP&camk=ethIe0s0hecbNreOgRNqIA==&p=7&fvj=0&vjs=3",
    "description": "We are seeking a Systems Engineer to support DHS Systems Engineering Division under Functional and Specialty Engineering. The ideal candidate will be a Systems Engineer with experience in Systems Engineering Life Cycle (SELC) and exposure to a range of technologies including sensors (EO/IR, seismic, etc), radars, system modality, AI/ML, etc.\nKey Responsibilities:\nProvide expertise and technical assistance across systems engineering and acquisition lifecycles for all acquisition program levels. Support planning, implementation, and execution of systems engineering activities. Perform requirements development and System Engineering Life Cycle (SELC) planning, technical reviews, and technical activities throughout program lifecycles. Develop models of systems processes, simulations, analyses, and reporting supporting program decisions and enterprise-level strategic directives and initiatives. Prepare and present authoritative advice and recommendations to a variety of audiences including scientific professionals, non-technical senior leadership, and equipment end-users. Oversee Test and Evaluation (T&E) lifecycle processes and deliverables (including Operational T&E) and develop, advise, and test new approaches and theories. Perform integrated Logistics and Sustainment (L&S) lifecycle activities across policy, planning, implementation, assessments, workforce development, technical assistance, training, and asset management. Execute planning, tool development, and integration and generation of artifacts to expedite program and enterprise efforts. Generate and review policy, process, and procedural documents to support efficient execution of tasks; provide input into agency-wide acquisition policy and support workforce development. Assist the development, oversight, and execution of strategies to support the transition to Digital Engineering (DE) and Modeling and Simulation (M&S) in acquisitions. Provide expertise in support of Federal IT and non-IT programs throughout the acquisition lifecycle framework activities and documentation requirements.\nRequired Qualifications:\nBachelor’s degree and 10 years of experience with a background in acquisition management and systems engineering\nAbility to obtain and retain a DHS Suitability and/or CBP Background Investigation\nPossess understanding of the DHS or DoD SELC and DHS Management Directive 102-01, DoD 5000, and Federal Acquisition Institute guidelines and acquisition support for complex system acquisitions\nDesired Qualifications:\nElectrical Engineer\nFamiliarity with CBP Mission\nMaster's degree with Certified Systems Engineering Professional (CSEP) and 2+ years of experience managing a systems engineering team for a large Level I or II DHS Program\nActive DHS Suitability, CBP Background Investigation and/or Top Secret Clearance\nDigital Engineering (DE) and Modeling and Simulation (M&S) experience in acquisitions\nJob Type: Full-time\nPay: $105,000.00 - $150,000.00 per year\nBenefits:\n401(k)\n401(k) matching\nDental insurance\nHealth insurance\nLife insurance\nPaid time off\nVision insurance\nSchedule:\nMonday to Friday\nApplication Question(s):\nDo you have an Active DHS Suitability, CBP Background Investigation and/or Top Secret Clearance?\nDo you have experience with the Systems Engineering Life Cycle (SELC) and exposure to a range of technologies including sensors (EO/IR, seismic, etc), radars, system modality, AI/ML, etc?\nDo you have familiarity with the CBP mission and the DHS Acquisition Decision Events (ADE)?\nExperience:\nM&S and deploying surveillance technology: 10 years (Required)\nWork Location: Hybrid remote in Washington, DC 20229"
  },
  {
    "title": "Staff ML Engineer, Inference Platform",
    "company": "General Motors",
    "location": "Mountain View, CA",
    "salary": "$195,000 - $298,000 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0BqJjBsvJkVIRVupdyx-l7jJlkPL5nU6SVET5Mq4mDejegpz4R4z9X6QNcQ1GgqKr7EuADWGqYvBRzq43NhkCFXdNCv-kXJg0ZhgwFFZH1zM1NzECbM85HGWU8RWR0DVT2haaB2al-guEY2Pfpc_G7KU4AN0rCz3lvIhVMJDd37mc0kBmX3ZJKRyZ7Ry1kFRNJ0fKlvEMl4DRx7D-1pWP8xf3lHFFVbgyf74XHS2uL1L0eEfoJ3x0VFBYjKfzkYTeQFq7eOB46c7DyUHHwvzSM8DeFn7HxtmbQjID0O-wscaivCjt55PTXzagEHodpNsXA2-6eGaxAmGlkQNYoy9vTzNJuql9tx3cfgYFMtI7NWrd24iaXVkbnvyXy4bZ9tzfMhGg4l6cUn_v8HNMaFpc_hXTT_xlBJvgoj8yqkkNb7xpgmm23XkU2LaK6iNXixeButr2GpKLc1Dbnk0FGAQVG36vCUW8AWPAx969-0rj0Lbe4n8V4umMzqRFdgZ7vBN31E7AX8HvyC5PTp6aekbZAeADdwQj2h9BwjDt2Wt2lEWCdo6KA0K79kSc_xmZz-mvTD8v61A7CId924JRsNs7eT0WqCl6400Ps8be_ENL0GjgFmUh3NkvIGZ_7e4CkyLlcOf24k9HsI0XRKKr8MMbiCKZU16OBkdbNrBXdCS3XAe0fz1UzWc3I55qM5U0R74dQwWD-um8YF3YCuppLqLtgolFxU8bXStOCPLSVH7hrwkoMvzMS_Qk2njEMOQQtx4M6aW8EGpP-5V7zJLJwAAHFw6cVFEmdJWLY=&xkcb=SoCG6_M3sjCZAoQByh0DbzkdCdPP&camk=nUmJqO2E8rh8JLMt8M-EVQ==&p=8&fvj=0&vjs=3",
    "description": "Job Description\nHybrid This role is categorized as hybrid. This means the successful candidate is expected to report to the GM Global Technical Center - Cole Engineering Center Podium , MI or Mountain View Technical Center , CA at least three times per week, at minimum or other frequency dictated by the business. This job is eligible for relocation assistance.\nAbout the Team:\nThe ML Inference Platform is part of the AI Compute Platforms organization within Infrastructure Platforms. Our team owns the cloud-agnostic, reliable, and cost-efficient platform that powers GM’s AI efforts. We’re proud to serve as the AI infrastructure platform for teams developing autonomous vehicles (L3/L4/L5), as well as other groups building AI-driven products for GM and its customers. We enable rapid innovation and feature development by optimizing for high-priority, ML-centric use cases. Our platform supports the serving of state-of-the-art (SOTA) machine learning models for experimental and bulk inference, with a focus on performance, availability, concurrency, and scalability. We’re committed to maximizing GPU utilization across platforms (B200, H100, A100, and more) while maintaining reliability and cost efficiency.\nAbout the Role:\nWe are seeking a Staff ML Infrastructure engineer to help build and scale robust Compute platforms for ML workflows. In this role, you’ll work closely with ML engineers and researchers to ensure efficient model serving and inference in production, for their workflows such as data mining, labeling, model distillation, simulations and more. This is a high-impact opportunity to influence the future of AI infrastructure at GM. You will play a key role in shaping the architecture, roadmap and user-experience of a robust ML inference service supporting real-time, batch, and experimental inference needs. The ideal candidate brings experience in designing distributed systems for ML, strong problem-solving skills, and a product mindset focused on platform usability and reliability.\nWhat you’ll be doing:\nDesign and implement core platform backend software components.\nCollaborate with ML engineers and researchers to understand critical workflows, parse them to platform requirements, and deliver incremental value.\nLead technical decision-making on model serving strategies, orchestration, caching, model versioning, and auto-scaling mechanisms.\nDrive the development of monitoring, observability, and metrics to ensure reliability, performance, and resource optimization of inference services.\nProactively research and integrate state-of-the-art model serving frameworks, hardware accelerators, and distributed computing techniques.\nLead large-scale technical initiatives across GM’s ML ecosystem.\nRaise the engineering bar through technical leadership, establishing best practices.\nContribute to open source projects; represent GM in relevant communities.\nMinimum Requirements\n8+ years of industry experience, with focus on machine learning systems or high performance backend services.\nExpertise in either Go, Python, C++ or other relevant coding languages.\nExpertise in ML inference, model serving frameworks (triton, rayserve, vLLM etc).\nStrong communication skills and a proven ability to drive cross-functional initiatives.\nExperience working with cloud platforms such as GCP, Azure, or AWS.\nAbility to thrive in a dynamic, multi-tasking environment with ever-evolving priorities.\nPreferred Qualifications\nHands-on experience building ML infrastructure platforms for model serving/inference.\nExperience working with or designing interfaces, apis and clients for ML workflows.\nExperience with Ray framework, and/or vLLM.\nExperience with distributed systems, and handling large-scale data processing.\nFamiliarity with telemetry, and other feedback loops to inform product improvements.\nFamiliarity with hardware acceleration (GPUs) and optimizations for inference workloads.\nContributions to open-source ML serving frameworks.\nWhy Join Us?\nIf you’re excited to tackle some of today’s most complex engineering challenges, see the impact of your work in real-world AV applications, and help shape the future of AI infrastructure at GM—this is the team for you.\nCompensation: The compensation information is a good faith estimate only. It is based on what a successful applicant might be paid in accordance with applicable state laws. The compensation may not be representative for positions located outside of New York, Colorado, California, or Washington\nCompensation: The expected base compensation for this role is : $195,000 - $298,000 Actual base compensation within the identified range will vary based on factors relevant to the position.\nBonus Potential: An incentive pay program offers payouts based on company performance, job level, and individual performance.\n&#xa;&#xa;&#xa;&#xa;\nAbout GM\nOur vision is a world with Zero Crashes, Zero Emissions and Zero Congestion and we embrace the responsibility to lead the change that will make our world better, safer and more equitable for all.\nWhy Join Us\nWe believe we all must make a choice every day – individually and collectively – to drive meaningful change through our words, our deeds and our culture. Every day, we want every employee to feel they belong to one General Motors team.\nBenefits Overview\nFrom day one, we're looking out for your well-being–at work and at home–so you can focus on realizing your ambitions. Learn how GM supports a rewarding career that rewards you personally by visiting Total Rewards resources .\nNon-Discrimination and Equal Employment Opportunities (U.S.)\nGeneral Motors is committed to being a workplace that is not only free of unlawful discrimination, but one that genuinely fosters inclusion and belonging. We strongly believe that providing an inclusive workplace creates an environment in which our employees can thrive and develop better products for our customers.\nAll employment decisions are made on a non-discriminatory basis without regard to sex, race, color, national origin, citizenship status, religion, age, disability, pregnancy or maternity status, sexual orientation, gender identity, status as a veteran or protected veteran, or any other similarly protected status in accordance with federal, state and local laws.\nWe encourage interested candidates to review the key responsibilities and qualifications for each role and apply for any positions that match their skills and capabilities. Applicants in the recruitment process may be required, where applicable, to successfully complete a role-related assessment(s) and/or a pre-employment screening prior to beginning employment. To learn more, visit How we Hire .\nAccommodations\nGeneral Motors offers opportunities to all job seekers including individuals with disabilities. If you need a reasonable accommodation to assist with your job search or application for employment, email us or call us at 800-865-7580. In your email, please include a description of the specific accommodation you are requesting as well as the job title and requisition number of the position for which you are applying."
  },
  {
    "title": "Applied Scientist",
    "company": "Amazon.com",
    "location": "Newark, NJ 07102 \n(Central Business District area)",
    "salary": "$136,000 - $223,400 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0Bdd4o5uokT9skMYzkzH2dUVVc_sjS2wyLHOFjCY0bjoQL6hwmkNpRpBDbmB3vpb72VPe4WdLe5ONNNjCv8FP2PBLJlUKmQiTiKQhqD2SIjTl6tMngBIEpl49UXV445yBSyiFI4dlT-RNrclvR9g-P4jBeDAoPNgA5ouFH1zYdwppk35PE2fQQn-U4vzVWAH0_Tjvq65j-gNch-tRTSPMnaugHSiSrGXBYDjUwuASwyypGVeM6i7tj0hgT5zmzBiNtci20jG2DKsFff_6g6b2rhpUeyaq_buWVWJYAqEMTrqozNHg_OlNXM9UrXyiiHXTXSlmhQO-nceEB-VugLS9xyIi8MUKGOqdcH9IXVVzZy_FilzHzg1BzvVanknp30SsETOf3xSO0APgnaxqckPc_cscVtTcD20mP4JbhX-G6aIkCMOj9ElC6tkF_82oOi3pt58zj800E6DUi5CMfKVKEnBSbr6AbbRHortPnlXoIMQ3GNUvv3EILQeiVdk8AwaUKQvyGSROHhPX31VhzB0HqbzBFYswrEKUFu-fA-7QC1Ggh1WoqrofKWtXdvZuf0cM-AF8445-K4E6aHavVAN0snAAmEIlR38bcp1GvPi2GxdjG9t4QgSpOFjtIhSOTsPDmvbsmlLoiQTJxTtMus70Jn4hCotAePYqnWBS5HpOXawaPxu4ZMJCVU0bC_BLXKv2djCibPr9fkC9j453_EufzyhTdxumtHSvUNr7iigEQuw01K2Zr9C7CvsBir2MnsZg4ZCMQITt0zpWO0-F49Ufh_68VwaV-hfCqgbSfOuXnueTexM7UzU90PjJ6dkZY2Iek=&xkcb=SoCv6_M3sjCZAoQByh0BbzkdCdPP&camk=ethIe0s0hefAC4tk7PZjlw==&p=10&fvj=0&vjs=3",
    "description": "At Audible, we believe stories have the power to transform lives. It’s why we work with some of the world’s leading creators to produce and share audio storytelling with our millions of global listeners. We are dreamers and inventors who come from a wide range of backgrounds and experiences to empower and inspire each other. Imagine your future with us.\n\nABOUT THIS ROLE\nAs an Applied Scientist on our Product Science team working closely with Customer Service, you will solve complex problems at scale by leveraging Machine Learning, Natural Language Processing, and GenAI to transform our customer support experience. You'll work on initiatives that reduce human-assisted contacts by developing smart routing systems, implementing intelligent data analysis, and creating AI-powered tools that anticipate customer needs.\n\nYour work will focus on key projects outlined in our strategic plan, including:\nAnalyzing customer feedback to optimize support routing and customer journeys\nDeveloping models to better identify specific customer needs and route them to the appropriate support channels\nSupporting AI chatbot implementation across multiple marketplaces and languages\nContributing to Help Center personalization efforts and integration with AI-powered conversational agents\n\nAs an Applied Scientist, you will...\nUnderstand customer service use cases and design/implement AI solutions that are scalable, efficient, and automated\nWork closely with fellow scientists and software engineers to build and productionize models that deliver novel, customer-focused features\nReview models and provide recommendations to improve customer experience while reducing operational costs\nDesign and deploy modeling techniques focusing on customer intent classification, self-service efficiency, and proactive support\nContribute to initiatives employing recent advances in AI in a fast-paced, experimental environment\nSupport our goal of achieving cost reductions through AI-powered automation\nAnalyze customer interaction data to identify patterns and opportunities for service improvements\n\nABOUT AUDIBLE\nAudible is the leading producer and provider of audio storytelling. We spark listeners’ imaginations, offering immersive, cinematic experiences full of inspiration and insight to enrich our customers daily lives. We are a global company with an entrepreneurial spirit. We are dreamers and inventors who are passionate about the positive impact Audible can make for our customers and our neighbors. This spirit courses throughout Audible, supporting a culture of creativity and inclusion built on our People Principles and our mission to build more equitable communities in the cities we call home.\nBASIC QUALIFICATIONS\nMSc +5 years of relevant experience, or PhD in Computer Science, Computer Engineering, Machine Learning, Data Science, Applied Math, or related quantitative field\nExperience understanding data structures, algorithms, and software development\n3+ years of experience in Deep Learning, Natural Language Processing/Understanding, or GenAI\nExperience in Python, SQL, and other scripting languages\nExperience in employing LLMs/GenAI to solve complex problems\nPREFERRED QUALIFICATIONS\nPhD +1 years of relevant experience\nExperience with customer service technologies or support systems\nBackground in conversation analysis, sentiment detection, or automated quality assessment\nExperience with AWS services (S3, SageMaker, EMR)\nFamiliarity with building recommendation systems or customer intent classification models\nExperience with Agile Software Development\nProgramming proficiency in at least one compiled language (Java, C++, C#)\nPublications in peer-reviewed conferences or journals\n\nAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\n\nOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $136,000/year in our lowest geographic market up to $223,400/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site."
  },
  {
    "title": "Lead AI Engineer",
    "company": "eNGINE",
    "location": "Hybrid work in Pittsburgh, PA 15222",
    "salary": "$170,000 - $240,000 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0CM72iPWblhTK_jhJfJxLWIuoC99VqbpyV49Itn1AUN0-11EOCsDA6xFVHfWd5WC8iTWHez18Dv9qKeORCSuv8lFf4xykmaoc5W92TFqjxQ4_cyIjt3Cq83iBD0Kv-8Pdt0X6mxhwJbXuNd3VOfHyN6iA--w-0jO9yPU4HFK2I9o7ClmayYIGuK5dFG6iSMhDY6z9_O8jvgT1X5Fwp6T3hTUJNQPpbdZ9aWEKX5f0IUpWDDcLRvsUaScZfzIzvtDVEY7QjBeDObBOcx-MIqmbV5cQxEyhYEXfqUA89clJUaQR_dI5lNTizgR3kgwsykviuMoNkzgY_KkVKF-mBpDo2Jv-rGo-Pr1n9L6WmrfdUE74gLUTwjpUNhfTIMq66G7I6ndUDeSVH72Zf7f72UVSlIGFgIeNLcccwCGXrWeUvZ0UIbQgunISMnSl_ir5XBZEkL7UgFDi2GLUVdQ_z1lk1G3YiWspTX1WGc-gv8kKUpjU46NgpN5Qp_tXCNhsrWCl9MAkT-O12z6tSEGyn8TWnDBmw3Wdca-ipLklVLJbZVXu0k5GlCM8DUFKFHWYWz1PXjmz88DU-g7gfnE61I3gAfonQLgZ2tK8ISErL-rZBbwhBcsm5wighhksP4oD8wxwmJmDZG39dHOED51n1F67bSnTMCDm2rfopgbwkaSbuNQXbBfpQnyKMI&xkcb=SoDh6_M3sjCZAoQByh0LbzkdCdPP&camk=CPChkbYSGj9JijBnvEVadw==&p=0&fvj=0&vjs=3",
    "description": "eNGINE builds Technical Teams. We are a Solutions and Placement firm shaped by decades of interaction with Technical professionals. Our inspiration is continuous learning and engagement with the markets we serve, the talent we represent, and the teams we build. Our Consulting Workforce is encouraged to enjoy career fulfillment in the form of challenging projects, schedule flexibility, and paid training/certifications. Successful outcomes start and finish with eNGINE.\neNGINE is seeking a Lead AI Engineer to support our customer, a healthcare technology company headquartered in Pittsburgh. This is a high-impact role where you’ll bridge technical excellence with business value — helping them unlock the power of AI for better patient outcomes.\nWhat You’ll Do:\nLead and mentor a small but growing AI engineering team (including hiring your first engineer).\nArchitect and deploy production-grade AI/ML pipelines.\nTranslate AI concepts for non-technical teams, ensuring clarity and adoption across the organization.\nCollaborate closely with leadership (COO/President, product teams) in a highly cross-functional, sleeves-rolled-up environment.\nStay ahead of the curve in AI/ML advancements and apply them meaningfully to healthcare.\nWhat We’re Looking For:\n6+ years in AI/ML roles, including 2+ in technical leadership.\nStrong Computer Science foundation (vs. pure Data Science track), or extensive experience with healthcare, pharma, claims, or patient data.\nAdvanced proficiency in Python, ML libraries (TensorFlow, PyTorch, Scikit-learn), and MLOps practices.\nHands-on experience with Generative AI models (prompt engineering, fine-tuning, integration).\nExceptional ability to explain AI concepts to non-AI stakeholders.\nA collaborative, adaptable leader who thrives in a mission-driven, fast-growing environment.\nNo C2C/sponsorship/relocation available for this role.\nApply today and see how eNGINE can make a difference in your career!\nJob Type: Full-time\nPay: $170,000.00 - $240,000.00 per year\nWork Location: Hybrid remote in Pittsburgh, PA 15222"
  },
  {
    "title": "AI and LLM Lead",
    "company": "Prologis",
    "location": "San Francisco, CA",
    "salary": "$135,000 - $190,000 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0DBm4QtmS_tO7F4ExG9Ds5f5nsu4-9nFZ9K27uUwc6si538yrBATtp1bRE9AYC4i17-8vyHHQkQvldHi_T3MqpZKt-Y5ECUqAVoYJhBv5C7UOVYp82_UEQJ6y7gJg3scin4Ns_m_WidcgaFhuyxvRvgBaLCyOBhEYcFPZX_sQV3K4CwQVbMvO_fnNC6r5jLjBa85InjpN4IP-wjdRKlXIDH53rqFatFqmGHQOk6hLyHs8wwoXt-oW7QgISZDvSvARQxFvxfIsARAdlMSUt0ptRidihHlXsNZ8dmoWDBbV8UsOLDT8grksf1uVRuT6RpVdccZ6Oxt8wsPaVyT2eRgGjubwUu4tAo3nO0eCJ4NYXNd1G0fQ-TougK-Kycl7i0n35-56Lj-QiLvIA2jKh6Y--0_Hqca1lpnrs-HkWodz0m6Eo6NFKPAewK58_Sq0DF6yckmPtYcGPc3VCNEGT2QAo5mdQf93U8RU6i7Ko41FvbvazDOTdJ0zW61dg4znFMlptqGqP2bE4OQlAKunbt0GSSInPxkk189iz89xrjXluDjhspeZZa6Xbb9WDcTLI0GvSKDC10A1UZT-iaPgBEEfih_4SM6uXvVNbp0hVdKNAQnOze0GVRv1Dd_s_oEfyT_Fzv6a8g4t1LPzevGBKFwgO23UQcPZnYjZVk-3MKf0BmH85PAT8QOTkQVtwVJmlyVtUFjevhZVwiVNZs99cbLPvADNsgA74KXsM=&xkcb=SoCV6_M3sjCZAoQByh0HbzkdCdPP&camk=4HOcmqOLYrBjm1Fgaj8OoQ==&p=12&fvj=0&vjs=3",
    "description": "At Prologis, we don’t just lead the industry—we define it with a 1.3 billion square foot portfolio and an annual throughput of approximately $3.2 trillion. We create the intelligent infrastructure that powers global commerce, seamlessly connecting the digital and physical worlds. From agile supply chains to energy solutions, our ecosystems help your business move faster, operate smarter and grow sustainably. With unmatched scale, innovation and expertise, Prologis is a category of one—not just shaping the future of logistics but building what comes next.\nJob Title:\nAI and LLM Lead\nCompany:\nPrologis\nA day in the life\nWe are seeking a highly motivated and strategic AI & LLM Lead to join our data science team. This individual will be responsible for identifying, designing, and executing AI-driven solutions, with a strong focus on leveraging large language models (LLMs) and generative AI to create transformative applications across business units. This role is ideal for someone who combines deep technical expertise with strong business acumen, and who thrives on building from 0 to 1.\nKey Responsibilities Include\nBusiness Use Case Translation: Collaborate with business leaders to translate strategic goals into AI opportunities. Engage with functional leads to clarify requirements, convert them into analytical hypotheses, rapidly prototype and iterate solutions.\nLead AI Project Lifecycle: Own the end-to-end process from ideation and stakeholder engagement to deployment and post-launch evaluation of AI and LLM initiatives.\nModel Development & Deployment: Execute the full data-science workflow—including EDA, feature engineering, model selection, validation, and monitoring—adhering to team coding and documentation standards.\nLLM Application Development: Design and implement LLM powered applications, tailored to solve real estate-specific challenges (e.g., lease abstraction, tenant communication, investment memo summarization). Craft prompts, fine-tune domain-specific models, or create retrieval-augmented generation pipelines that boost productivity or customer experience.\nDeployment & Monitoring: Work with MLOps and engineering teams to deploy models into production environments, establish monitoring frameworks, and continuously improve solution performance.\nCross-Functional Collaboration: Act as a bridge between product, engineering, data, and business teams to align AI solutions with user needs and technical feasibility.\nInsight Communication: Distill findings into clear narratives and visualizations; present recommendations to technical and non-technical stakeholders.\nTechnical Guidance: Provide peer mentorship, code and architecture reviews, and technical best practices to elevate the broader team’s capabilities\nContinuous Improvement: Stay current on emerging algorithms and tooling; propose POCs that can raise model accuracy, reduce latency, or lower cost.\nBuilding blocks for success\nPreferred\n3+ years of hands-on experience in applied AI/ML development (1-2 years with advanced STEM degree), with at least 2 years focusing on LLMs or NLP-related technologies.\nDemonstrated ability to convert business questions into deployable ML solutions and explain results to non-experts.\nProven success owning and delivering cross-functional AI/LLM projects from start to finish.\nExperience working in or supporting real estate, logistics, finance, or other asset-heavy industries is a plus.\nTechnical Skills\nProficient in Python (pandas, scikit-learn, PyTorch/TensorFlow, Langchain etc), SQL, and version control.\nSolid grounding in supervised, unsupervised, and deep learning techniques plus model-evaluation best practices.\nHands-on experience fine-tuning or integrating LLMs such as GPT, LLaMA, Claude, Gemini, etc.\nExperience with vector databases (e.g., FAISS, Pinecone), embeddings, and RAG architectures.\nSolid understanding of cloud platforms (AWS, Azure, GCP) and MLOps tools.\nHiring Salary Range of: $135,000 - $190,000. Salary and whole compensation package (bonus target) to be determined by the candidate’s location, education, experience, knowledge, skills, and abilities, as well as internal equity and alignment with market data.\nPeople First\nEach of us working at Prologis plays an essential role in the enduring success of our company. We value people who are decisive, courageous and adaptable. While we are one company, locations and departments operate with autonomy and accountability. Individuals take the initiative here.\nWhen you join Prologis, you work shoulder to shoulder with some of the top talent in the industry to do the best work of your career. Every employee belongs. Every employee contributes. Employees advance their careers here.\nAs a successful global enterprise, Prologis has never lost sight of what matters most, our strong belief that our people are the most important part of our business. And because of that, we provide a generous total rewards package and take a lot of time to focus on quality management and leadership development. People come first here.\nAll full-time roles in the US come with a robust benefits package which includes healthcare, dental, and vision insurance for employees and eligible dependents. Prologis also offers several other wellness, financial, and work/lifestyle-specific benefits. Our 401(k) retirement plan has a company match of 50% up to 12% of eligible compensation. We also offer generous PTO with a starting accrual of 22 days a year in addition to paid holidays and volunteer time.\nAll job offers are contingent upon successful completion of background verification. Prologis is an Equal Opportunity/Affirmative Action employer and all qualified applicants will receive consideration for employment without regard to race, color, religions, sex, national origin, sexual orientation, gender identity, disability status, protected veteran status, or any other characteristic protected by law.\nEmployment Type:\nFull time\nLocation:\nSan Francisco, California\nAdditional Locations:\nCerritos, California, Denver, Colorado, Milpitas, California, Newport Beach Office, Ontario, California, Toronto, Ontario, Canada"
  },
  {
    "title": "Manager Data Science",
    "company": "Capital One",
    "location": "Richmond, VA 23218 \n(City Center area)",
    "salary": "Full-time",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0C3j_zLGvpMLCdiZ0WC46XqVTA1VMZzOzKXPhAXwYlrNc2ZimNTpf2_4MHwNa_erOxvHOfTmPbncLtia2vydNgwuHgFPbq2sHfCWx7-alA-Zq8wJTV5U8k7OeMP2-5Cv-YV6QjEDRW581J_hXNNCOwL-qbkNKoGFvqeKMEBIoagn2hBhnlKz2tyvQk9K9Y9CrBINZJcpKHzARpMxeb7f9uyc5deV60CbaSJCobleYJTxl6UQ6Z22P17QIWa1LIxj9p-dHibdcLwB1XS0oWzDzVe0Gul6JUgjsTbr8_BbIEesgZ-tb1zi3Bgv1W4s47pigWd-Fcmjpen4BAVTLUiNaTomjpyakgyK9-0uOOUO4_NvVBKTRn9GDMkmw1Grqyi519hROe8K7MdPaF2ilgp8XRmJEKEXcaJvH36gyCxTayogsZ2H0Yp_Nh_T7hnjNWVpGoDtA9AXXfgatdjHCxoEFxQvxlYXMgYy_6Tu7b0W4eGgZHrDKhSXgkZLQPgeheoOpRVT_c-AoMg8vAa3wi5T2E0KXObSgfxsgY9CgVpevNBanlJdo-ZLmgCZWO2zFmGUjhTtDZXKUnBeptejrTU6a6Z7-iK6yqPXp_bfBnpvsgzKOl2YpSrlr9wAYg0tpMft31esCL3sTT8J_lfiSVvzYthQUJzeFfdwf1XbNMbTq6ytErfualPmmCfG4-hi84xfsgIZiDq6YcIRt5IdJG1Q0S3EZbTMvCiovS2wcFV5M8BCW5SUmHDmC5ssOAtaP4Q0SWHyOrEMmNE6vd2f9B9Cthau0P5uDIKZnrFpXmqmTVHgtH7Z6M5KU3u9C8E-qJPfcDhaQZxAY0QHsOpb6jSeJgUpcvuFt7ZidrqxZ7vnWo6wfHYC--DFShYDp1Oqo2NokuTue2t8uktSetu0SHC5JMeThRDNVN9gJoFbiyzHc1uixAPbMPSYjrm51HGjMDZ4GnDZX4aKwIZgUnu99iIuoVEqvWgh1LTfBIEFL4z_N-D_4iO4qxfU8tFMeWCHrE_XTxsljXrBTSt_9jJc2lmALMzv1oqLDe_UA0Hc8ZcarMG7crTLhi0rnk4YhpFDny-8CoRibjM0X3xYDd9HLqXdHBh7AACmdxuHbF-XLtzWwHENbxRGe9M3T7waK1kWnYKyYP1NbHCpF7IRqhim_i_uDfDHZ-SQmwjHEdykfGFJHlcYgqXs_f5GOKGZgAefBJOaGtLpkX4BPBSMidg-MhkDhPoSnqFjL9GYkimFITTIvIpBUC2yf9KR9iV3StRs6VVmdLfNS0dNwXtkZH7FlmTH01_&xkcb=SoB86_M3sjCZAoQByh0IbzkdCdPP&camk=4HOcmqOLYrByKel4K0fjog==&p=3&fvj=0&vjs=3",
    "description": "Manager Data Science\nManager, Data Scientist, Representation Learning for Customer Protection\nData is at the center of everything we do. As a startup, we disrupted the credit card industry by individually personalizing every credit card offer using statistical modeling and the relational database, cutting edge technology in 1988! Fast-forward a few years, and this little innovation and our passion for data has skyrocketed us to a Fortune 200 company and a leader in the world of data-driven decision-making.\nAs a Data Scientist at Capital One, you’ll be part of a team that’s leading the next wave of disruption at a whole new scale, using the latest in computing and machine learning technologies and operating across billions of customer records to unlock the big opportunities that help everyday people save money, time and agony in their financial lives.\nTeam Description-\nThe Retail Bank Customer Protection Data Science team has a relentless focus on innovation with a passion for improving customer experiences around fraud prevention. Detecting and preventing fraud behaviors as early as possible helps keep customer funds secure and enables the Bank to grow with confidence. Our team is constantly investing to improve and complement existing model-based defenses with the latest and greatest techniques from industry and academia. We often design features using SQL, python, and spark, and train models using a variety of python-centric modeling libraries. Data scientists often lead the deployment of these models in batch and event-based environments, and may additionally partner with engineering teams for deployments that interface with other real-time systems. The team is focused on giving our millions of customers comfort to know that their account is protected from attempts to take it over.\nRole Description-\nIn this role, you will:\nLeverage a broad stack of technologies — Python, Conda, AWS, H2O, Spark, Kubernetes, and more to build sequence models to detect fraud risk using deep learning techniques like transformers, LSTMs, and embeddings of tabular data\nConnect your deep technical modeling expertise to the pressing business goals of our fraud prevention strategy partners to create exciting solutions to demanding challenges\nProvide the engine to a research agenda with business opportunities at its heart\nPartner with a cross-functional team of data scientists, software engineers, business analysts, and product managers to deliver industry leading fraud defenses.\nPilot machine learning models through all phases of development, from design through training, evaluation, validation, and implementation\nThe Ideal Candidate is:\nCreative. You thrive on bringing definition to big, undefined problems. You love asking questions and pushing hard to find answers. You’re not afraid to share a new idea.\nTechnical. You’re comfortable with open-source languages and are passionate about developing further. You have hands-on experience developing data science solutions using open-source tools and cloud computing platforms.\nA data guru. “Big data” doesn’t faze you. You have the skills to retrieve, combine, and analyze data from a variety of sources and structures. You know understanding the data is often the key to great data science.\nA leader. You challenge conventional thinking and work with stakeholders to identify and improve the status quo. You’re passionate about talent development for your own team and beyond.\nBasic Qualifications:\nCurrently has, or is in the process of obtaining a Bachelor’s Degree plus 6 years of experience in data analytics, or currently has, or is in the process of obtaining a Master’s Degree plus 4 years of experience in data analytics, or currently has, or is in the process of obtaining PhD plus 1 year of experience in data analytics, with an expectation that required degree will be obtained on or before the scheduled start date\nAt least 2 years’ experience in open source programming languages for large scale data analysis\nAt least 2 years’ experience with machine learning\nAt least 2 years’ experience with relational databases\nPreferred Qualifications:\nPhD in “STEM” field (Science, Technology, Engineering, or Mathematics) plus 3 years of experience in data analytics\nAt least 1 year of experience working with AWS\nAt least 4 years’ experience in Python for large scale data analysis\nAt least 4 years’ experience with machine learning and specifically deep learning sequence modeling architectures\nAt least 4 years’ experience with SQL\nCapital One will consider sponsoring a new qualified applicant for employment authorization for this position.\nThe minimum and maximum full-time annual salaries for this role are listed below, by location. Please note that this salary information is solely for candidates hired to perform work within one of these locations, and refers to the amount Capital One is willing to pay at the time of this posting. Salaries for part-time roles will be prorated based upon the agreed upon number of hours to be regularly worked.\nMcLean, VA: $193,400 - $220,700 for Mgr, Data Science\nRichmond, VA: $175,800 - $200,700 for Mgr, Data Science\n\nCandidates hired to work in other locations will be subject to the pay range associated with that location, and the actual annualized salary amount offered to any candidate at the time of hire will be reflected solely in the candidate’s offer letter.\nThis role is also eligible to earn performance based incentive compensation, which may include cash bonus(es) and/or long term incentives (LTI). Incentives could be discretionary or non discretionary depending on the plan.\nCapital One offers a comprehensive, competitive, and inclusive set of health, financial and other benefits that support your total well-being. Learn more at the Capital One Careers website. Eligibility varies based on full or part-time status, exempt or non-exempt status, and management level.\nThis role is expected to accept applications for a minimum of 5 business days.\nNo agencies please. Capital One is an equal opportunity employer committed to diversity and inclusion in the workplace. All qualified applicants will receive consideration for employment without regard to sex (including pregnancy, childbirth or related medical conditions), race, color, age, national origin, religion, disability, genetic information, marital status, sexual orientation, gender identity, gender reassignment, citizenship, immigration status, protected veteran status, or any other basis prohibited under applicable federal, state or local law. Capital One promotes a drug-free workplace. Capital One will consider for employment qualified applicants with a criminal history in a manner consistent with the requirements of applicable laws regarding criminal background inquiries, including, to the extent applicable, Article 23-A of the New York Correction Law; San Francisco, California Police Code Article 49, Sections 4901-4920; New York City’s Fair Chance Act; Philadelphia’s Fair Criminal Records Screening Act; and other applicable federal, state, and local laws and regulations regarding criminal background inquiries.\nIf you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation, please contact Capital One Recruiting at 1-800-304-9102 or via email at RecruitingAccommodation@capitalone.com. All information you provide will be kept confidential and will be used only to the extent required to provide needed reasonable accommodations.\nFor technical support or questions about Capital One's recruiting process, please send an email to Careers@capitalone.com\nCapital One does not provide, endorse nor guarantee and is not liable for third-party products, services, educational tools or other information available through this site.\nCapital One Financial is made up of several different entities. Please note that any position posted in Canada is for Capital One Canada, any position posted in the United Kingdom is for Capital One Europe and any position posted in the Philippines is for Capital One Philippines Service Corp. (COPSSC)."
  },
  {
    "title": "Principal Predictive Analytics Engineer",
    "company": "Butterball",
    "location": "Garner, NC 27529",
    "salary": "Full-time",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0DuIJXOAuw79uM3U76VaF2NMNMKTb9YIr04Gchrq7l0hxSTCZM5vFKNjNTy7nNjcVrbMN2Vd_WhvjgqDpm1QZocvesDGg0-5Q3gC32KyM-C_i1azKgtouXWkfhEBoQp6xXbDQ19g4HmhoOfznycWULV9HgGFUmoAexNPBGrIRWfFvw767EeWPBMkYtZv122ZCEgA1J-1Bo7YzGyYP2NRTCb_bRZ7AemN9lKOSfhuXzRELrVFJf-_TMAZJG7_YvdmhdFsq-QKocmeoRE7snZujzO50Zs2ZxIGiQLFiNXtUIIRGhUn4nyAYlwt9vZ6G6Cn4BTc3LH2tgtSR2OFqx7_SRdVKF4bXQEpCNW-_AFfYj_zLeE1adliVSPuElnzoBXur7fRJg5ZRQNmJWKcdfUQV_M0JVyPsJb6v9Fh051pjOmvj64WPWAzX4RSqY8ZcnSGp83O9pojDHPP7dgDgF5nnvlYgmphWT-_mP0F9tpC6i63Z_Vc2N7q9mr0-BooGybyIVsF2F-o_G_HQPVzog5UQ-bCpdM5bSwiZihiJO9Y3M1sOi1UDP8ip3nXdaoLJo8VCFEJCnPTWeZsvCgAuhVtSlPDT3J-w3eFPySIvy6qJ-Os6JBGA7cSJ4hJnkigkY4rMWunDzK9Vhghja3P9wfMlbj__bsnJL2bj4J_BD1qbzlsLraPXo5bI0OviQpwlvEjPljGLpXqwZ5S34jtNXoHOrhaoAw-XPHm5hxtJpk9PZHhh9Mhg33EhFKlD5AiTVK9BFb7NN-ecaLrs5vLb9nKn4pv8IM7xlPa0Z5QxFFx6z2UFKkVtg7eHltKuRFxkAIggz8iC1Ej15JUEVFfnoTcbCl8QWT5rjyXxyr930yRpGmUyEHGvOfUqlhOgod0PcASw1kh5LhPVBQ33A-h_dsNQNenU8QWPV2PR7KLShdD7TO3lrM6GpsYS6DbT4zBuZoLQursQZKwZ4jnTZ2KS0lJQb3GBtcU2hyDwzMdoMJBStwrhqypGSi1aXesIUu_2j94gR1GXmGWcOTfRIuD2X5jaM8MnXNfffKM_dFyJ-WboMKM30g_IqH8z3yisNN_Koh7RjF9kaGcszyuVpL9_W7INk3L4T8X50oG9FQ_Riv4rHoELvB9eiLRVgQrMOUnSbI_UvABRjy2iI7vGkPQegejUn8WLZPPM2sK_PMVgKqo2Q0zQ==&xkcb=SoBG6_M3sjCZAoQByh0ObzkdCdPP&camk=4HOcmqOLYrCYK11L9YulsA==&p=5&fvj=0&vjs=3",
    "description": "Butterball, LLC, one of America’s most iconic brands, helps consumers celebrate Thanksgiving and every day in between. Located in the thriving Raleigh-Durham, North Carolina area, our goal is to provide a diverse array of career opportunities and paths which include our farms, processing facilities and support offices. We are the largest producer of turkey products in the U.S., and we make a lot more than Thanksgiving turkeys. Our company’s measurable growth is in no small part due to our team members in North Carolina, Arkansas, Illinois, and Missouri, who each have a seat at the table to contribute to our success\n\nJob Summary\nThis is a role that combines advanced machine learning research with strategic business analysis, bridging technical innovation and business insight and enabling scalable AI applications and actionable analytics. Develops intelligent solutions that enhance decision-making and operational efficiency across the enterprise. Enables smarter services and informed decisions for our business community. Helps design, deploy, and monitor data pipelines, predictive models, dashboards, and internal AI tools with emphasis on data analytics and machine learning. Collaborates with departments to unlock the value of unstructured data while ensuring transparency, ethics, and equity in AI use. Responsible for strategic and tactical areas, focusing on the high-level design and vision of the predictive analytics ecosystem while building and maintaining the infrastructure and systems that support predictive models in production.\n\nKey Responsibilities\n1. Designs and implements machine learning models using R, Python, TensorFlow, and Azure ML.\n2. Conducts research on and supports experimentation with AI methodologies including NLP, computer vision, and generative models.\n3. Analyzes complex datasets using SQL, Power BI, and Excel to uncover trends and opportunities.\n4. Collaborates to define requirements and translate them into technical solutions.\n5. Documents methodologies, findings, and recommendations for technical and non-technical audiences.\n6. Gathers data from internal and external sources to store in the business data lake.\n7. Analyzes structured and unstructured data to uncover insights that support operational and strategic goals, including supporting use cases related to IoT devices and measuring points from the production lines.\n8. Operationalizes predictive models and integrates them into the company's operational systems.\n9. Designs and maintains robust, automated data pipelines (ETL/ELT) that collect, transform, and move data to be used for predictions.\n10. Implements best practices for the full lifecycle of machine learning models, including deployment, monitoring, and retraining.\n11. Manages infrastructure of cloud and big data technologies (e.g., Spark, Hadoop) to ensure predictive systems are scalable and efficient.\n12. Ensures the integrity and quality of the data that feeds into the predictive models.\n13. Develops dashboards and self-service analytics using tools such as SAP Analytics Cloud (SAC), Power BI, and other supported platforms.\n14. Partners with departments to interpret data and tell compelling, actionable stories. Builds future predictions based on current and past data.\n15. Supports data governance practices, including metadata standards, data quality monitoring, and data lifecycle management.\n16. Works cross-functionally and across all Butterball IT areas.\n\nMinimum Qualifications (Educations & Experience)\n1. Bachelor’s degree in related field (i.e., data science, Business Analytics, Computer Science, Statistics, etc.) or equivalent\n2. 8+ years of relevant experience or the knowledge, skills, and abilities to succeed in the role\nKnowledge, Skills, and Abilities\nButterball Core Competencies\nCaring about people, valuing contributions, and empowering to succeed is the Butterball Way. We recognize the value that different perspectives and cultures bring to Butterball and seek to create an environment where everyone can thrive. Everyone has a seat at the table and is expected to embody our core competencies:\nSafety First: We put safety first. The health, safety, and well-being of our people, products, and turkeys is everyone's responsibility and everyone's jobs.\nIntegrity: We trust each other to do the right thing. We act with integrity and gain the confidence and trust of others through honesty, respect, and authenticity.\nStewardship: We take care of what matters. We are accountable to our commitments and take responsibility for the well-being of our teams, our quality, our customers, our business, our brand, and our communities. We are always answerable for our actions and those we lead.\nEnthusiastic Attitudes: We create a climate where everyone feels they belong and can be engaged, every day. Where our people are enthusiastic and motivated to do their best and work together to make great things happen.\nContinuous Improvement: We are committed to continuous improvement. We challenge ourselves and our company to constantly learn, develop, grow, improve, and innovate.\n\nEssential Knowledge, Skills, and Abilities\nAmple experience in data analytics, AI modeling, machine learning, business analysis, and business intelligence tools\nDeep business acumen, gathering and analyzing data from multiple internal and external sources, as well as from various business areas\nStrong foundation in statistics, optimization, and data modeling\nProficiency in R, Python, SQL, and BI tools (Power BI, Tableau)\nExperience with cloud platforms (Azure, AWS, GCP)\nExcellent communication and client/partner engagement skills\nAbility to manage multiple projects and prioritize effectively\nFamiliarity with Agile or Scrum methodologies\nPreferred Knowledge, Skills, and Abilities\nMaster’s degree in data science, Business Analytics, Computer Science, Statistics, or related field\nExperience with LLMs, reinforcement learning, or enterprise AI applications\nExperience with SAP, Azure Data Factory, or enterprise data platforms\nPhysical Demands\nWhile performing the duties of this job, the employee may be regularly required to stand, sit, talk, hear, reach, stoop, kneel, and use hands and fingers to operate a computer, telephone, keyboard, and occasionally lift up to 15 pounds. Specific vision abilities required by this job include close vision, distance vision, depth perception, color vision and the ability to adjust focus.\nWorking Conditions & Travel Requirements\nWork is performed in a climate-controlled office environment with the option to work remotely periodically. For remote work, the employee must have a dedicated workspace to safely setup and use assigned IT equipment, preferably free from distractions. The employee is responsible for ensuring adequate internet service is available when working remotely (the recommended minimum speed is 20mb download and 5mb upload).\nThe noise level of the environment is usually moderate.\nMinimal regional travel may be required.\nDisclaimer\nThe statements herein are intended to describe the general nature and level of work being performed by employees and are not to be construed as an exhaustive list of what is required of personnel so classified. Furthermore, they do not imply or establish a contract for employment and are subject to change at the discretion of the employer. Butterball, LLC is an equal opportunity employer and is committed to the fair and impartial treatment of all employees and applicants for employment without regard to gender, age, race, religion, color, national origin, physical or mental disability, military/veteran status, sexual orientation, gender identity and expression, genetic information, marital status, parental status, pregnancy, or any other status protected by law. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions of this job\n\nWe embrace equal opportunity employment. Butterball is committed to the fair and impartial treatment of all employees and applicants for employment without regard to gender, age, race, religion, color, national origin, physical or mental disability, military/veteran status, sexual orientation, gender identity and expression, genetic information, marital status, parental status, pregnancy, or any other status protected by law. This position is deemed Safety Sensitive for purposes of Butterball’s Drug/Alcohol Screening & Testing Policy. Details will be provided to individuals who receive a conditional job offer, or upon request."
  },
  {
    "title": "Technical Animator",
    "company": "8K Solutions",
    "location": "Hybrid work in Titusville, FL 32780",
    "salary": "$50 - $75 an hour",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0CgaPYZSmS6ALsVTwdrNG-VSTJocjBQrJ97YBtKKqoLwCDzkQeN-uRyAav0hKaeS0CM35VVfKb4E3JvM6dbIb0zV0rjauW4FuBW8_ssZiP-lZuVon3nnWAASml5myh0RYAct85qjvRA4i74xHR1y5aMUiXoyWi6S4-OMFxqP71NiazxgWqPxctM7i6MA-IUBsjR7ryq593dRRlPKjknF_6Wgoumv_ChmS6ECiV2eFb0Q9qRg8ay8Q7aoNrAzou4O2uFs4454ojq4Ey3LMW1hbK00JeedmW5VdtYNr-NH3DZ18ObJ0TRD35o0R1pEXtZOXPe3B2mzLW6FKvZvd-yB53t_2Ff9Bxwo37y5gc9hKxjTXaRiidoZ8IwFo_M5Lyoi5jkQtlEayxO4fEwk72kQJH8MRFbtIqmCZVORRkZOh1fOb_wwoNdTJOsXKrb9GgB7-xwlyrkaDlRF3_NPFNEdRv3pEW31my7G-mIwoMMEAtlzkCCKfT6Ds11kjxya9Rvw3FyxXQnTrQbaDqb17NTEvSEo83ndVQHmxWBd52MuXI7kPCQSKSJoxxj9MliO4T2CUfgTIiLQRxDKOq7mJoykNnORCqjxVMWZfBLcS7tKAXxT3g5o77tzvPibjMsOZh_c5K8xuYcrKhssM-yiphgynA7&xkcb=SoC86_M3sjCZAoQByh0FbzkdCdPP&camk=UoKtGZLa3XIEVm6QSuYc3w==&p=14&fvj=0&vjs=3",
    "description": "8K Solutions, located on the Space Coast of Florida, leverages our combined experience in sports video technology, and long-term relationships with elite coaches and athletes, to make us the optimal partner for a vast array of coaching video requirements. 8K Solutions provides a unique variety of new and established technologies for these partners, ranging from practice acquisition solutions to player and team development visualization tools.\nWe are currently expanding our Software Engineering department to include full-time support with the animation characteristics of our 3D Playbook. The ideal candidate has a proven track record of building and maintaining high-performance animation pipelines in Unity.\nRequirements for this position:\n· A proven, deep knowledge of football, including its rules and positions.\n· Experience with motion capturing (mocap) (especially cleaning).\n· Experience with Maya or Blender, specializing in rigging, skinning and animating.\n· Proficiency with Unity's Animation System and Playable Graphs\n· Good understanding of C# scripting and plug-ins within Unity3D Engine to help improve the animation pipeline.\n· Experience with Unity Animator Controller state machines and blendtrees.\n· Experience importing and exporting animations from DCCs such as Blender or Maya\n· Excellent communication skills to provide technical feedback about the tasks, rigs, toolsets and documentation.\n· Strong demonstrated work ethic and self-motivation.\n· Passion for working at the intersection of sports and technology.\n· Bachelor’s Degree in Computer Science or related field, plus 3+ years directly related technical Animation experience.\nResponsibilities of this position: `\n· Direct talent during mocap sessions to capture authentic performances.\n· Work with a team of developers and animators to skin, rig and animate player characters (football, hockey, basketball, etc.) and props (stadiums, scoreboards, benches, etc.)\n· Utilize expertise in state machines and motion matching to create seamless and dynamic in-game animations that deliver high quality assets with high realism.\n· Provide clean assets following established standards in systems and requirements.\n· Work in an Agile Software development environment with the ability to take task ownership.\n· Work with animators and developers to execute projects on time.\n· Participate in code reviews, provide constructive feedback to the engineering team.\n· Problem-solve all things animation and gameplay systems, helping the team no matter where in the pipeline.\n· Accurately estimate effort required and deliver quality results.\n· Stay current with the latest animation technologies and trends, incorporating new tech like AI, ML, VR/AR, etc. into projects.\nAdditional Experience Preferred:\n· Basic knowledge on version control systems, preferably Git.\n· Good understanding of anatomy and character movement.\n· Familiarity with Unity3D Engine art production pipelines.\n· Experience in debugging and testing software.\n· Experience with animation techniques such as motion matching, procedural animations and inverse kinematic (IK)\n· Knowledge of facial rigs to add emotions to characters.\n· 3D Modelling experience\n· Good knowledge of Shader Graph / VFX Graph\n· Familiarity with Character Creator, SkinGen, Marvelous Designer, Zbrush or similar modern character pipelines to create AAA quality game characters.\n· Experience optimizing animation performance for mobile platforms\nJob Type: Contract\nPay: $50.00 - $75.00 per hour\nExpected hours: 35 – 40 per week\nWork Location: Hybrid remote in Titusville, FL 32780"
  },
  {
    "title": "",
    "company": "",
    "location": "",
    "salary": "",
    "url": "https://www.indeed.com/viewjob?jk=a1b2c3d4e5f67890",
    "description": "None"
  },
  {
    "title": "Physical Therapist (AI Documentation)",
    "company": "California Rehabilitation & Sports Therapy",
    "location": "Fountain Valley, CA 92708",
    "salary": "$85,000 - $115,000 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0DKBuQORlrCWO8bfP0DCAsSt8SIWuUowKVUVHpTwdZehqHI2lhhvlqGmmyE4KqfIWRCjN4rhp8JoGUd_yJxhNXZV8kecpBAbviNRFDYowTM47dQA1Eqy_2h0gMNtIpMvX9a8q6U8kEx53RcsHPrh7b_YQfqFJmoRgTRym36meaWxuEzGZMwJ9YQo9sfPcPoI6HtM7SqeMQKb_u7_cy9P2ylcMElCKOT78d-3LXqFWwyzRkjW8Al69NkqcDtCY2S8nF5uYnmKFZ6G45t5QB1URIyfsTBevjClASrAcunTGyA8ZBkOFU5Jb3DEVP1yr8eQsnBIzAnSk5Ea9XKVqQxNMSgO_tD7ROgeSiH8P_k3qz2j9mn4Q9Oa7PBISwhpDeWw1GL5w7-AoV0P0PFFoyT1T5NL051OqrdVhOGJLrhOuCAgnll-Ps3sH7zece8q32vlcVgP07nUh1UHxnJNDuusiVXq9VgwKERp3D72VGs7wmUbxjk53ESWP7fX3bDhpdOT4U0KvpvCt9_tUv15k3oeUlaaI-Pc_Bp-kkA5kTvb98qEax5ENxI9uBks8T2BmaNWmvF0Z-LaVFIahsbvL9qZcP1Y2_4ngIDEl7Ojvm4tr2HTWH2xOysQ4xTrV7wnE5iI6gwT__Ol4ZrfWLzdzfA2qSdHsNmBJQqJP72gC6xgS3cmd_tVmbVD3TYFQLG083zABUp3KUzVDMFR4tQ80SG2PFxgtdcJ9XXan0vGo0zdtCaNQ==&xkcb=SoC76_M3sjCVyYQpUp0DbzkdCdPP&camk=UoKtGZLa3XLbyGgwkM1UMQ==&p=8&fvj=0&vjs=3",
    "description": "Physical Therapist - Outpatient Orthopedics - California Rehabilitation & Sports Therapy – Fountain Valley / Huntington Beach area\n\nLocation: 11420 Warner Ave, Fountain Valley, CA 92708\nWhat We Offer:\nCompensation Package: $85,000 - $115,000+\nFeaturing updated Productivity Incentives that reward you for patient care access, giving you more control of your own compensation!\nComp package based on job-related factors such as location, experience, and incentives\nSign-On Bonus or Student Loan Reimbursement Available\nFull-Time Position with flexible weekday scheduling\nWe’re proud to offer Ambient Listening Technology—an AI tool fully integrated with our EMR that reduces documentation time by 80–90%. It intuitively distinguishes between patient and provider voices, automatically capturing the patient’s input as subjective notes and the clinician’s as objective findings. The system even generates goals, performs CPT coding with over 90% accuracy, and simplifies the entire process so you can focus on what matters most: your patients. In today’s insurance-driven environment with endless documentation requirements, this technology is a true game changer.\nComprehensive Benefits Package:\n3 weeks of paid vacation + 7 holidays + sick time\nHealth, dental, vision, and life insurance\n401(k)\nHealth Savings & Flexible Spending Accounts\nClinical Residency Program & Professional Mentorship\nContinuing Education support + unlimited MedBridge access\nEasily achievable incentives to boost your earnings\nEmployee referral bonus program\nSupportive work environment and career development opportunities\nAbout the Role:\nAs a Physical Therapist at our Cal Rehab clinic, you’ll work in a collaborative outpatient setting focused on delivering high-quality, evidence-based care.\nQualifications:\nGraduation from a physical therapy curriculum approved by the American Physical Therapy Association.\nCurrent State licensure for the practice of physical therapy.\nWhy Choose Us:\nWith over 250 clinics across 16 states, and beyond 1700 teammates, we are a trusted ally to practice owners, employees, and clinics as they provide industry-leading care to patients across the country. Our core values are focused on priorities that provide measurable value to our patients, partners, and employees:\nEnsuring Accessible and Scalable Care\nMaintaining Trust\nSupporting Your Growth\nOffering Personalized Solutions\nExpanding Opportunities\nImproving the Lives of All\nIf this sounds like your kind of place, apply today. Let’s talk about making this your next (and best) career move.\nWe are an equal employment opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, national origin, disability status, protected veteran status or any other characteristic protected by law.\n#INDHC"
  },
  {
    "title": "BCG Platinion | Lead IT Architect, Public Sector Industry Leader (Defense & Security, Civil Sector)",
    "company": "Boston Consulting Group",
    "location": "Boston, MA",
    "salary": "$190,000 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0Ad1FFWZOsBBwBZDGouyCcICeLSd3pQct3wJ1q5dPO7JFVPHQCPeUZaOKDphyF3FNIVr5aOaeVQfrMVVlJY2YuqFONvDL8ktVuVewjRBDU1IOORar-xzBRP47qWksjoS6mgPR0MUkTFkLXhF_EfcgdGZqG22HsIh0aJZyijTenRupuy1ZHJMSo21Qq9bmOvP5eJ4-XcyxqGZ__GkVju_-2IIo8GfrofuiIOGf9B-mkBcMiGSw7TgXRE2oGdjzDcNTTupkE6tGlTv-urgvj_EaxF3xIV1JFRlC6A3HLxwpKGNNna4AuQ8GMdz5sXb_uZAkbg-PZfesFOCUlt1irwci7-Aij597UahV1D7hwJc_9dWvIulJza9HtjkG10m5LBRnn4Ei5boT7-zvFH7CjxH4_R2sysdWfABDxSJir0Sj-CzwBDU-48RVS1MlCNiS-9chmtA7_jwSY7WEPKgrJPxLx8wpV3616TuquC-xZtx8Q9cRQtl7KULpbym1s1Ap_RGwm6M0JhDB_tM9BqxU3KA47R25K0RfFaMgCfGZu8q6AZQECLhcwaPipHc3b6LLFrLW6ZJk5wckny9dw3WYpcwFz3tiC3DlIAQuQinx2IDV6g3MM4rBRfF4aFZcuzNC4hT8Rtp-Q7a_-CrBAT7_JmBXa9y6O5DUsfgVaHq517idec1VapvlVundo2tj9wcrFYhnwOvpzX_iyjs6NL50zXFMKMNTSetAJLuJKnAdIQ3S0LfdHWTQqMgojr5sbiSGLJjh1Sqg-byIFXCz4Tb5nlqV0VRxedJZ3CVNr3takQB8zSF3IWLPdjv3yq8DLf1t8SHC1w3zcZNESsBNP-wRFC_eEDquVYM8jpklp6DPChpxdx8oinVWKr-GXwznopQlr6-uCeq27gnMfyZw8DD_Ab16yUzBCXfqfWoJnrQNntl8r_RX1SsjyhpK0NAeEKSArSNgRLsRkCvEFwYFYmy8lrojNOJQxuTPwIBGJgF1rZF6H0MSCMZlZiG70QfqeFV8VJ7jzpXqcU-rzmx3PJZRZPy-FQVTwBjg_e68_SACXOWfJXoIGjdJnRYVJDYiif2uktr6ON9WkQihU6AKKa0zu4m68urcloUKOhL3syiHHDBhCuCN3nAQC4LAKCSvQFl2YzsH9n9aBJFLCp40hS-3yX5r0QV4qwRn8y8DczUhdREiAOQLe-TrY3kGAteutvG9lnTshDInTESwI6mt9t6iqHorwakixK5T-ZBzqO4o_Q8V91JVN_oru_N66prNpqEncY3IKNO0W1Jtt_vo59pztfzTr72_FGvL9s19AbgTiB5VcslfOeko9aGb-4CLMRz24MKyiATN4aDbpmIYCJo-XMPDpPweKz0JJI1QArdJAkwvKxLT8t4S1AsLP7qPdtSNsJWIiKGIh378fERyVcqtdTTJ0pQnWpQJj2l4qr1ylBP7hlIoIdiG8UKyHWwpqDbIGMgjQwNirqDL2yaCStOVeTjAuZN_yXUsXPEtodfOYzvq19EbHFQtozt9IzAuaiTyHn4oA=&xkcb=SoCS6_M3sjCVyYQpUp0BbzkdCdPP&camk=UoKtGZLa3XLa1xrFUUISuw==&p=10&fvj=0&vjs=3",
    "description": "Locations: Atlanta | Austin | Boston | Brooklyn | Chicago | Dallas | Denver | Detroit | Houston | Miami | Minneapolis | Nashville | Summit | New York | Philadelphia | Pittsburgh | Durham | Washington\nWho We Are\nBoston Consulting Group partners with leaders in business and society to tackle their most important challenges and capture their greatest opportunities. BCG was the pioneer in business strategy when it was founded in 1963. Today, we help clients with total transformation-inspiring complex change, enabling organizations to grow, building competitive advantage, and driving bottom-line impact.\n\nTo succeed, organizations must blend digital and human capabilities. Our diverse, global teams bring deep industry and functional expertise and a range of perspectives to spark change. BCG delivers solutions through leading-edge management consulting along with technology and design, corporate and digital ventures—and business purpose. We work in a uniquely collaborative model across the firm and throughout all levels of the client organization, generating results that allow our clients to thrive.\n\nAbout BCG Platinion\n\nBCG Platinion's presence spans across the globe, with offices in Asia, Europe, and South and North America. We achieve digital excellence for clients with sustained solutions to the most complex and time-sensitive challenge. We guide clients into the future to push the status quo, overcome tech limitations, and enable our clients to go further in their digital journeys than what has ever been possible in the past. At BCG Platinion, we deliver business value through the innovative use of technology at a rapid pace. We roll up our sleeves to transform business, revolutionize approaches, satisfy customers, and change the game through Architecture, Cybersecurity, Digital Transformation, Enterprise Application and Risk functions. We balance vision with a pragmatic path to change transforming strategies into leading-edge tech platforms, at scale.\n\nWhat You'll Do\nAt BCG Platinion, we’re bringing design to the front line of business challenges, creating work that solves problems in novel, feasible, and desirable ways. Our team applies a discovery-driven approach in order to create innovative and exciting end-to-end experiences at the intersection of people and technology. As a Lead or Principal Architect, you will collaborate on interdisciplinary teams of designers, engineers, researchers, technical experts, and consultants to develop leading IT concepts and architectural solutions. In this role, you will apply your sound technical know-how, understanding of business contexts, and analytical skills to enable organizations to technically transform.\n\nNOTE: This role is specifically seeking a leader to serve primarily in the US Public Sector as part of BCG Platinion’s Architecture practice, but also open to commercial and private sector engagements where required.\n\nIdeal candidate requirements given client and contract / portfolio requirements include US Citizenship, active security clearance or ability to obtain a security clearance (e.g. DoD Secret / Top Secret), prior expertise with portfolio and project management of US federal government agencies in a technology consulting context is preferred.\n\nLead IT Architects at BCG Platinion are:\nTechnical experts. They are critical thinkers and have extensive IT expertise that drives novel solutions routed in complexity.\nComfortable with ambiguity. They know the path forward isn’t always well-defined. They are comfortable and confident working through the unknown.\nChange agents. They know how to make change happen across an organization. They can align and onboard teams to implement new processes and toolsets. They embrace complex challenges and guide an organization to optimize IT best practices.\nAgile advocates. They are well-versed in agile methodologies and use their expertise to strategically tackle difficult challenges and implement change.\nCollaborative. They are interdisciplinary team players who seek alignment and establish relationships ranging from cross-functional stakeholder groups to existing teams.\nInnovative. They are creative thinkers who apply their deep IT architecture expertise to envision novel design patterns for the next generation of technology solutions.\nKnowledgeable. They have a sophisticated understanding of IT Architecture, acting as a viable resource on teams as both a hands-on practitioner and subject matter expert.\n\nWhat You'll Bring\nBachelor's Degree in information technology, business administration, computer science, business management, or system controls & engineering or a related field.\nMaster's Degree in related fields not required but preferred.\n6+ years of professional experience in software engineering with more than 4 years in architecture discipline.\nSuperior technical knowledge, engineering rigor, and creative problem-solving.\nAbility to explain complex technology topics to senior executives.\nExtensive technical expertise and knowledge of:\nVarious technology stacks\nMainframe architecture (nice to have, but not must)\nCloud native applications and cloud services architecture\nOmnichannel architecture\nIntegration methodologies and tools\nAPI and Microservices architecture\nStructured and unstructured databases and usage patterns\nHigh-speed, high-volume, high-frequency transaction processing systems\nReal-time logging, monitoring and resiliency approaches\nDisaster recovery and business continuity planning\nNext gen capabilities (e.g. AI/ML, IoT, Blockchain) and component technologies\nData analytics architecture (e.g. Data Lake)\nProgramming paradigms and approaches (e.g. object-oriented)\nProcess automation approaches and tooling (e.g. DevOps, AIOps)\nExperience in agile engineering and tooling support.\nAn agile mindset that moves past blockers and a vision to iteratively migrate to the next/modern set of architecture capabilities with a lens of business benefits/value.\nWillingness to travel to work with clients and BCG teams. At times, this role involves significant travel to client sites. The amount of travel will depend on client needs and nature of projects.\n\nAdditional info\nWhat We Offer:\nAt BCG, we care about our people, and offer best in class benefits to support you personally and professionally throughout your different life experiences including:\nAn opportunity to work organically across disciplines and across BCG, we offer a unified and unrivaled opportunity that combines strategic thinking with hands-on applications.\nA unique experience to work alongside a team of passionate and driven problem-solvers with a mission to deliver innovative and valuable digital solutions in a supportive environment. BCG pioneered strategy consulting more than 50 years ago, and we continue to innovate and redefine the industry. We offer multiple career paths for the world's best talent to have a real impact on business and society. As part of our team, you will benefit from the breadth and diversity of what we are doing today and where we are headed next. We count on your authenticity, exceptional work, and strong integrity. In return we are committed to supporting you in discovering the most fulfilling career journey possible-and unlocking your potential to advance the world.\nFOR U.S. APPLICANTS:\nThe first year base compensation for this role is $190,000 in USD. In addition to your base salary, you will also be eligible for an annual discretionary performance bonus and retirement contribution. BCG also provides a market leading benefits package described below. At BCG, we are committed to offering a comprehensive benefit program that includes everything our employees and their families need to be well and live life to the fullest. We pay the full cost of medical, dental, and vision coverage for employees - and their eligible family members. That's zero dollars in premiums taken from employee paychecks.\nAll our plans provide best in class coverage:\nZero dollar ($0) health insurance premiums for BCG employees, spouses, and children\nLow $10 (USD) copays for trips to the doctor, urgent care visits and prescriptions for generic drugs\nDental coverage, including up to $5,000 (USD) in orthodontia benefits\nVision insurance with coverage for both glasses and contact lenses annually\nReimbursement for gym memberships and other fitness activities\nFully vested retirement contributions made annually, whether you contribute or not\nGenerous paid time off including vacation, holidays, and annual office closure between Christmas and New Years\nPaid Parental Leave and other family benefits such as elective egg freezing, surrogacy, and adoption reimbursement\nEmployees, spouses, and children are covered at no cost. Employees share in the cost of domestic partner coverage.\nTo learn more about our employee benefit please check our BCG Benefits page.\n\nBoston Consulting Group is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, age, religion, sex, sexual orientation, gender identity / expression, national origin, disability, protected veteran status, or any other characteristic protected under national, provincial, or local law, where applicable, and those with criminal histories will be considered in a manner consistent with applicable state and local laws.\nBCG is an E - Verify Employer. Click here for more information on E-Verify."
  },
  {
    "title": "Data Scientist",
    "company": "Annex IT Sol Inc",
    "location": "Remote",
    "salary": "$80,000 - $90,000 a year",
    "url": "https://www.indeed.com/rc/clk?jk=e4467d2d09320ddb&bb=y28L8yxWj-8FEEnz0rlScxqbUmToS2u2h49TFdNO_cGTqOpR4ddzea1LUd0RMsrOs72F4eH-sj0iyCDPRBMsbUNWcQaEFwvA6-ZyjSk2dwpfqIUZ2Foacwbyl4s3g6J4jcizNN3MGg_Ke1mRg8WThg%3D%3D&xkcb=SoCP67M3sjCVyYQpUp0ObzkdCdPP&fccid=baef612f1638ad43&cmp=Annex-IT-Sol-Inc&ti=Data+Scientist&vjs=3",
    "description": "Job Summary\nWe are seeking a skilled and innovative Data Scientist to join our dynamic team. The ideal candidate will possess a strong background in data analysis, machine learning, and statistical modelling. As a Data Scientist, you will be responsible for extracting insights from complex data sets, developing predictive models, and implementing advanced analytical solutions to drive business decisions.\nResponsibilities\nAnalyse large volumes of structured and unstructured data to identify trends and patterns.\nDevelop and implement machine learning algorithms using tools such as TensorFlow and Spark.\nCollaborate with cross-functional teams to define data requirements and deliver actionable insights.\nDesign and maintain databases, ensuring optimal performance and scalability.\nUtilise programming languages such as Python, R, Java, and C for data manipulation and analysis.\nConduct data mining activities to uncover valuable information that can inform strategic initiatives.\nImplement natural language processing techniques to enhance data interpretation capabilities.\nCreate visualisations and reports to communicate findings effectively to stakeholders.\nStay updated with the latest advancements in AI, big data technologies, and industry trends.\nExperience\nProven 2+ Years experience in a Data Scientist role or similar position.\nProficiency in AWS for cloud computing solutions.\nStrong knowledge of database design principles and SQL for querying databases.\nFamiliarity with Hadoop for managing big data frameworks.\nExperience with Bash (Unix shell) scripting for automation tasks.\nUnderstanding of SAS for advanced analytics applications.\nDemonstrated ability in applying machine learning techniques across various projects.\nExcellent problem-solving skills with a keen attention to detail.\nStrong communication skills to convey complex technical concepts to non-technical audiences. Join us in harnessing the power of data to drive innovation and improve decision-making processes within our organisation!\nJob Type: Full-time\nPay: $80,000.00 - $90,000.00 per year\nWork Location: Remote"
  },
  {
    "title": "Machine Learning Engineer",
    "company": "Tennr",
    "location": "Hybrid work in New York, NY",
    "salary": "$200,000 - $240,000 a year",
    "url": "https://www.indeed.com/rc/clk?jk=5f8f1ca532404561&bb=y28L8yxWj-8FEEnz0rlSc-hBeB2xgXp7RGJ_IHbOf8Ggz4Wr5Cwn0lpKtNYFR5IV97hTfO8hY6pQTItcdekKdYV-FyZCDexpVSx_mvPbqPAq6k9GjX8Ulc3EHaTNr7ZRsorpK4SzW8M7j84x29eUlw%3D%3D&xkcb=SoA767M3sjCVyYQpUp0PbzkdCdPP&fccid=764035d00e1c5ae5&vjs=3",
    "description": "Company Description\nToday, when you go to your doctor and get referred to a specialist (e.g., for sleep apnea), your doctor sends out a referral and tells you, “They’ll be in touch soon.” So you wait. And wait. Sometimes days, weeks, or even months. Why? Because too often specialists and medical services are overwhelmed with referrals and the painstakingly manual process it takes to qualify your referral prevents them from getting around to it on time, or sometimes at all. Tennr prevents these delays and denials by making sure every referral gets where it needs to go, with the right info, at the right time. Powered by RaeLM Tennr reads, extracts, and acts on every piece of patient information so providers can capture more referrals, slash denials, and reduce delays.\nRole Description\nWe’re looking for a Machine Learning Engineer to help build the backbone of our healthcare process automation platform. You’ll wear many hats—researching and developing in-house models like RaeLM, designing information extraction pipelines, and building systems that transform messy, unstructured healthcare data into structured, actionable insights.\nAs an ML Engineer at Tennr, you’ll own end-to-end model development: architecting, training, deploying, and monitoring models—including open-source LLMs, vision-language models, and traditional computer vision systems—to deliver tangible value to our customers. You’ll also build and optimize data pipelines and ML infrastructure, ensuring our systems scale as data volume and complexity grow.\nIn this role, you’ll design and implement backend workflows that leverage ML to automate critical healthcare processes, fine-tune models for medical document understanding, and develop robust evaluation frameworks to measure and improve performance in complex, multi-model environments. Collaboration will be central—you’ll work closely with engineers, product, sales, and customer success teams to translate insights and feedback into actionable improvements and innovative solutions.\nThe ideal candidate is deeply curious, hands-on with both ML research and engineering, and has a proven track record of taking models from data to production at scale. This role is perfect for someone motivated to apply cutting-edge AI to real-world healthcare problems.\nResponsibilities\nMachine Learning Engineers at Tennr are expected to wear a variety of hats. In the role, you will be expected to do the following:\nEnd-to-end product development: architect, train, deploy, and monitor models that drive direct customer value across our product.\nData processing and ML Ops: optimize scalable data processing pipelines in our platform and maintain machine learning infrastructure.\nBackend integration: design and maintain complex workflows that leverage machine learning to drive automation.\nProduct evaluation: Collaborate with sales and customer success teams to respond to feedback from our customers and prospects.\nCustom models: Fine-tune LLMs and VLMs for medical document understanding tasks\nQualifications\n3+ years of experience (post BS/MS) in an ML research/engineering role\nProven track record of building and maintaining scalable web applications, particularly in high-volume workflow automation and data processing.\nExperience integrating machine learning models into production environments\nCan efficiently translate open-ended problems into actionable solutions\nFamiliarity implementing novel NLP research ideas and techniques. Prior publications in top conference journals is a plus.\nPrior experience in a startup environment is a plus.\nWhy Tennr?\nDrive Impact: one of our company values is Cowboy, meaning you set the pace. You won’t just talk about things, you’ll get them done. And feel the impact.\nDevelop Operational Expertise: learn the inner workings of scaling systems, tools, and infrastructure\nInnovate with Purpose: we’re not just doing this for fun (although we do have a lot of fun). At Tennr, you’ll join a high-caliber team maniacally focused on reducing patient delays across the U.S. healthcare system.\nBuild Relationships: collaborate and connect with like-minded, driven individuals in our Chelsea office 4 days/week (preferred)\nFree lunch! Plus a pantry full of snacks.\n\nBenefits\nNew, spacious Chelsea office\nUnlimited PTO\n100% paid employee health benefit options\nEmployer-funded 401(k) match\nCompetitive parental leave\nCompensation Range: $200K - $240K"
  },
  {
    "title": "Executive Director, Artificial Intelligence",
    "company": "Broadcast Music, Inc",
    "location": "Hybrid work in Nashville, TN",
    "salary": "",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0Czhm7K5KzP2jkkMillAjtWCVxzUUQj_mEz2A4Ivv1Ls9cexVCePfBE1iPdZi-que4bHCDDplq4ZqfdQtYhdFQQJLe16ACXEWVUkoV497aKP13-6grbzQNDWAKqu_hU1Jel7jTLqpsi-lCy8r2SnrUA0tHmd5XGcbMD3IPxDtclFfG5wv_RZJRwm29NKO17jQFViT3zm3g52J91bFUGy3ECszvQe0bYyxPKQqXS9Fn3YlGV-2N6p6qUksE7efBl_YZo69fLMq5euX8WwJAu6eKYo8luGXChFy4XvunnflY03K9h4eu8dhB3C72VnvIrJrWyC997qV0HB-8OMBIr9fjvp8ITdj6j_8kCJ7iaPuJrAL0xG-vCanZ0EoGe6fWOrEgcF11P2vySOjHqJhrvsAeSv1scRDBGCpHOSxlq1G3t4bfnx8_Xh2DnHFy6uQypjcxQBq6dJ_-cT7DKMMQ9vm6qmolqMbGqirwFEB15wpf5SBfswDZ_aXUYBIeCJrDhju7QQNydI8Kb4kESHFSU8hXHwQazpFnqgsajARhO2YOiXgAXTHRU-r21lRPhfVCdKn8eQbF9FzAYG9Uq3lLkXSgUOw8tAVARN0JnTRU4XdjUOHJCQ7-dD_i_R7U2P1m_VOM2qyyEeBlFQAoO5MCo0Fah&xkcb=SoCo6_M3sjCVyYQpUp0HbzkdCdPP&camk=H-lBaXMUocJ93787h_hJag==&p=12&fvj=0&vjs=3",
    "description": "POSITION SUMMARY\nSets the company’s overall artificial intelligence (AI) strategy, including the design, development and implementation of technologies that will drive business transformation and enhance customer experiences.\n\nLOCATION\nRemote - (US)\n\nFUNCTIONS OF THE JOB\nEssential Functions: which may be representative but not all inclusive of those commonly associated with this position.\nPrepares the strategy for ensuring BMI’s use of ethical AI, including spearheading an inter-department AI governance team and oversees implementation of ethical AI across identified projects.\nIdentifies new business models that could be enabled using AI technologies.\nIdentifies AI projects of high business impact including both product-related projects and research projects.\nDetermines the AI projects/products implementation processes including project inception, exploration phase, model building phase, model deployment, and model retraining.\nPrepares annual roadmap for implementation of identified AI projects.\nPrepares the plan and oversees the implementation of the AI platform which will be used to deploy and host ML models.\nIdentifies technologies that will be used for development, testing and deployment of AI/machine learning models.\nImplements quality assurance, performance testing and model acceptance processes.\nImplements continuous delivery/deployment strategies (A/B testing, canary testing etc.) of machine learning models.\nImplements machine learning pipeline automation to be used for automated ML model retraining and testing.\nOversees the implementation of AI infrastructure to be used for model training/retraining and model deployment in production.\nEnsures the use of cloud services in relation to local infrastructure for fulfilling different requirements.\nCommunicates BMI’s AI strategy to stakeholders including affiliates, customers, partners, employees and the public as appropriate.\nOther duties as assigned.\nRegular attendance.\nSupports BMI core values and cultivate a culture of diversity and inclusion.\nSUPERVISORY RESPONSIBILITIES\nDirectly and indirectly supervises team members responsible for technology innovation, product and application development, IT operations and project management. Carries out supervisory responsibilities in accordance with the organization's policies and applicable laws. Responsibilities include interviewing, hiring and training employees; planning, assigning, directing and ensuring reliability of work; appraising performance; rewarding and disciplining employees; addressing complaints and resolving problems.\nPOSITION QUALIFICATION REQUIREMENTS\nEducation: Bachelor’s degree in related field; equivalent experience considered.\nExperience: Ten (10) years’ related technical and leadership experience within IT architecture and/or development areas.\nSKILLS AND ABILITIES\nWhich may be representative but not all inclusive of those commonly associated with this position.\nIn-depth knowledge of current AI research areas and current trends.\nExperience building machine learning models including data preparation techniques, feature engineering techniques, machine learning models (ML) and related ML algorithms.\nKnowledgeable of current developments in the field of AI – Safe AI, Ethical AI, Fair AI etc.\nExperience with Cloud AI/ML services on AWS, GCP, Azure.\nExperience with Cloud computing services.\nKnowledgeable of Big Data technologies and related cloud services.\nExperience with software development lifecycle, project implementation methodologies such as agile, etc.\nExperience with software engineering principles.\nExperience with DevOps concepts for ML pipeline automation.\nInfrastructure knowledge related to physical/virtual m/c for model retraining etc.\nSALARY RANGE\nThe specific base salary offered to a successful applicant will be based on individual qualifications, skills, experience, and education. The pay range is subject to change at any time based on various internal and external factors. The position may also be eligible for one or more performance-based bonuses. In addition to cash compensation, BMI offers a competitive portfolio of benefits to its employees, as described below.\nWhat We Give to You:\nHealth, dental, and vision insurance\n401K with employer match\nFlexible spending accounts\nPaid vacation and paid sick/personal time\n12 paid calendar holidays\nPaid volunteer time off\nSummer hours that offer more time for fun in the sun\nCompany paid life insurance\nUp to 12 weeks paid parental leave\nTuition assistance for qualified team members\nCommuter benefits (New York)\nAmazing and engaging culture\nEmployee Resource Groups\nBROADCAST MUSIC, INC. IS AN EQUAL OPPORTUNITY EMPLOYER: All applicants will receive equal opportunity for employment without regard of race, color, sex, religion, nationality, age, sexual orientation, gender identity and/or expression, veteran’s or marital status, disability, or any other cultural factor.\n#LI-Hybrid"
  },
  {
    "title": "Data Scientist",
    "company": "iSpot",
    "location": "Hybrid work in Bellevue, WA",
    "salary": "$95,000 - $118,000 a year",
    "url": "https://www.indeed.com/rc/clk?jk=5223de038af37e33&bb=y28L8yxWj-8FEEnz0rlScxrj7Iv9CSKseuTC9JkgROXstPKwCCuKGXJ6kUk04OvUfmHbnL3XauTjaJGjOpTKhhTCon4vOFfvmB_F4LbIWtR-HYs5fQPJAKtuXGhh_YOBI7W_2h7enLuU0T-8uBSIXA%3D%3D&xkcb=SoAB67M3sjCVyYQpUp0JbzkdCdPP&fccid=631c59980fe9eac0&vjs=3",
    "description": "Immigration / Work Authorization Notice: At this time, iSpot does not provide visa sponsorship or immigration support for this role. Applicants must already be authorized to work in the United States on a full-time, permanent basis without the need for current or future sponsorship.\niSpot competes for the best talent. Our compensation packages consist of salary and equity in one of Seattle's hottest start-ups, as well as other standard benefits. Most importantly, we provide a really interesting working experience, and the chance to contribute to the success of something great.\nAbout iSpot:\nAt iSpot, we empower advertisers to measure the true impact of their TV and streaming campaigns—from concept through airing to conversion. Our fast, accurate, and actionable measurement and attribution solutions enable advertisers to evaluate creative effectiveness, optimize media plans, and attribute results across platforms, all while benchmarking against competitors and historical data. With real-time performance insights seamlessly integrated across linear and streaming TV, iSpot equips advertisers to make swift, confident decisions that drive impactful business results.\nAbout the Team:\nOur Client Data Science team is dedicated to delivering invaluable insights and reports to our clients. We thrive on innovation, employing cutting-edge techniques that empower our clients to advance their businesses. Comprising Analysts, Data Scientists, and Engineers, our team brings a deep understanding of the media landscape, advanced data science techniques, and strong coding skills, all fueled by a passion for growth.\nAbout the Role:\nWe are seeking a passionate Data Scientist to join our dynamic Client Data Science team. In this role, you will design and develop custom reports tailored to our iSpot clients, providing them with the insights they need to succeed. We're looking for someone who shares our obsession with data accuracy and possesses an insatiable curiosity for learning and tackling challenging goals in a fast-paced environment.\nJoin us in this collaborative environment, where your contributions will help drive innovation and push the boundaries of the media industry. We can't wait to see how you'll make an impact!\nAs a key member of the Client Data Science team, you will be responsible for a variety of critical tasks, including:\nCollaborating on complex problems, both independently and as part of a team, while writing and optimizing R, Python, or SQL scripts for effective data processing.\nAdapting existing tools and methods to meet evolving needs, balancing workloads across various projects, and leveraging solid machine learning and statistical skills to inform data-driven decisions.\nCollecting, aggregating, and manipulating data from multiple sources, applying analytical techniques to derive insights, and creating clear visualizations or reports.\nEngaging with internal and external teams to clarify requirements, address challenges, and develop tailored solutions, while documenting project status and updates in tools like JIRA.\nCommunicating effectively with diverse audiences, translating complex findings into accessible formats through written reports and presentations, and actively participating in team discussions to support collaboration and problem-solving.\n\nYour expected work day will consist of:\n5% People Mentorship\n25% Project Leadership\n5% Strategy, Planning and Prioritization\n5% Internal or Client Collaboration\n60% Hands on: Reporting, Coding, Debugging, Developing, Methods, etc.\nQualifications:\nExperience: 3+ years of experience in Data Science, or comparable field\nEducation: Bachelor's degree in a quantitative or social science field, Master's preferred\nCoding Experience: 3+ years coding experience and 1+ years coding specifically in R or Python;\nCoding Skill: Intermediate coding skill in Python or R;\nLeadership Experience: 1+ year of project leadership;\nTechnical Knowledge: Intermediate knowledge of Data Science, Modeling, Machine Learning, and Statistics;\nCommunication: Exceptional written and verbal communication with internal and external stakeholders at all levels;\nSoft Skills:\niSpot's Client Data Science team expects all candidates to have a range of soft skills, including but not limited to: critical thinking, attention to detail, and effective communication. Additionally, the following soft skills are required for success in this role: Prioritization of accuracy; Flexibility and adaptability; Resourcefulness; Logic.\nTarget cash compensation range: $95,000 - 118,000USD Annually\nWe are committed to providing competitive, market-informed compensation. The cash compensation above includes base salary, variable commission for employees in eligible roles, and annual bonus targets for eligible roles. In addition to cash compensation, all full time iSpotters are eligible to participate in iSpot's equity plan to receive stock options. Non-exempt roles will also be eligible for (pre-approved) overtime pay. Individual compensation packages are influenced by different factors unique to each candidate, including their skills, experience, qualifications and other job-related reasons.\nFor more information on total rewards package, go HERE\nHybrid & Flexible Workplace Policy\niSpot supports a hybrid and flexible workplace. Depending on location and work responsibilities, employees may be designated as full-time or part-time office-based or a fully remote employee. A hybrid work schedule indicates that you work in the office some days and work from home other days. The best hybrid workplaces allow for flexibility while also encouraging consistency.\nThose local or living in surrounding areas to one of our offices (Bellevue, WA; El Segundo, CA; New York, NY) will work a hybrid schedule, coming into their local office 1-3 days a week. While those in a role, not office-based and located further away from our offices, will work a fully remote schedule. If you have questions regarding exact details of our hybrid & flexible workplace policy, please let your recruiter know and they will discuss with you further.\n#LI-Remote\nIf you don't feel you met every single requirement for the role, don't rule yourself out. Please apply anyway!\niSpot is an equal opportunity employer. All applicants will receive consideration for employment without regard to race, ethnicity, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please contact our HR team.\nCalifornia Residents applying for positions at iSpot can access our California Consumer Privacy Act here."
  },
  {
    "title": "Machine Learning Engineer",
    "company": "Krea",
    "location": "San Francisco, CA",
    "salary": "Full-time",
    "url": "https://www.indeed.com/rc/clk?jk=74e420a3d28118e1&bb=y28L8yxWj-8FEEnz0rlSc1w0_hB6zrwyKTWhV1aL4Eho4FOb7MZlNL1mIXLZYllhVB-xkhMGZRl1Av1tpiK4pb4a5NCzFnWh--UkHb6J0y7sBt8vrRrHQPHunUYircwqFcx17Oi4Ag_ys-6MAYifXw%3D%3D&xkcb=SoCm67M3sjCVyYQpUp0MbzkdCdPP&fccid=970a874df110bfce&vjs=3",
    "description": "About Krea\nAt Krea, we are building next-generation AI creative tools.\nWe are dedicated to making AI intuitive and controllable for creatives. Our mission is to build tools that empower human creativity, not replace it.\nWe believe AI is a new medium that allows us to express ourselves through various formats—text, images, video, sound, and even 3D. We're building better, smarter, and more controllable tools to harness this medium.\nThis job\nWe're looking for a machine learning engineers who can work on large-scale image and video models training experiments..\nSome stuff you can do:\nTrain foundation diffusion models for image and video generation.\nTrain controllability modules such as IPAdapters or ControlNets.\nDevelop novel research techniques and put them into production.\nConducting large-scale experiments on high-performance computing clusters, optimizing data pipelines for massive image datasets\nExample experience and skills we’re looking for\nProven track record in working with image or video models at scale (publications or open-source contributions a plus)\nStrong background in deep learning frameworks and distributed training paradigms.\nAbility to iterate rapidly, and propose creative research directions\nA bit more about us\nWe’ve raised over $83M and are backed by world-class Silicon Valley investors such as Andreessen Horiwitz, and the cofounder of the Meta AI Research laboratory (FMK as Facebook AI Research) or founding members of OpenAI."
  },
  {
    "title": "Oracle Generative AI Architect Specialist Leader",
    "company": "Deloitte",
    "location": "Dallas, TX",
    "salary": "$158,900 - $292,900 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0DIXU_djF9v0NrX_xbLRwj6RWFeuMEgTY6VvwKgvleOVG4FVVS6URhro_sUU09TyEh9UbIIP0fscTlRz-H7M70vhmmOiZGgWq8LSIesjSC7qk52d3ptIsZTB3MRJdCc1-wMdijBqgxMjQD7tCQfNbExMp4-witLoe2PcZxckk1DWCVyrjvyKoeayeF3rSWHe9d-s1vEG8t-pFKsJPC9EefG7QhI6DVhFL4nLjYlfkhcwrZuL7r_tb9wpCEwD13n_hFTpOtjs9h6MK5grGr89Q7txBCaNY-I8Rzt7XjWqHKTldjNaTamRzZVKwlAuXqJxeI28beBzubFoLKuVcT200UIkOZ15Q9aaOTHPzrVxljCE7aaFAPO4IhTZk91tF6ojunP7Pyft7AmSaQjFX1q3d7a9ty3QPjfNgxOnYNBd8LvrBX-TNQgaT4fqm2N7VefJfvoLmDmnV2dPlOuntrXRacw1TotilZeIPNaqFCn8_Ha95JIKoNGXHB8i8unrlopNJdYOv-JE11erKSQValPB2gDhLxLbHsBFSRt5z66-0fSIl-_aR6WHyk6UlIob4z_Z1Ni6V6EKDfU_4SFxuaL3pHGK8-SpGgF7d8XJsx3g1KKJqiEgUH_ORlxYhjqmOlqKE8JTg7dmG9VFcY23QfXYTntZiLYUtHYBUrmTYz4UAXDJW4r9MKGin0d&xkcb=SoAc6_M3sjCVyYQpUp0GbzkdCdPP&camk=ethIe0s0heeMtepOIg2GuA==&p=13&fvj=0&vjs=3",
    "description": "Today's chief financial officers (CFOs) and supply chain executives are being asked to improve business performance and shareholder value, along with operational effectiveness and efficiency. Deloitte Oracle Generative AI Architect Specialist Leaders help clients delineate strategy and vision, design and implement process and systems which align with business objectives and have a measurable impact on growth. Do you want to be a part of a team that transforms the business landscape for its clients? Do you want to be on the winning team that drives transformation, improves productivity, and streamlines business operations with AI? Do you feel your skills surpass those of your peers and colleagues? If your answer is yes to all these questions, it's very nice to meet you and we want to hear from you immediately!\n\nRecruiting for this role ends on 11/21/2025.\n\nWork You'll Do\n\nAs a Generative AI Architect, you will play a pivotal role in shaping the future of enterprise technology by designing and delivering AI-first solutions on Oracle Cloud Infrastructure (OCI). Leveraging your expertise in Oracle Fusion Applications-including ERP, SCM, HCM, and EPM-you will architect innovative systems that seamlessly integrate generative AI capabilities with core business processes.\n\nYou will collaborate with cross-functional teams to translate complex business requirements into scalable, intelligent solutions using OCI services and modern AI frameworks. Your work will enable organizations to achieve new levels of automation, insight, and operational efficiency.\n\nIn addition, you will stay at the forefront of the AI landscape by working with leading platforms such as Microsoft Copilot, Google Cloud Agent Space, LangGraph, Glean, and other enterprise AI technologies. Your deep understanding of these tools will help bridge the gap between emerging AI advancements and mission-critical enterprise needs, driving measurable business value.\n\nResponsibilities will include:\nDevelop and align enterprise AI architecture on OCI, focusing on generative AI and Oracle applications.\nArchitect and deliver integrated AI solutions, including agentic workflows and RAG pipelines.\nEnsure governance, security, and compliance for AI/ML initiatives.\nIdentify high-value AI use cases and guide teams on prompt engineering and model optimization.\nCollaborate with stakeholders, mentor teams, and lead technical reviews and pilot deployments.\n\nThe Team\n\nOur Oracle offering drives business transformation services to improve performance and value delivered by the full suite of Oracle solutions.\n\nGot your head in the cloud? With so much technology moving to the Cloud, our business requirements are taking us to new heights. By harnessing the power of Oracle ERP Cloud, you can streamline enterprise business processes with ERP Cloud's Financials, Procurement, or Portfolio Management. Do you have the ability to transform an organization through the latest social, mobile, and analytic technologies? We're looking for someone that can increase the effectiveness of decision making and drive innovation. If your head is in the cloud, find out where we can take you with Oracle Enterprise Solutions. Learn more about our Oracle practice .\n\nQualifications\n\nRequired:\n10+ years in enterprise architecture, with at least 3+ years in AI/ML or Generative AI solutioning.\nStrong expertise in Oracle Cloud Infrastructure (OCI) services (GenAI Service, Functions, API Gateway, Data Science, Autonomous DB, OIC).\nSolid knowledge of LLMs, embeddings, RAG, multi-agent systems, and integration with enterprise apps.\nExperience in Python, SQL, REST APIs, and cloud-native design patterns.\nFamiliarity with security, compliance, and governance in cloud/enterprise environments.\nAbility to travel 50% on average, based on the work you do and the clientsandindustries/sectorsyou serve.\nLimited immigration sponsorship may be available.\nA Bachelor's degree\n\nPreferred:\nExperience with Fusion AI Studio and Redwood UI extensions.\nPrior experience with Oracle ERP Cloud (Financials, SCM, Procurement, HCM) or Oracle E-Business Suite, JDE, PeopleSoft.\nAwareness of enterprise AI platforms such as Glean, Moveworks, or similar for enterprise search and productivity AI.\nExposure to cross-cloud AI ecosystems (AWS, Azure, GCP) alongside OCI.\nKnowledge of modern AI frameworks (LangChain, LangGraph, NVIDIA NIM, Hugging Face).\nProven track record of leading AI/ERP transformation programs in large enterprises.\nStrong communication skills to engage both executive stakeholders and technical teams.\n\nInformation for applicants with a need for accommodation:\n\nhttps://www2.deloitte.com/us/en/pages/careers/articles/join-deloitte-assistance-for-disabled-applicants.html\n\nThe wage range for this role takes into account the wide range of factors that are considered in making compensation decisions including but not limited to skill sets; experience and training; licensure and certifications; and other business and organizational needs. The disclosed range estimate has not been adjusted for the applicable geographic differential associated with the location at which the position may be filled. At Deloitte, it is not typical for an individual to be hired at or near the top of the range for their role and compensation decisions are dependent on the facts and circumstances of each case. A reasonable estimate of the current range is $158,900 - 292,900\n\nYou may also be eligible to participate in a discretionary annual incentive program, subject to the rules governing the program, whereby an award, if any, depends on various factors, including, without limitation, individual and organizational performance\n\n#EPCore\n\nO2FY25"
  },
  {
    "title": "Data Scientist",
    "company": "Boosted.ai",
    "location": "Remote",
    "salary": "$155,000 - $210,000 a year",
    "url": "https://www.indeed.com/rc/clk?jk=8d95e9001737f64f&bb=y28L8yxWj-8FEEnz0rlSc50WLNE4kARbP43l5TGvBFH4iJcyPLKeXOrLKji35zFxF_CljVoSIUkggatfBSrg2FX7YIId7b3KF9igHA9gOH56rDT48vmVy0nmtfGtmE-g9tguxIa3TNCZuk_IZ1sfpA%3D%3D&xkcb=SoC167M3sjCVyYQpUp0IbzkdCdPP&fccid=b3b14cf303e02e89&vjs=3",
    "description": "Boosted.ai is building AI purpose-built for finance to help teams do more. Our mission is to optimize investing and boost productivity. We're already trusted by leading enterprises and developers with over $5T under management with Boosted.ai.\nFrom the fastest growing hedge funds to global financial institutions, our tool lets our users stay ahead of the competition with AI that works for them. We believe that modern investment professionals will win the future of finance by using the best tools; a unique competitive edge powered by data, experimentation, and automation.\nBoosted.ai is the platform they use to cut through data overload, outpace competitors, and reclaim their time. We're looking for sharp, low-ego people to help teams find their edge.\nWhy is Boosted.ai the best place to work?\nCustomers love the product (adopted by many of the biggest financial institutions and rapidly expanding to more firms)\nWe're growing a lot (5x in the last year)\nIncredible culture (our customers keep applying to work here)\nWell-resourced — our lead investors are innovators and disruptors in financial and technology markets, including Spark Capital (Twitter, Slack, Affirm), Ten Coves Capital (Plaid, Sentieo, TouchBistro), Portage Ventures (Wealthsimple, Borrowell, Nesto), and RBC (Royal Bank of Canada)\nPosition Description\nWe're looking for a data science \"Olympian\" to own full-funnel insights, from shaping our best-in-class data stack and infrastructure, to asking the right questions, to running experiments, and to delivering sharp analyses. You'll play a pivotal role in driving strategic decisions and building a data-driven culture.\nWhat You'll Do\nDrive strategic insights: Own the full-funnel insight process, transforming data into actionable recommendations for go-to-market and product\nDeliver clarity: Translate complex data findings into simple, actionable insights that resonate with both technical and non-technical stakeholders\nSet up data infrastructure: Contribute to building and scaling our data transformation and orchestration capabilities, ensuring accurate and timely data delivery\nEmpower self-serve analytics: Develop a robust self-serve analytics platform that empowers all teams to access and leverage data effectively\nChampion a data-driven culture: Establish best practices that encourage non-data teams to use insights effectively\nExperiment: Design and set up experiments that test hypotheses and measure impact, driving continuous improvement in processes and products\nWhat You'll Bring\n4+ year experience\nExpert in SQL and Python or R\nRobust understanding of statistical and machine learning methods\nStorytelling through data\nExperience with data transformation tools and data orchestration tools\nCompensation\nAt Boosted.ai, we believe in fair and transparent compensation practices. The base salary range for this full-time position is $155,000-$210,000, which may vary depending on experience, skills, and location. This range reflects the minimum and maximum target base salary for new hires. In addition to base salary, employees are eligible for our discretionary bonus program that takes into account both individual and company performance, and participation in our equity program. During the hiring process, we can provide more specific salary information for your location.\nOur Values\nWe are guided by a set of values that are at the core of our actions and define our culture. These principles are the foundation of our work, and we are committed to upholding them in everything we do.\nCollaborative – We value our team and know that success can only come from working together\nClient Centric – Our focus is always on our clients and consistently delivering them value\nAction Oriented – We remove barriers and we seek to improve in measurable ways\nAccountable – We are accountable for ourselves, and we hold each other accountable\nRespectful – We are proud of our work, we are respectful of each other's opinions, and we keep a positive attitude\nWhat we offer\nWe want our benefits to reflect our values and offer the following to full-time employees:\nFlexible (Unlimited) Paid Time Off\nMedical, Dental, and Vision benefits for you and your family\nLife Insurance and Disability Benefits\nAccess to a 401(k) retirement savings plan (for U.S. employees)\nPaid Parental Leave\nFree access to use Boosted.ai Alfa™ to make money\nWe love the energy of in-person collaboration while also offering the flexibility to work from home when needed\nThese benefits are further detailed in Boosted.ai's policies and are subject to change at any time, consistent with the terms of any applicable compensation or benefits plans. Eligible full-time employees can participate in Boosted.ai's equity plans subject to the terms of the applicable plans and policies.\nBe you, with us\nWe're working to bring the transformative power of AI to every organization in the world. To do so, it is important to us that the diversity of our employees represents the diversity of our customers. We believe that our work and culture are better when we encourage, support, and respect different skills and experiences represented within our team. We encourage you to apply even if your experience doesn't precisely match the job description. We strive to evaluate all applicants consistently without regard to race, color, religion, gender, national origin, age, disability, veteran status, pregnancy, gender expression or identity, sexual orientation, citizenship, or any other legally protected class."
  },
  {
    "title": "Remote AI Training & Domain Expert",
    "company": "NeuraScale",
    "location": "Remote",
    "salary": "$15 - $150 an hour",
    "url": "https://www.indeed.com/rc/clk?jk=5a1dc6607471e751&bb=y28L8yxWj-8FEEnz0rlSc9uNs82Z3JmttaCbFzL7d-3-8F1JNNgKHMw3l9KUr32ZSX7lcZwXuv0ELg19BU59K6EO4a4fgcuuPiMZaS1SuJeTL1F3_tyH3EvLfgH3-bFa9ODKY3E6hXOJWG_maJhWyQ%3D%3D&xkcb=SoAS67M3sjCVyYQpUp0NbzkdCdPP&fccid=dd616958bd9ddc12&vjs=3",
    "description": "About Us\nWe power the future of AI by harnessing the expertise of professionals worldwide. In partnership with leading AI firms like OpenAI, Meta, Google, Anthropic, and AWS, we facilitate the training of state-of-the-art generative AI systems. Our contributors work flexibly, receive weekly payments, and help shape technologies that truly matter.\nWhat You’ll Do\nProvide expert-level feedback, data, or training in your field (STEM, business, law, languages, etc.)\nEvaluate, refine, or create AI training content to boost model performance\nTackle intellectually stimulating tasks—on your own schedule\nWho You Are\nA domain expert, researcher, educator, or professional with deep expertise\nStrong proficiency in written English; multilingual skills are a plus\nAble to dedicate 5–40 flexible hours per week based on your availability\nPreferred: senior undergrad, graduate student, or degree holders (Master’s, PhD)\nCompensation\n$15–$150 per hour, depending on domain and task complexity\nWeekly payments via Stripe, PayPal, or Wise\nWhy Join Us\nFully remote and flexible work—you control when and how much you work\nA collaborative and global community of experts shaping the AI frontier\nPrompt, transparent, and skill-based earnings\nHow To Apply\nSubmit your application.\nAfter applying, you’ll receive an automated email containing a link to begin onboarding.\nClick the link, sign up for the Alignerr platform, and complete the onboarding process.\nOnce onboarded, you'll immediately begin matching with projects that align with your expertise.\nReady to make an impact and earn today? Apply now and unlock your potential with Alignerr."
  },
  {
    "title": "Data Scientist",
    "company": "Marchex",
    "location": "Remote",
    "salary": "$103,000 - $120,000 a year",
    "url": "https://www.indeed.com/rc/clk?jk=e0558fac1671fedb&bb=y28L8yxWj-8FEEnz0rlSc3iH-YyaXVF5W3lY7QzunZ1sh2arV1qgJRdghJx6gqqG9-2cI4lvhGeU5944kIJC2UEgLN-3bZonYrTCw8pZavKIA8u0wt6Jmw8eggs9HryDerErEG7a2IeCqC7tlm460A%3D%3D&xkcb=SoCc67M3sjCVyYQpUp0KbzkdCdPP&fccid=4aa8fe3e72a441ec&vjs=3",
    "description": "Description\n\nJob Impact\n\nIn this role, you will be at the forefront of shaping Marchex’s AI-driven solutions by applying advanced data science techniques. Your expertise in areas such as prompt engineering, fine-tuning large language models, and developing agentic workflows will directly influence the evolution of our conversation intelligence platform. By building and optimizing sophisticated machine learning models, you will enable the creation of intelligent systems that automate, enhance, and personalize customer interactions. Your contributions will empower Marchex to deliver innovative, scalable AI capabilities, positioning the company as a leader in leveraging state-of-the-art data science to solve real-world business challenges and drive future growth.\nTeam\nOur technology team is a group of highly skilled and passionate individuals constantly pushing the boundaries of what is possible with technology. We are always looking for new and innovative ways to solve problems and make a positive impact. Marchex culture is one of collaboration, continuous learning, and inclusivity. We value diversity and encourage team members to bring their unique perspectives and approaches to problem-solving.\n\nDuties and Responsibilities\n\nOutline of Duties and Responsibilities\nDesign and build machine learning models to analyze and classify text and other data.\nApply natural language processing techniques to extract meaningful insights from unstructured text data.\nCollaborate with cross-functional teams to identify business problems and develop solutions.\nExplore new technologies and techniques to improve the performance of existing models.\nCreate and maintain documentation for all models, code, and processes.\nBuild and test functional prototypes.\nPartner with engineering to develop data-oriented product features.\nWork with the business and product teams to understand what information can best impact our clients, with a focus on measured experimentation.\nCollaborate across the company on data-driven initiatives.\nDrive customer conversations to understand business context and propose solutions to data problems.\nProvide clear and concise insights/recommendations from data analysis to team, senior execs and when needed customers.\nSupport the vision and values of the company through role modeling and encouraging desired behaviors.\nParticipate in various company initiatives and projects as requested.\n\nExperience, Skills and Qualifications\n\nExperience, Skills and Qualifications\nMaster's or Ph.D. degree in Computer Science, Statistics, Mathematics or a related field, or commensurate experience.\n3+ years of experience in natural language processing and machine learning\nExperience working with large language models such as OpenAI’s GPT series or Anthropic’s Claude\nExperience with deep learning frameworks such as TensorFlow, PyTorch, or Keras\nStrong programming skills in Python and proficiency in data analysis libraries such as Pandas and NumPy\nExperience working with large datasets and building scalable models\nExcellent communication and problem-solving skills\nFamiliarity with API frameworks and concepts\nFamiliarity with containerization tools such as Docker and Kubernetes\n\nBenefits\n\nComprehensive Medical & Prescription Plan\nDental & Vision Plan\nMarchex Paid Basic Life & AD&D Coverage\nMarchex Paid Long & Short-Term Disability\n401(k) Plan (Pre-tax and Roth) and Match\n2 Paid Volunteer Days Each Year\n11 Paid Holidays\nPaid Time-Off Benefits\nHealth Savings Account\nHealth & Dependent Care Flexible Spending Accounts\nPaid Parental Leave Benefits\nVoluntary Life Insurance\nEmployee Assistance Program (EAP)\nDiscounts with Various Business Partners\nHeadspace Membership\nMonthly Remote Work Stipend\nVirtual Social Connect Events\n\nAbout Marchex\nMarchex harnesses the power of AI and conversational intelligence to provide actionable insights aligned with prescriptive vertical market data analytics, driving operational excellence and revenue acceleration. Marchex enables executive, sales, and marketing teams to optimize customer journey experiences across communications channels. Through our prescriptive analytics solutions, we enable the alignment of enterprise strategy, empowering businesses to increase revenue through informed decision-making and strategic execution. Marchex provides conversational intelligence AI-powered solutions for market-leading companies in leading B2B2C vertical markets, including several of the world’s most innovative and successful brands."
  },
  {
    "title": "Technical AI Instructor and Forward-Deployed Engineer (Specialist Senior)",
    "company": "Deloitte",
    "location": "Chicago, IL 60606 \n(The Loop area)",
    "salary": "$107,600 - $198,400 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0DIXU_djF9v0NrX_xbLRwj6RWFeuMEgTY6VvwKgvleOVG4FVVS6URhro_sUU09TyEirnz5HC8VHY0GirSYiZCvW_ijpsqPT0BTC-SNV-1b26TnQzebPmAceVZfOofzGoIyFtfWUdc2k3XztQ_ZkVjJ1TASQldEjw4Xdat5Tnwr-xT0LOWIrf_NqMJ0ejgi4pnnXeLBm8ecNI-aPveaUxailPOg8yvngr_tuOa3OgAI6M46HfmfctmsEzude7jnw0264FG2zqsf6Olj6K2Opu_gsmC7Mj3tssSRSpa0hzdClY1UdYHk10gcsAcUGTr5ck4OwKfjoyDrVVkpqJIw1YzuOKowtwrzbcgcOQn9hwp_Z7AjIHuH285nrKT0Fj-irMb1CJRb3417DB-UWN01fcG4lpk4Q0rDeyPCKNWkihREiueD35bLvk_vNRwobyNDX1lcG5rhioHkKfu-FN5x5lm_jwQyB13xk9MDlD0EB3q6AxdzgaN4u5pAt0OnQtw9wBMs_ulloPnh9K_rpZwsGYCnO9yy-xFcQD6d-uycLNLXeA-uwCcna8SjysomlVAmj93SibmRLO4E-hIDhRNqr2PhcnLmhyOYNCppHFPvGuJ3ZhRVdQ8Hw8j1KnJGIsh7gD_zxkcRGp4IOYpH4Lqv_xEudQejX-FqrvrgEZ_h4z70ILKAfa_DRJbssOpXODkeyrZ0=&xkcb=SoAm6_M3sjCVyYQpUp0AbzkdCdPP&camk=ethIe0s0heeMtepOIg2GuA==&p=11&fvj=0&vjs=3",
    "description": "Technical AI Instructor and Forward-Deployed Engineer (Specialist Senior)\n\nOur Deloitte Customer team empowers organizations to build deeper relationships with customers through innovative strategies, advanced analytics, Generative AI, transformative technologies, and creative design. We can enhance customer experiences and drive sustained growth and customer value creation and capture, through customer and commercial strategies, digital products and innovation, marketing, commerce, sales, and service. We are a team of strategists, data scientists, operators, creatives, designers, engineers, and architects. Our team balances business strategy, technology, creativity, and ongoing managed services to solve the biggest problems that affect customers, partners, constituents, and the workforce.\n\nRecruiting for this role ends on November 24, 2025\n\nWork you'll do\n\nWe are seeking a highly skilled and passionate individual to join our team as a Technical AI Instructor and Forward-Deployed Engineer. This role involves teaching technical AI skills, engaging in early-stage engineering work, and incubating innovative products from concept to code. The position will have both client-facing responsibilities and an internal enablement component.\n\nIn this role, you will help shape and lead early stage product development and product incubation projects with a focus on rapid prototyping using cutting edge generative AI tools. You'll additionally support our teams by teaching them to use and implement the tools, frameworks and patterns needed for rapid prototyping with generative AI.\n\nKey Responsibilities Include:\nTeaching Technical AI Skills: Develop and deliver comprehensive training programs on generative AI technologies, including tools such as GitHub Copilot, Cursor, Replit, Airtable, and platforms like OpenAI, Anthropic, and Gemini. Tailor content to various skill levels and ensure practical, hands-on learning experiences for designers, engineers, and product managers.\nEarly-Stage Forward-Deployed Engineering: Collaborate with cross-functional teams to design and implement AI solutions for real-world problems. Engage in rapid prototyping and iterative development to validate concepts and refine solutions.\nProduct Incubation: Lead the incubation of new AI products, from ideation to deployment. Work closely with product managers, designers, and engineers to bring innovative ideas to life and ensure successful product launches.\nClient-Facing and Internal Enablement: Serve as a key point of contact for clients, providing expert guidance and support on AI initiatives. Additionally, enable internal teams by sharing knowledge, best practices, and facilitating collaboration.\n\nThe Team\n\nDeloitte's Advertising, Marketing & Commerce team creates content and experiences that inspire action. We design and implement technology platforms for personalized marketing across all digital touchpoints, specializing in customer-centric B2B and B2C solutions. Our in-house agency engages customers throughout their journey, working on projects like AdTech, MarTech, campaign automation, CRM, and lead-to-loyalty orchestration. Join us to drive impactful customer interactions and business growth.\n\nQualifications\n\nRequired\n2+ years experience in AI, machine learning, and/or data science.\nExperience with generative AI tools for software development, user experience, design, and product management.\nMust be legally authorized to work in the United States without the need for employer sponsorship, now or at any time in the future\nAbility to travel up to 50% on average based on the work you do and the clients and industries/sectors you serve\n\nPreferred\nExperience with cloud platforms such as AWS, Azure, or Google Cloud.\nKnowledge of software development best practices and agile methodologies.\nFamiliarity with product management and user experience design principles.\nExcellent problem-solving skills and the ability to work in a fast-paced, dynamic environment.\n\nInformation for applicants with a need for accommodation: https://www2.deloitte.com/us/en/pages/careers/articles/join-deloitte-assistance-for-disabled-applicants.html\n\nThe wage range for this role takes into account the wide range of factors that are considered in making compensation decisions including but not limited to skill sets; experience and training; licensure and certifications; and other business and organizational needs. The disclosed range estimate has not been adjusted for the applicable geographic differential associated with the location at which the position may be filled. At Deloitte, it is not typical for an individual to be hired at or near the top of the range for their role and compensation decisions are dependent on the facts and circumstances of each case. A reasonable estimate of the current range is $107,600 to $198,400.\n\nYou may also be eligible to participate in a discretionary annual incentive program, subject to the rules governing the program, whereby an award, if any, depends on various factors, including, without limitation, individual and organizational performance.\n\n#Customer_US\n\n#AMC_US"
  },
  {
    "title": "Machine Learning Engineer",
    "company": "Application House Limited",
    "location": "Remote",
    "salary": "Part-time",
    "url": "https://www.indeed.com/rc/clk?jk=03d85cb9014ad5ec&bb=y28L8yxWj-8FEEnz0rlSc-lNFJGMA5ZzsmM-wImZZlY1rTIsVRaogsHZd7Y_sKNWLpwMKvZuS7fhVgLsq5RsOvdPICymdGWa0cWQ2KIZjdqeOl8yGhq_FR7XrNsniJ0tHX65quQgFjmbwbR7MIOhgg%3D%3D&xkcb=SoAo67M3sjCVyYQpUp0LbzkdCdPP&fccid=d08ec6a6d9213a16&cmp=Application-House-Limited&ti=Machine+Learning+Engineer&vjs=3",
    "description": "Job Title:\nMachine Learning Engineer (Inference & Systems)\n(also known as Inference Engineer)\nLocation:\nWork from Home (fully flexible Remote)\nJob Timing:\nPart-Time, flexible any time that can be optionally transform to full-time\nAbout the Role:\nWe’re building a next-generation cloud platform to serve multimodal AI, LLMs, vision, audio and other machine learning models at scale. As a Machine Learning Engineer (Inference & Systems), you’ll design and optimize runtime systems, OpenAI-compatible APIs, and distributed GPU pipelines for fast, cost-efficient inference and fine-tuning.\nYou’ll work with frameworks like vLLM, TensorRT-LLM, and TGI to design, optimize, and deploy distributed inference engines that serve text, vision, and multimodal models with low latency and high throughput. This includes deploying models such as LLaMA 3, Mistral, diffusion, ASR, TTS, and embeddings, while focusing on GPU/accelerator optimizations, software–hardware co-design, and fault-tolerant large-scale systems that power real-world applications and developer tools.\nYou’ll work at the intersection of machine learning, cloud infrastructure, and systems engineering, focusing on high-throughput, low-latency inference and cost-efficient deployment. This role offers a unique opportunity to shape the future of AI inference infrastructure, from cutting-edge model serving systems to production-grade deployment pipelines.\nIf you're passionate about pushing the boundaries of AI inference, we’d love to hear from you!\nKey Responsibilities:\n· Deploy and maintain LLMs (e.g., LLaMA 3, Mistral) and ML models using serving engines such as vLLM, Hugging Face TGI, TensorRT-LLM, or FasterTransformer.\n· Design and develop fault-tolerant, high-concurrency, large-scale distributed inference engines for text, image, LLMs and multimodal models that are fault-tolerant, high-performance, and cost-efficient.\n· Implement, optimize distributed inference and parallelism strategies: Mixture of Experts (MoE), tensor parallelism, pipeline parallelism, tensor parallelism, pipeline parallelism for high-performance serving.\n· Integrate vLLM, TGI, SGLang, FasterTransformer, and explore emerging inference frameworks.\n· Build and scale an OpenAI-compatible API layer to expose models for customer use.\n· Experiment with model quantization, caching, and parallelism to reduce inference costs.\n· Optimize GPU usage, memory, and batching to achieve low-latency, high-throughput inference.\n· Optimize GPU performance using CUDA graph optimizations, TensorRT-LLM, Triton kernels, PyTorch compilation (torch.compile), quantization, speculative decoding to maximize efficiency.\n· Work with cloud GPU providers (RunPod, Vast.ai, AWS, GCP, Azure) to manage costs and availability.\n· Develop runtime inference services and APIs for LLMs, multimodal models, and fine-tuning pipelines.\n· Build monitoring and observability for inference services to integrate inference metrics (latency, throughput, GPU utilization) into monitoring dashboards (Grafana, Prometheus, Loki, OpenTelemetry).\n· Collaborate with backend and DevOps engineers to ensure secure, reliable APIs with rate-limiting and billing hooks.\n· Document deployment processes and provide guidance to other engineers using the platform.\nRequirements:\n· Experience: 3+ years in deep learning inference, fault-tolerant, distributed systems, or high-performance computing.\n· Proven experience in deploying ML/LLM models to production.\n· Inference: Hands-on experience with at least one inference engine: vLLM, TGI, SGLang, TensorRT-LLM, FasterTransformer, or Triton.\n· Runtime Services: Prior work implementing large-scale inference or serving pipelines.\n· Solid understanding of GPU memory management, batching, and distributed inference. Strong knowledge of GPU programming (CUDA, Triton, TensorRT), compiler, model quantization, and GPU cluster scheduling.\n· Experienced in the GPU/ML stack including PyTorch, Hugging Face Transformers, and GPU-accelerated inference.\n· Deep understanding of Transformer architectures, LLM/VLM/Diffusion model optimization, and KV cache systems like Mooncake, PagedAttention, or custom in-house variants solutions, with experience enhancing them for long-context serving and applying inference optimization techniques such as workload scheduling, efficient kernels, and CUDA graphs.\n· Comfortable working with cloud GPU platforms (AWS/GCP/Azure) or GPU marketplaces (RunPod, Vast.ai, TensorDock) to profile bottlenecks and optimize GPU utilization.\n· Benchmark and tune multi-GPU clusters for throughput and memory efficiency.\n· Experience building REST APIs or gRPC services (FastAPI, Flask, or similar).\n· Programming: Proficient in Python, Go, Rust, C++, CUDA for high-performance systems.\n· Systems knowledge: Demonstrated experience with distributed systems (storage, search, compute, or inference). Strong understanding of multi-threading, memory management, networking, storage, performance tuning.\n· Familiarity with containerization (Docker) and orchestration (Kubernetes).\n· Strong problem-solving and debugging skills across ML + infra stack.\n· Familiarity with distributed storage (Ceph, HDFS, 3FS).\n· Knowledge of datacenter networking (RDMA, RoCE).\nNice to Have:\n· Experience with Stripe or other billing systems for metered API usage.\n· Experience with large-scale datacenter networking (RDMA/RoCE).\n· Familiarity with distributed storage (Ceph, HDFS, 3FS).\n· Knowledge of Redis or Envoy for request rate limiting.\n· Familiarity with observability tools (Grafana, Prometheus, Loki).\n· Exposure to MLOps pipelines (CI/CD with Azure DevOps or GitHub Actions).\n· Exposure to observability stacks (Prometheus, Grafana, Loki).\n· Experience with model fine-tuning pipelines and GPU scheduling.\n· Understanding of rate limiting, quota enforcement, and billing hooks in ML APIs.\n· Prior work at an AI infra company (Together.ai, Modal, Anyscale, Replicate, etc.)\nWhy Join Us?\n· Work from Anywhere – 100% remote, with the freedom to work from anywhere in the world.\n· Fully Flexible Shifts – complete control over your working hours; results matter more than clocking in.\n· Career Growth & Fast-Track Promotions – we guarantee quickest promotion opportunities and clear pathways for advancement.\n· Professional Development – training budget, mentorship, and exposure to cutting-edge Salesforce, AI/ML, and cloud technologies.\n· Global Collaboration – work with an international, diverse, and inclusive team.\n· Innovative Environment – freedom to experiment with new tools, frameworks, and ideas.\n· Accelerated Salary Growth + Performance Incentives – ambitious and hard-working team members are rewarded with fast upward salary progression alongside strong performance bonuses\nAbout us\nApplication House is a Salesforce consulting agency that operates three different business models – on one hand, we place expert Salesforce staff into existing businesses to help them with their Salesforce needs, on the other, we take on Salesforce projects and deliver solutions for our clients.\nThird, truly reflecting the name House of the Application. We are developing a very advanced Application/Product that includes an Artificial Intelligence App including LLM hosted services, products like Uber, Zomato, Swiggy, Phonepe, Paytm, SMS/WhatsApp Messaging App, Fundraising & Payment App, etc.\nAre you excited to join a brilliant, intelligent team? Then why wait? Go ahead and apply the role.\nJob Type: Part-time\nBenefits:\nFlexible schedule\nWork Location: Remote"
  },
  {
    "title": "Oracle Generative AI Architect Specialist Leader",
    "company": "Deloitte",
    "location": "Seattle, WA",
    "salary": "$158,900 - $292,900 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0DIXU_djF9v0NrX_xbLRwj6RWFeuMEgTY6VvwKgvleOVG4FVVS6URhro_sUU09TyEjVQHNfxOOcL14U9sUT-1hwZUX56pOpEKJUdGcsCAyk7Qq5E5_K7eSrZglJw5DVl_XYzGCTKXLV2CfJvwvDI_1JOY0wlacuTGFgLnD5Q3-1F-CbrPivJjqOHlNJB60oOesw93Zz20z9Odb9hlka8Un6QuTA3aFihvFtl_zfkzbrwBKbOkSa1ydyWHPgj4yqsWg1ZClHqZwaUgfW1WlrNKHbV-YclTzDXsIhP3a_0GFYSfIIO3gmuLdgB9zlXGOrTnNJxpjNY0M3nl0jo0jUYivS0HTf3IytgmO0oU3e3b1BD4jAKID0GAeuNQ-2Hqvza1h757X-OktGJpSuBHzNNwow92C0Gzt3xFgWYwOXs0_uMocjojzmLX7PvOy3T5kI9fw4cp5kwaJv8CcCUDOdzGP4dy7G6Uei4D1MR2QXef2V6zNwYotKZzw-QRu0A94qNWW3IPpEL_1F6ferQpHoJwnR4_v3ocLBVSbU0-OS2b_wVK7wgF9xYt-GnLXxGZ-SSyagHEMUyiJcnR8hfvKr51PWin_4dOzyWAQCUGz6kGMuaFLqUwTb74ZQc-Xq4Od-P0D6Th2LrvWw157G_OfKmflHSTFNHV3CnwjsrGmBY4OBxFsbz1wYIcceKdVGNmtfNa8=&xkcb=SoAP6_M3sjCVyYQpUp0CbzkdCdPP&camk=ethIe0s0heeMtepOIg2GuA==&p=9&fvj=0&vjs=3",
    "description": "Today's chief financial officers (CFOs) and supply chain executives are being asked to improve business performance and shareholder value, along with operational effectiveness and efficiency. Deloitte Oracle Generative AI Architect Specialist Leaders help clients delineate strategy and vision, design and implement process and systems which align with business objectives and have a measurable impact on growth. Do you want to be a part of a team that transforms the business landscape for its clients? Do you want to be on the winning team that drives transformation, improves productivity, and streamlines business operations with AI? Do you feel your skills surpass those of your peers and colleagues? If your answer is yes to all these questions, it's very nice to meet you and we want to hear from you immediately!\n\nRecruiting for this role ends on 11/21/2025.\n\nWork You'll Do\n\nAs a Generative AI Architect, you will play a pivotal role in shaping the future of enterprise technology by designing and delivering AI-first solutions on Oracle Cloud Infrastructure (OCI). Leveraging your expertise in Oracle Fusion Applications-including ERP, SCM, HCM, and EPM-you will architect innovative systems that seamlessly integrate generative AI capabilities with core business processes.\n\nYou will collaborate with cross-functional teams to translate complex business requirements into scalable, intelligent solutions using OCI services and modern AI frameworks. Your work will enable organizations to achieve new levels of automation, insight, and operational efficiency.\n\nIn addition, you will stay at the forefront of the AI landscape by working with leading platforms such as Microsoft Copilot, Google Cloud Agent Space, LangGraph, Glean, and other enterprise AI technologies. Your deep understanding of these tools will help bridge the gap between emerging AI advancements and mission-critical enterprise needs, driving measurable business value.\n\nResponsibilities will include:\nDevelop and align enterprise AI architecture on OCI, focusing on generative AI and Oracle applications.\nArchitect and deliver integrated AI solutions, including agentic workflows and RAG pipelines.\nEnsure governance, security, and compliance for AI/ML initiatives.\nIdentify high-value AI use cases and guide teams on prompt engineering and model optimization.\nCollaborate with stakeholders, mentor teams, and lead technical reviews and pilot deployments.\n\nThe Team\n\nOur Oracle offering drives business transformation services to improve performance and value delivered by the full suite of Oracle solutions.\n\nGot your head in the cloud? With so much technology moving to the Cloud, our business requirements are taking us to new heights. By harnessing the power of Oracle ERP Cloud, you can streamline enterprise business processes with ERP Cloud's Financials, Procurement, or Portfolio Management. Do you have the ability to transform an organization through the latest social, mobile, and analytic technologies? We're looking for someone that can increase the effectiveness of decision making and drive innovation. If your head is in the cloud, find out where we can take you with Oracle Enterprise Solutions. Learn more about our Oracle practice .\n\nQualifications\n\nRequired:\n10+ years in enterprise architecture, with at least 3+ years in AI/ML or Generative AI solutioning.\nStrong expertise in Oracle Cloud Infrastructure (OCI) services (GenAI Service, Functions, API Gateway, Data Science, Autonomous DB, OIC).\nSolid knowledge of LLMs, embeddings, RAG, multi-agent systems, and integration with enterprise apps.\nExperience in Python, SQL, REST APIs, and cloud-native design patterns.\nFamiliarity with security, compliance, and governance in cloud/enterprise environments.\nAbility to travel 50% on average, based on the work you do and the clientsandindustries/sectorsyou serve.\nLimited immigration sponsorship may be available.\nA Bachelor's degree\n\nPreferred:\nExperience with Fusion AI Studio and Redwood UI extensions.\nPrior experience with Oracle ERP Cloud (Financials, SCM, Procurement, HCM) or Oracle E-Business Suite, JDE, PeopleSoft.\nAwareness of enterprise AI platforms such as Glean, Moveworks, or similar for enterprise search and productivity AI.\nExposure to cross-cloud AI ecosystems (AWS, Azure, GCP) alongside OCI.\nKnowledge of modern AI frameworks (LangChain, LangGraph, NVIDIA NIM, Hugging Face).\nProven track record of leading AI/ERP transformation programs in large enterprises.\nStrong communication skills to engage both executive stakeholders and technical teams.\n\nInformation for applicants with a need for accommodation:\n\nhttps://www2.deloitte.com/us/en/pages/careers/articles/join-deloitte-assistance-for-disabled-applicants.html\n\nThe wage range for this role takes into account the wide range of factors that are considered in making compensation decisions including but not limited to skill sets; experience and training; licensure and certifications; and other business and organizational needs. The disclosed range estimate has not been adjusted for the applicable geographic differential associated with the location at which the position may be filled. At Deloitte, it is not typical for an individual to be hired at or near the top of the range for their role and compensation decisions are dependent on the facts and circumstances of each case. A reasonable estimate of the current range is $158,900 - 292,900\n\nYou may also be eligible to participate in a discretionary annual incentive program, subject to the rules governing the program, whereby an award, if any, depends on various factors, including, without limitation, individual and organizational performance\n\n#EPCore\n\nO2FY25"
  },
  {
    "title": "Freelance AI Trainer - Data Contributor",
    "company": "TaskUs",
    "location": "Oceanside, CA 92056",
    "salary": "$50 - $100 an hour",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0AT83r-ZJHFmTpjXL7rqMN5b4T1oQnn1iT6NBzO-fhu6N-oNDDlo0IGIboHlSGvGuq2OgYlII9MKsu2oqLz402RbOIXd2lDS6RAwmoUyHXV3wiWZeKDVxKGdQNTOYQZ7kBCvZv8Exja_7FaZN2sejlYzLUlSj4_Xj9EnMr-sfEL9pw_2x3GuZ57d_XWpLPpzcp3M7Ncd_nYrshGcexLzqVsilLQe7J5BvlR2IyoWIeTERLrIk0wc9e2aifTpp5ZorTEoD8GefcqrjihhwO1pjmwiUq-SIPJHmUFuOIeuriiJ2AerKMb8tavMe2kxgp-zBdVnTzuOxYONHCyx4tepVq1qqs-S9zzcOQ207Px3Tirry6cn5oTpsL4q_MFmUEaGj0IfX3OMdbhYHb-jJ751QBgpIknY_Cfr0p7KRCAdNJ3qACncUaHEmbgaXPq1uTpnIfQz2xF02AlNDkeiBCHfN4m7u7zJ1tf_OgSjybT-LeSGwFObqWu1PMiktY9hboWuq8p3pZ1dEqIfBtZ06yHaepRSo_sK7w_FD02EosdCw0Ex91EX0NMCyslKgQ7SVIOAdKvBjAQylkqdR5SJ64_jVhXwIFAjOZ8tPpHkLFqBhvxIGV5ipQ0-Vh3GO-kedFLRP1yC_-Ni5NSFV2hdKUhdNHzDJ5dr8L2jnYUjcrsr2KgW4D72mjIdZ7o7QxBW0TO4zV1f4K1aKcipUvlK8GZuPmJc3Ni2b4FdLzCYwXNO1-jWFjOK-cnp2WgGijTkcqoAM9-gXHseno5HNM3NF3L4EHgjRXoIyXFWwgtwxhBlvPoU5ETEUoxlxDshnP2-ge7Tq2l_PtmzNgLviyIal2pmduf&xkcb=SoCB6_M3sjCVyYQpUp0FbzkdCdPP&camk=UoKtGZLa3XKCS-keCIVOEQ==&p=14&fvj=0&vjs=3",
    "description": "We at TaskVerse are looking for enthusiastic individuals to participate in an exciting, in-person video recording project in Oceanside, California. This project is a chance to contribute to the development of next-generation technology while earning a great rate.\nAbout TaskVerse\nTaskVerse is a platform that offers a variety of freelance tasks, giving you the flexibility to earn money on your own schedule. We connect people from all industries, including retail, students, and many others, with diverse opportunities, from data collection and prompt creation to testing and research projects.\nYour profile helps us find the best projects for you. The example below shows the kind of tasks we offer, but your access to specific tasks will be based on your unique skills.\nAbout the Task:\nThis specific task is designed to enhance next-gen technology, and your participation will directly contribute to building smarter AI systems.\nResponsibilities\nParticipate in a short in-person session at a designated location in Oceanside, CA. The video data collected will be used to train and improve next-generation AI, helping these systems better understand human movement.\nPerform a series of hand gestures and basic body movements as instructed. Your movements will help us build more inclusive and effective AI technologies.\nFollow directions carefully to ensure video data meets our quality standards.\nComplete a one-time session lasting approximately 90 minutes (travel time excluded).\nRequirements\nMust be 18 years or older.\nMust reside in the United States.\nMust be willing to travel to Oceanside, California, for the session.\nComfortable following physical movement instructions.\nNo prior acting experience is required—just show up and follow the lead!\nContract Timeline\nThis is a one-time, in-person session that will take . You will be able to choose from our available slots (five slots per day, Monday through Friday) to find a time that fits your schedule.\nAvailability\nYou'll be able to choose your preferred time slot by filling out the interest survey after signing up on TaskVerse. Sessions are limited, and spots will be filled on a first-come, first-served basis.\nCompensation\n$150 for selected main participants.\n$80 for selected backup participants who remain on standby.\nNote: The selection for main participants will be on a first-come, first-served basis for available slots.\nData Use\nAll video data will be used strictly for research purposes. It will remain anonymous, confidential, and will not be shared publicly.\nWe Value Diversity\nWe welcome applicants from all walks of life. Diversity helps us build better, more inclusive AI technologies.\nHow to Get Started\nSign up on TaskVerse : https://taskus.me/4gfDDCo\nComplete your profile.\nFill in the interest survey to select your preferred time slot.\nIf selected, you'll receive all the necessary details via email.\nThis is a great opportunity to earn fast cash and contribute to cutting-edge technology. Feel free to share this with friends and family who might be interested!\nJob Type: Contract\nPay: $50.00 - $100.00 per hour\nExpected hours: 1.5 per week\nBenefits:\nFlexible schedule\nWork Location: In person"
  },
  {
    "title": "",
    "company": "",
    "location": "",
    "salary": "",
    "url": "https://www.indeed.com/viewjob?jk=cdef0123456789ab",
    "description": "None"
  }
]