[
  {
    "title": "Associate, Software Engineer (Rochester, NY)",
    "company": "L3Harris Technologies",
    "location": "Rochester, NY 14603 \n(Central Business District area)",
    "salary": "$64,500 - $120,500 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0DjqY-5FTLZ9sGqV1NdtUFS0adUf_1WjOQKs6vVybF7K6PTGG98n5L3pcE8-e3Q-obCnGp15yBFaGpozYjlziwxOVaOUNqyHfjwfBNojsiUZSbd23iUh-Pu3w0OO8cSvv183eJCx5-CKkGX8ne18mexq8j2iyQ9lS2PoFhU4Wi8lPkoH2SzoWUC2Th0mUUGvLCSdJdo6_Ac8b_6YcuPtjeg6yfTP72GqHxx83xBUL754EGh-SQFMFPTpA0DV36rx-lnInCs9ES7C1nsEZg2tc3NTKNDjkf_SYT9SV_wK7ssS4b6uwYrVTvYmOUsXznlpYg-UotkHeeo87enlBN_6I_UFEx57sGr_7N9HgeIK88y_3lg39Fx4xPzJtre4dyKUULPV7BBbBlqm2WlwNgqZPWwij4pvd8NYPnMHKz3JAEKvOYEltPOXvUZmfHC8tYMTeDvbT52_b9TktDjONTriGDUdbNHREScV_gt-T6PelUgPrX-uneqpfyL85rgkWTvcUX17Tj5mMyWt90Ep__Z1PScK51g4jMYuWLreTW-lM7tbHcw_riQ4uzATWFFAPlJJ1bF9VMZP2nlXeQgxNdsYQuQpfls6lFQnG-CFIFG647L2mTALcz1-Fk22mDiNMoWsSueD8yokjWxpK-hgNFVHOGw6QVlNA4ogM4CyL2v2Aw53VAGd3Q8fWViL-IcDp_EpWm1isHnJWdKrWyTfbY7LSRF_mxHLYQRDyymQjR4OOjmtJxjrIIEWM6U1_TbYBm7nnCSg5jYpe4rKjokn_C4eM1Nx_LeXQqN_fyVWRkNSUHGrrYEOvbgh8fAJpJx-J9ZfFY=&xkcb=SoCk6_M3sjCkNN0HpJ0AbzkdCdPP&camk=4HOcmqOLYrB6ue9kfSv09Q==&p=11&fvj=0&vjs=3",
    "description": "L3Harris is dedicated to recruiting and developing high-performing talent who are passionate about what they do. Our employees are unified in a shared dedication to our customers’ mission and quest for professional growth. L3Harris provides an inclusive, engaging environment designed to empower employees and promote work-life success. Fundamental to our culture is an unwavering focus on values, dedication to our communities, and commitment to excellence in everything we do.\nL3Harris Technologies is the Trusted Disruptor in the defense industry. With customers’ mission-critical needs always in mind, our employees deliver end-to-end technology solutions connecting the space, air, land, sea and cyber domains in the interest of national security.\nJob Title: Associate, Software Engineer (Rochester, NY)\nJob Code: 25621\nJob Description:\nApply computer science, engineering, and mathematical analysis concepts and principles in the development of software for the target application\nWork closely with cross functional members of the engineering organization to develop and evaluate interfaces between hardware and software, and operational performance requirements and design of the overall system\nSupport and participate in all phases of the software development life cycle, including requirements analysis, design, implementation, integration, and test of embedded software for real-time control of advanced tactical radio equipment\nDevelop software test procedures, software programs, and related documentation\nUtilize modeling tools and equipment to establish operating data, conduct experimental tests, and evaluate results\nParticipate in peer reviews, identify, track and repair defects\nUtilize a variety of software languages (i.e., C++, C#, C, Java, Ruby, HTML5, XML, SQL, Perl, Python, Ajax, Qt) on Windows, Linux, mobile platforms, and embedded real time operating systems (VxWorks, Linux, QNX, Integrity, Windows CE, and others for Motorola, Intel, TI, and custom processor designs)\n\nQualifications:\nTo be eligible, applicants must be pursuing a Bachelor’s Degree in Computer Science, Computer Engineering, Software Engineering, Electrical Engineering, Wireless Engineering, Information Security, Mathematics, Digital Arts & Sciences or related field or have completed their Bachelor’s degree within the last 12 months, regardless of age.\nPreferred Skills:\nOne or more of the following: C++, C#, C, Java, Ruby, JEE, HTML5, XML, SQL, Qt, Windows, .NET, Unix, Linux, SOA, RTOS, Real-Time Controls, Wireless, Software Security, Robotics, OOA/OOD, Hadoop, Android, Embedded Systems\n\nIn compliance with pay transparency requirements, the salary range for this role in Colorado state, Hawaii, Illinois, Maryland, Minnesota, New York state, and Vermont is [$64,500- $120,500]. This is not a guarantee of compensation or salary, as final offer amount may vary based on factors including but not limited to experience and geographic location. L3Harris also offers a variety of benefits, including health and disability insurance, 401(k) match, flexible spending accounts, EAP, education assistance, parental leave, paid time off, and company-paid holidays. The specific programs and options available to an employee may vary depending on date of hire, schedule type, and the applicability of collective bargaining agreements.\nL3Harris Technologies is proud to be an Equal Opportunity Employer. L3Harris is committed to treating all employees and applicants for employment with respect and dignity and maintaining a workplace that is free from unlawful discrimination. All applicants will be considered for employment without regard to race, color, religion, age, national origin, ancestry, ethnicity, gender (including pregnancy, childbirth, breastfeeding or other related medical conditions), gender identity, gender expression, sexual orientation, marital status, veteran status, disability, genetic information, citizenship status, characteristic or membership in any other group protected by federal, state or local laws. L3Harris maintains a drug-free workplace and performs pre-employment substance abuse testing and background checks, where permitted by law.\nPlease be aware many of our positions require the ability to obtain a security clearance. Security clearances may only be granted to U.S. citizens. In addition, applicants who accept a conditional offer of employment may be subject to government security investigation(s) and must meet eligibility requirements for access to classified information.\nBy submitting your resume for this position, you understand and agree that L3Harris Technologies may share your resume, as well as any other related personal information or documentation you provide, with its subsidiaries and affiliated companies for the purpose of considering you for other available positions.\nL3Harris Technologies is an E-Verify Employer. Please click here for the E-Verify Poster in English or Spanish. For information regarding your Right To Work, please click here for English or Spanish."
  },
  {
    "title": "Software Developer - C++/MatLab/Simulink",
    "company": "Peraton",
    "location": "Huntsville, AL 35808",
    "salary": "$112,000 - $179,000 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0BWrJOJIc9CpN6yMpv0V0AydpTkzwx7H4nhH8WAx3qz9LO0mISChZgts3QCvI8K0It7Wi29esnR8ma2eI3S0nTfPcjFrosi4s-MjiafRGjvsci4DY1G17YRkW0N9VdjA4SIx9_d3Jnem_hueXDZ5u-JnHsiULKkChk_P3kQADjcnFwRL8-HHbmhL05Jk0Z6OFLsfCjLXrSMe9_ZGfRB9zDdqnIPiMX64_QBR3pHSCDheZudrdhoNguoiTfLKL0hG_cSZQKM8HwKpjTLPLf6GO3ONKEDB1QebN73kn4s3J0kBCCdrWVIjB-3DrkG40Vi-zOjIx75tLe8EAQoZ0_9vjeMpMKQCoEeq1U8Li4GSQ2uW8kwLUZbf1jOgTq2o-DOgSFr9RTawhSLABbUA_Q7HLj1xhhNYKjxoWG7X_rHZNspIB41f1bSNltrwn10kGLHGDZ6Nv45GAew5uBHZoUciEcvmLqRUVz1ttBBLApyTxGyZ4VzQr_xtas0fvK3RLsBpNh9tP1z7D9IKmkx8X1H4apTdzgfOUMdJHv6byL0yODeOX6dcVb1g66pIrteDUiqdvM6QQVMMmYi7fEIggg1Lc8WIuCWBXmalninKqTOpcmSKE_IRex1YuROMLC62iY9DeErI8VQq-JyoD5mEltiNM1zUDevMaMn_r9_g1pKx03JYdLpyC11e1CEst8SgZipFsKFqmkKMajPNlwVt79rH7_6IlI5PbhUdP7Bwf_ZL2Nbb7e-CNoBfUcnOJ65LWduOGPjOiE2rH05XkpHfMu19jl9jBCkIukZEzIOKs9FFfAiH76mqhRX1hRo9Desmp0zzZVdNsJQZBSdUKWXm6W5RgX3x5CwN6T_8RI=&xkcb=SoCe6_M3sjCkNN0HpJ0GbzkdCdPP&camk=nUmJqO2E8riLxIhWV1rwzg==&p=13&fvj=0&vjs=3",
    "description": "About Peraton\nPeraton is a next-generation national security company that drives missions of consequence spanning the globe and extending to the farthest reaches of the galaxy. As the world's leading mission capability integrator and transformative enterprise IT provider, we deliver trusted, highly differentiated solutions and technologies to protect our nation and allies. Peraton operates at the critical nexus between traditional and nontraditional threats across all domains: land, sea, space, air, and cyberspace. The company serves as a valued partner to essential government agencies and supports every branch of the U.S. armed forces. Each day, our employees do the can't be done by solving the most daunting challenges facing our customers. Visit peraton.com to learn how we're keeping people around the world safe and secure.\n\nProgram Overview\n\nAbout The Role\n\nOverview:\n\nPeraton is seeking a skilled Software Developer to join our Joint Simulation Environment (JSE) team. In this critical role, you will support the development, integration, and testing of advanced threat missile and radar simulation models used in high-fidelity defense simulations. This position provides the opportunity to directly impact national security by delivering realistic and validated models for mission-critical environments.\n\n**Experience with C++ and MatLab/Simulink. Familiar with the AGILE process, with tools like JIRA, GitLab etc. and ability to write efficient code required**.\n\nWhat You'll Do:\n\nDesign and implement high-fidelity threat missile and radar simulation models that replicate real-world systems and behaviors.\nEnhance and maintain existing models using advanced modeling and simulation tools in alignment with the Missile and Space Intelligence Center (MSIC) delivery schedule.\nIntegrate threat models into the JSE simulation architecture, performing thorough integration and regression testing to ensure operational performance and reliability.\nAnalyze simulation outputs, validate models against empirical data, and refine systems for improved realism and predictive accuracy.\nUtilize technical data packages and intelligence sources to inform model development and contribute to test planning and execution.\n\nQualifications\n\nMinimum of 8 years with BS/BA; Minimum of 6 years with MS/MA; Minimum of 3 years with PhD\n\nRequired Qualifications:\n\nTS/SCI clearance adjudication with ability to pass a poly\nBachelor's degree (or higher) in Engineering, Computer Science, Physics, or a related technical field.\nC++ and MatLab/Simulink experience, more along the traditional \"software developer\" lines.\nFamiliar with the AGILE process, with tools like JIRA, GitLab etc. and ability to write efficient code.\nFoundational understanding of missile and radar systems modeling.\nExperience working with cross-functional teams and effectively communicating technical concepts to both technical and non-technical audiences.\nStrong analytical skills, attention to detail, and ability to work both independently and collaboratively.\n\nSCA / Union / Intern Rate or Range\n\nDetails\n\nTarget Salary Range: $112,000 - $179,000. This represents the typical salary range for this position. Salary is determined by various factors, including but not limited to, the scope and responsibilities of the position, the individual's experience, education, knowledge, skills, and competencies, as well as geographic location and business and contract considerations. Depending on the position, employees may be eligible for overtime, shift differential, and a discretionary bonus in addition to base pay.\n\nEEO: Equal opportunity employer, including disability and protected veterans, or other characteristics protected by law."
  },
  {
    "title": "Staff Diagnostic Software Development Engineer",
    "company": "General Motors",
    "location": "Warren, MI",
    "salary": "Full-time",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0BqJjBsvJkVIRVupdyx-l7jJlkPL5nU6SVET5Mq4mDejegpz4R4z9X6QNcQ1GgqKr5R20JuFS60EB-AtMu1cCd5Eq4LsUg1L7eor4XcLMQ-8kAXCxMbzuzI63OMDuy4aNT-sHMtSvhgM0_em3qA3T8u6roBrS373J78Q5zWBaLorhBlhaUZEWjJQuoZWsLg2j3SSkC3vLtPDGz86a4gOZWkoC1v0fyZrFxiYnfyas3H38b-n3SlzSLC8JQ-bwRv4342b2iAaZbOn4JndEKxqyDoZrBvN7l4-_HUGgBUtjnoAmYO4eFCW0wUABaeIVQx2ezYC1zqif9f9hw4WasJBKDjYh8lI3yb9KI2Zwphv2fpefaUHs1-iwsRLQ0HXBzsm75gZvzzoMYtC6oj97eKTfHMbKTB6fLX1cni80GoUDskwYo96pqmj3J9hKrG_1CAljGiPXGT6YTeioPgJ75flrxMASM5rd5GTOTlpqeeeZVD1XkvShxQWX1_8xJV7S9pMo3hynwDtwtjiKwckwg2mzp3gbRCvq3Zj60e7V0fUhtwGIIKAFI99Ioovbk1myWoiOJUSfYnTkK5doODSKasbwfF-NMPd4qzncSYGVo5zJVtmp2ISCuz-Ty4qz5OO2Ij_p-9ExWv058ovDDbVsaDJmI9kSjGOhwqMnPvEOBRqbJS52-DDCUV6nQx0nmjz940XgSU_eFk_A60JD78uP0mzGo8W0j5JbSQePmPHAPEjuVHTmewSX9cVK7Z-DvHo8wRDEpvrvOnHftiKK7hAl03-4Kpw4h-HCHpOgI=&xkcb=SoB36_M3sjCkNN0HpJ0JbzkdCdPP&camk=nUmJqO2E8rh8JLMt8M-EVQ==&p=2&fvj=0&vjs=3",
    "description": "Job Description\nHybrid: This role is categorized as hybrid. This means the successful candidate is expected to report onsite at the Warren-MI, or Milford-MI, or Austin-TX location at least three times per week minimum or other frequency dictated by the business. This job may be eligible for relocation benefits. This job may be eligible for relocation benefits.\nThe Role:\nWe are seeking a highly skilled and motivated Staff Diagnostic Software Development Engineer to join our team at GM Software & Services in the Diagnostics Hardware and Software department. In this role, you will act as the subject matter expert in diagnostic tool software development, responsible for architecting new diagnostic software applications and core diagnostic software libraries, along with their interfaces.\nThe ideal candidate will possess strong analytical and problem-solving skills, with a proven ability to collaborate effectively in a cross-functional team environment. You should demonstrate exceptional attention to detail, a commitment to delivering high-quality software solutions, and the ability to adapt to changing priorities.\nAs a Staff Diagnostic Software Development Engineer, you will play a critical role in defining the next generation of Diagnostic Service Tool Applications. Your work will be conducted in a centralized engineering environment, where you will exercise the highest levels of creativity, initiative, and independent judgment.\nJoin us in delivering innovative solutions and technologies that enhance the GM vehicle ownership experience and ensure the long-term satisfaction of our customers. This is an exciting opportunity to contribute to the development of cutting-edge software solutions that enable efficient and accurate vehicle diagnostics across the GM Dealership network and the GM Enterprise.\nWhat You’ll Do (Responsibilities):\nLead the Service diagnostic tool software architecture development.\nOwn the diagnostic tool software application strategy for the development of in-house diagnostic software, collaborating effectively with cross-functional teams.\nOversee GM's Service diagnostic software strategy to support new vehicle architectures, including Software Defined Vehicles (SDV).\nCreate and manage comprehensive architecture diagrams and plans.\nReview and approve Engineering Change Requests that impact GM S&S diagnostic tools and software globally.\nStay up to date on industry best practices and trends relevant to the position.\nCommunicate technical issues and decisions efficiently to management.\nCollaborate with other Service Diagnostics and Programming related teams to analyze and address potential application issues.\nAssist in resolving vehicle diagnostic problems by reviewing vehicle communication logs and other data records.\nDeliver new software solutions that comply with GM Vehicle Cybersecurity diagnostic requirements.\nRepresent the GM Diagnostics Hardware and Software Team internally and externally through automotive industry work groups (ISO, SAE).\nYour Skills & Abilities (Required Qualifications):\nBachelor’s degree in Electrical, Software Systems, Computer Science, Computer Engineering, or a related field.\nProven expertise in C/C++, C#, Java and Python programming languages.\nA minimum of 10 years of experience in software development, with a strong focus on diagnostic software applications and diagnostic tools.\nExperience in diagnostic strategy and software architect.\nExperience in Object-Oriented Programming.\nKnowledge of vehicle serial data protocols: CAN (ISO15765), UDS (ISO14229), DoIP (ISO13400), GMLAN, SAE J1850, and KWP2000.\nExperience reading vehicle communication logs collected from CAN bus loggers and Wireshark.\nUnderstanding of vehicle electrical architecture systems and standards.\nStrong analytical, problem-solving, and root cause analysis skills.\nEffective technical communication skills in English.\nDemonstrated analytical, problem solving, and root cause analysis skills.\nExcellent multi-functional communication and collaboration skills.\nProven results in successful project execution.\nWhat Will Give You A Competitive Edge (Preferred Qualifications):\nMaster’s degree in Software Engineering, Computer Science, Computer Engineering or related.\nBlack Belt DFSS Certification.\nExperience in embedded software development.\nExperience in PC-based software development.\nFamiliar with GM’s Global Diagnostics Tool (GDS 2), Service Programming System (SPS 2), and Global Test System (GTS).\nExperience with vehicle Ethernet networking\nService Engineering, Manufacturing Engineering or IT experience.\n\n#LI-EL1\n&#xa;&#xa;&#xa;&#xa;\nAbout GM\nOur vision is a world with Zero Crashes, Zero Emissions and Zero Congestion and we embrace the responsibility to lead the change that will make our world better, safer and more equitable for all.\nWhy Join Us\nWe believe we all must make a choice every day – individually and collectively – to drive meaningful change through our words, our deeds and our culture. Every day, we want every employee to feel they belong to one General Motors team.\nBenefits Overview\nFrom day one, we're looking out for your well-being–at work and at home–so you can focus on realizing your ambitions. Learn how GM supports a rewarding career that rewards you personally by visiting Total Rewards resources .\nNon-Discrimination and Equal Employment Opportunities (U.S.)\nGeneral Motors is committed to being a workplace that is not only free of unlawful discrimination, but one that genuinely fosters inclusion and belonging. We strongly believe that providing an inclusive workplace creates an environment in which our employees can thrive and develop better products for our customers.\nAll employment decisions are made on a non-discriminatory basis without regard to sex, race, color, national origin, citizenship status, religion, age, disability, pregnancy or maternity status, sexual orientation, gender identity, status as a veteran or protected veteran, or any other similarly protected status in accordance with federal, state and local laws.\nWe encourage interested candidates to review the key responsibilities and qualifications for each role and apply for any positions that match their skills and capabilities. Applicants in the recruitment process may be required, where applicable, to successfully complete a role-related assessment(s) and/or a pre-employment screening prior to beginning employment. To learn more, visit How we Hire .\nAccommodations\nGeneral Motors offers opportunities to all job seekers including individuals with disabilities. If you need a reasonable accommodation to assist with your job search or application for employment, email us or call us at 800-865-7580. In your email, please include a description of the specific accommodation you are requesting as well as the job title and requisition number of the position for which you are applying."
  },
  {
    "title": "Senior Cloud Software Developer",
    "company": "Space Telescope Science Institute",
    "location": "Hybrid work in Baltimore, MD 21218",
    "salary": "Full-time",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0Dx6RNK3oI658vq4-fl1cPO0MaL36gW1qNhHGqaWSoNW_bgH1EeHkF7LReyNoRfOXH2D8A4tZUzbTugUdbu6mJM08uucx4Pvjy2eauu5gNkxK7gIRi1N4PNHU56KWTGiq6emvlzj91AVFl_BUEu6wbyA6PrACe5N7nWbRArWKr8muQ_gqWXKF30OjzJV3NOU-tzwatrIyZHaSmnL-gtF0D5bfhOsdMHClgbI97u5zNzLRs1Hpkqm3rrMG1-Ofk8LbPf4wItg96FgxLNaDTJ0IPSwCTkeAcPWQjSjaDLfX7dnrR67PHgKmkSugrUpSwkbo3PkBhrLxIXOis3UisrwNEn6rs9BKWWn0Nxytt8MVCqHAT5jScdbbm-Qh1twI77V5a6n2mJ0CY-B5LmkrFi0hzfyYbvWLSIDAuJfH6VScPJ-iSSFdYUSzY6kE7_jGlNeiIk_Xz6_KfjCxRWCYIQj7sUwuDyTEKNBylpZJzv0SgSHd91wcnGF6_sT7KUZHoIeT-BfXINqSWF9jw3hJ4v5MfqMOHNh-Y7X1s4Xw1AKae8AmKdOi9Hd8_rEC0qptdAjYRFNs9QK_nlI8FdHVuk04gVaBGvWqTv_rDaTpsex5O5_FhJazQaEoGWe6jH6cAZCWxYoofhjCrwHxMx1z638J_J9hilwhVVH3DS6q2bUslCOCmNCLD7aJ7WRyLxt2PqXViCowLXd8gJ-OqA_OCWE7WqmGhq0x8XRJy-tpDBMS2EP4j-bLXzFLKwMWUquu9nVQJqRYzV4D640I9ISh29-m9tOFANX0HwbI_PQYlrIHvO1S_sUitDiBwv9pV8dIuDBSCDjDMMcsxUZl0RFPuF9X0AUHTDdvDB1bsIxmVtXFIpJz1PVSdH8KM-ddrlzHJs4SQ=&xkcb=SoBk6_M3sjCkNN0HpJ0NbzkdCdPP&camk=nUmJqO2E8ri7mFWhcXnKAQ==&p=6&fvj=0&vjs=3",
    "description": "About the Role\nThe Data Management Division (DMD) at Space Telescope Science Institute (STScI) is seeking a highly skilled Senior Cloud Software Developer to lead the design and development of cloud-native platforms, software tools, and data processing pipelines that support the Roman Space Telescope and the broader astronomy community. The Space Telescope Science Institute (STScI) is a multi-mission science and flight operations center for NASA’s flagship observatories on the Johns Hopkins University Homewood campus in Baltimore, Maryland. Learn more about our missions.\nThis role is ideal for someone with deep experience in database performance tuning, information architecture, and workflow orchestration for large-scale data processing. You’ll be part of a collaborative team working in a cloud computing environment to deliver high-quality, science-ready data products.\nCandidates must reside in or be willing to relocate to our local market (MD, DE, VA, PA, DC & WV).\nThis position requires US Citizenship or Permanent Residence to meet ITAR requirements.\nThe annual salary range for this senior level role is $130,000 - $150,000. The posted salary range represents a general guideline; however, STScI considers several factors when determining base salary offers, such as internal pay equity, the scope and responsibilities of the position, the candidate's experience, education, and skill, and current market conditions. The substitution of additional relevant education and/or experience for stated qualifications may be considered.\nKey Responsibilities\nDesign and develop scalable, reliable, and secure AWS-native cloud applications.\nBuild infrastructure using Infrastructure as Code (IaC) tools such as Terraform and CloudFormation\nDevelop and optimize data pipeline systems for astronomical data processing.\nImplement CI/CD/CT pipelines for automated build, deployment, and testing.\nLead efforts in database performance optimization and schema design for large-scale relational and cloud-based databases.\nArchitect and manage workflow orchestration systems (e.g., Apache Airflow or similar tools) for complex data processing tasks.\nPreferred Experience & Skills\nBachelor’s degree in computer science, Engineering, or related field with 8+ years of experience in AWS cloud environments\nProven expertise in cloud-native application development and cloud infrastructure management\nExpertise in containerization and Kubernetes\nIn-depth knowledge of AWS services (EC2, Lambda, SNS/SQS, RDS, S3, Glacier, API Gateway)\nProficiency in Python, Java, BASH\nExperience with IaC tools: Terraform, CloudFormation\nExperience with CI/CD/CT platforms: GitHub Actions, GitLab CI, CodePipeline, Ansible\nExperience with Kafka, or a similar technology\nStrong experience with PostgreSQL or similar relational databases, including performance tuning and query optimization.\nExperience designing data architectures for large-scale systems.\nFamiliarity with ETL processes and data lake architectures is a plus, though not essential.\nExperience with the Jupyter ecosystem and cloud-based data storage management is beneficial.\nWhy Join Us?\nYou’ll be part of a mission-driven organization supporting cutting-edge astronomical research. You’ll work with a team of software developers and astronomers to deliver critical science products and data processing tools. We offer a flexible hybrid work environment, competitive compensation, and the opportunity to work on impactful projects that shape the future of space science.\nWe offer an excellent and generous benefits package, tuition reimbursement, flexible work schedules and a stimulating and diverse work environment. Explore our benefits: http://www.stsci.edu/opportunities/benefits\nTO APPLY: Share your experience by uploading a resume and completing an online application. Applications received by September 30, 2025, will receive full consideration. Applications received after this date will be considered until the position is filled.\nDirect Link: https://recruiting2.ultipro.com/SPA1004AURA/JobBoard/93330e50-7b3a-4ba8-94f2-6f32360aa4e1/Opportunity/OpportunityDetail?opportunityId=1f644ff3-2cc0-4a6c-b166-fd4f23cbff59\nIndividuals needing assistance with the employment process can contact us at careers@stsci.edu.\n#LYHYBRID\n\nEqual Opportunity Employer\nThis employer is required to notify all applicants of their rights pursuant to federal employment laws. For further information, please review the Know Your Rights notice from the Department of Labor."
  },
  {
    "title": "EHR software Developer",
    "company": "Positive Pathways",
    "location": "Indiana",
    "salary": "$35 - $45 an hour",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0AW1uBLAUAe8YC-x7zyXDpPZEaIe13dq033U-ZWJvVENOR8iPXJX8YOkZtmmkzrvjRiOarbsHqHTbeZD9DGbhoTqHP5FEcLbn7DT-577cHVbQxQbHMs6Za-7bfFRO-nek68IbLauCxih43-Iq3k8gmzN03jdVHx520uy32cpOeedCQueCs1fgop4Gf1sbTRlSLf05oRFMWa85kdL3ZPDHKMj9sDtKcK-LG3YjGx43qImVPJQM7HxznkTPwh72TEmlU-FSIUE6bbV7ulHNKw5LQOsR26IjvzcT-qp1uijbXUSSZmj6b6Vz-2kd_gsAxBYM-k9mc1cIPLfinVE5UJICcJ0zE3fhAGa6DwCVsKLgYP-zvyeFx_j20_XsIKAVqKoHF1O-k-egOlqra1Lv4FmwA_E5GMiNW_Wagp0RTC44ozXbQVCbGKD7s1Z4mJrDaKWrXYeRCMagDNrcd4-kse_z9XNA_KB6JiCp47zATHJHQGBAW5b1510baVrNrphNaC9L1S5O31vDdlFr-uSS8Ia1OLY9tQ5ZEHEWWcpLyZTw5MICbk6oZ79O0WjKLFElydAHFGwtYTXVOp0aSirH2yB4Qw1BFLeNnxOHqhtCtfGD7RI3Fzsa02JFUi_IDt_lt-hhVJXvLxa-4C7a83X2VtVXlvuPhbb6ZyIuZbXVwaKf2fN5MmTC2uRCIVtWGieV9ZN4QBsPWPL-nXmw==&xkcb=SoBe6_M3sjCkNN0HpJ0LbzkdCdPP&camk=UoKtGZLa3XK9bm2F0bdAkg==&p=0&fvj=0&vjs=3",
    "description": "Job Overview\nWe are seeking a talented and motivated Software Engineer to join our dynamic team. The ideal candidate will have a strong background in software development and a passion for building innovative applications. In addition, experience developing EHR software for behavioral and mental health services required.\nResponsibilities\nDesign, develop, and maintain scalable web application for our Providers and clients to use.\nCollaborate with cross-functional teams to define, design, test application.\nTroubleshoot and debug applications to optimize performance.\nMaintain application and make updates as needed.\nRequirements\nExperience in developing EHR applications, specifically for use with providers of behavioral supports to IDD consumers and Counseling.\nExperience with Indiana Medicaid EDI and clearinghouse functions.\nPositive Pathways team will provide discovery information with specific requirements of the app.\nAbility to work collaboratively in a team-oriented environment while also being self-motivated.\nExcellent problem-solving skills and attention to detail. If you are passionate about technology and eager to contribute to exciting projects, we encourage you to apply for this opportunity.\nJob Type: Contract\nBase Pay: $35.00 - $45.00 per hour\nExpected hours: 10 – 20 per week\nBenefits:\nFlexible schedule\nWork from home\nWork Location: Remote"
  },
  {
    "title": "Senior Software Engineer",
    "company": "General Motors",
    "location": "Warren, MI",
    "salary": "$125,000 - $260,000 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0BqJjBsvJkVIRVupdyx-l7jJlkPL5nU6SVET5Mq4mDejegpz4R4z9X6QNcQ1GgqKr5Dt_mkLaUZcB41pCkB1PLtK7VrwOgdEJ3ZuFyYF9XUZSGH3Z346Ac37ylKIF1e7zwoWeNAoTbu2-w8gO1-ZkZUTt3O8AQ6_Akxs-wWttKe6O2WgyzLoGz8_LrrmCok4q-irOuwGQ8RFeBPrdtpZYJipHq0skgFB3EtQ1Cf5ek9BmMa-3cd879mBwcDtMABNoQUM5rs6vFMEhQZJuUDwyLUmcZeIjCs0XcS-J-p4WMq8QM99kFhESgPkxj4lRDRPl6PtMsrEipCpXXbbdH6qXpb4stJ0dG3g0mCI0sSL3bRfuBjCTQ5o45Qm0eLy8YPdLfwXHy0GPij1UQ_nh0QDcAW6438HFw7xw5lmFIOdSIvz0VKtvBOPPNLZH2LrC5y2UajxPPjcauFgiwx7E3c6rmKYhan6nHLn5oA0IK2qqy3t-39h7HawlXuZvZ0gzXaGwgGW0BKA8jZ8jyYkSds0iZwKeIej18BojoylkBBmHe61EjPlDMBqHYzQoyqZnEljW9bldcHfs8fI9vOb_il3mSP6yEZoiLJq9r9kGJJvNoVAiFeZl5KMIzmJhUkoD01tniaWn3tFlAzDS8kCbf_cC7k0NF-M_VvWS7S140TPBGJfCCm6OhJym4jYaOWi1gvawPY6K7OLqSQ4ZRThq5ZDX57ZsHXrh0O4WvaxY9l0mSJSclWqHNESrA1yt7YPLPIK1Y=&xkcb=SoBN6_M3sjCkNN0HpJ0PbzkdCdPP&camk=nUmJqO2E8rh8JLMt8M-EVQ==&p=4&fvj=0&vjs=3",
    "description": "Job Description\nWork Arrangement: This role is categorized as hybrid. This means the successful candidate is expected to report to the office three times per week or other frequency dictated by the business.\nThe Role\nDo you imagine a world of zero crashes, zero emissions and zero congestion? We do! To reach this bold goal we need to build a modern vehicle computing platform that is capable of integrating all the advanced features like active safety, driving assistance systems, infotainment, connectivity, and vehicle motion. This new platform for Vehicle connectivity Infrastructure shall seamlessly connect in-vehicle computing controls with cloud and edge computing resources.\nOur team is seeking a passionate and detail-oriented Java/Go Developer to join us in driving innovation within the Vehicle Connectivity Infrastructure space. In this role, you'll be responsible for translating complex use cases into robust software solutions, including software design, development, and verification (such as unit testing and integration testing). You will contribute to building cloud-native applications and feature components that enable next-generation vehicle connectivity. Our team emphasizes modern software development practices, leveraging microservices architecture and model-based system design to deliver scalable and optimized solutions.\nWhat You’ll Do\nDesign and Development of applications in Java, Go, Spring boot, AWS, Azure, Postgre, Cosmos and Dynamo DB, etc.\nExtensive experience in building scalable, high-performance applications with Go and Java.\nBuild software for AWS/Azure cloud and perform integration and verification testing with minimal direction of lead engineers.\nWorks independently; receives minimal guidance. Acts as a resource for colleagues with less experience.\nDesign, develop and deploy microservices on AWS/Azure Kubernaties.\nWrite Java applications using Spring Boot and related Java technologies. Generate various metrics for microservices using Spring Aspect Oriented Programming (AOP) and Spring Boot Actuator\nApply Unified Modeling Language (UML) and facilitate Object Oriented (OO)/J2EE design, following standard methodologies and design patterns for application development\nPerforms design and analysis on changes.\nDiagnose, Debug and resolve issues related to connectivity platform and software.\nDocument requirements for design solutions and link them to test cases that can demonstrate software functionality\nCoordinate and collaborate with colleagues and departments outside engineering, such as IT, Systems & Safety Engineering and in-vehicle development teams\nYou’re Skills & Abilities (Required Qualifications)\nBachelor of Science degree in Computer Science, Software Engineering, Electrical Engineering or related technical degree.\n5+ years of experience with demonstrated technical and professional skills in Java, AWS, Azure, Linux or related software design, development, and testing.\nExperience designing and developing apps, services using one or more protocols.\nExcellent knowledge of Microservices/Event driven Architecture.\nKnowledge in Big Data solutions like Cosmos/Dynamo DB and file storage solutions like Amazon object store.\nWhat Will Give You A Competitive Edge (Preferred Qualifications)\nMaster’s degree in a related technical field.\nExperience in cloud/Edge Hosting of services and Apps. Interoperability of Apps, services between cloud and Data centers.\nExperience with cloud Development using Azure.\nExperience with Development with networking and embedded software\nExperience with GIT/source code management, CI/CD development, open-source SW development/contributor.\nThis job may be eligible for relocation benefits.\nCompensation : The compensation information is a good faith estimate only. It is based on what a successful applicant might be paid in accordance with applicable state laws. The compensation may not be representative for positions located outside of New York, Colorado, California, or Washington.\nThe salary range for this role is $125,000 to $260,000. The actual base salary a successful candidate will be offered within this range will vary based on factors relevant to the position.\nBonus Potential: An incentive pay program offers payouts based on company performance, job level, and individual performance.\nBenefits:\nBenefits: GM offers a variety of health and wellbeing benefit programs. Benefit options include medical, dental, vision, Health Savings Account, Flexible Spending Accounts, retirement savings plan, sickness and accident benefits, life insurance, paid vacation & holidays, tuition assistance programs, employee assistance program, GM vehicle discounts and more.\n&#xa;&#xa;\nAbout GM\nOur vision is a world with Zero Crashes, Zero Emissions and Zero Congestion and we embrace the responsibility to lead the change that will make our world better, safer and more equitable for all.\nWhy Join Us\nWe believe we all must make a choice every day – individually and collectively – to drive meaningful change through our words, our deeds and our culture. Every day, we want every employee to feel they belong to one General Motors team.\nBenefits Overview\nFrom day one, we're looking out for your well-being–at work and at home–so you can focus on realizing your ambitions. Learn how GM supports a rewarding career that rewards you personally by visiting Total Rewards resources .\nNon-Discrimination and Equal Employment Opportunities (U.S.)\nGeneral Motors is committed to being a workplace that is not only free of unlawful discrimination, but one that genuinely fosters inclusion and belonging. We strongly believe that providing an inclusive workplace creates an environment in which our employees can thrive and develop better products for our customers.\nAll employment decisions are made on a non-discriminatory basis without regard to sex, race, color, national origin, citizenship status, religion, age, disability, pregnancy or maternity status, sexual orientation, gender identity, status as a veteran or protected veteran, or any other similarly protected status in accordance with federal, state and local laws.\nWe encourage interested candidates to review the key responsibilities and qualifications for each role and apply for any positions that match their skills and capabilities. Applicants in the recruitment process may be required, where applicable, to successfully complete a role-related assessment(s) and/or a pre-employment screening prior to beginning employment. To learn more, visit How we Hire .\nAccommodations\nGeneral Motors offers opportunities to all job seekers including individuals with disabilities. If you need a reasonable accommodation to assist with your job search or application for employment, email us or call us at 800-865-7580. In your email, please include a description of the specific accommodation you are requesting as well as the job title and requisition number of the position for which you are applying."
  },
  {
    "title": "Senior Software Engineer, Robotics",
    "company": "Berkshire Grey",
    "location": "Bedford, MA 01730",
    "salary": "$112,000 - $180,000 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0BZ-6ifTI44FfgNmgxONT89MOOGS1ao-rWwGZIFnAIb3Uyoh4dkbIcmnyvZ8SddPk9inB9ZGShYwBjYduzxgA3cj6jo4fBTHZk_KTd5Zsp3sZodmjOGXzmOSfsHRDXigXLr9uGBWHQldjpYPSp64sC4YHQuLzVsjUlXJl4eZNQtb28fYgSntxx95CZE19sNd0cgO7LkClwmTHRMEYum64C4cJGgQOHEEiJXMX26Gl8ZC9fLR_tXyfkZi1GGFYrIbkcEL3x0kQzCdG9zx_jX9EfTH1zxVAnyN_-zfQrhnHYkFxSUPvDnqod3cxGReIDNCWmNcBixorjr8a1izFMrLbcbbCsoVK04ls2SAK34bQQ1VrRWS-fnBvA5jqFT9CLz91Yg15QZ0G7hR4RZkkI2gbFGTLwBYm2Bmykk2X9Oi4K2u4QOUdZTnZ9caggYDN36jcnP1BEfJiHwAk6oXlTCniS9KFmKsmKhSZxXpIGxzEtto2y-bGZp3VQqARIpdJ8H7Htt4M2SI2ITiT6hkecyWYSqAb4Jh191gTck4EItjCn_qHoBb4ncXY9a0SAcZpbCSUWvAvWVZAVwOvDRppyLeQJdrf08X4TyEcT4V0bUUbzM0Rccovz8pjub&xkcb=SoCN6_M3sjCkNN0HpJ0CbzkdCdPP&camk=nUmJqO2E8rhugpEtlYO2mA==&p=9&fvj=0&vjs=3",
    "description": "About the Job:\nBerkshire Grey is a leader in the field of AI and robotics, providing innovative solutions for e-commerce, retail replenishment, and logistics. Our technology automates complex pick, pack, and sort operations.\nIn the role of Senior Software Engineer, Robotics, focusing on manipulation, you will play a pivotal role in enhancing the capabilities of our robotic solutions. Your work will involve developing advanced software that enables robots to interact with their environments in completing complex, real-world tasks.\n\nResponsibilities:\nDesign, develop, and support advanced robotic manipulation software deployed in production environments.\nCreate high-performance software solutions for robotic manipulation, focusing on motion planning, kinematics, control strategies and motion execution, to enhance the robotic solutions.\nUtilize and extend simulation software environments to test and refine manipulation development, ensuring expected and robust performance.\nWork closely with hardware engineers, product managers, and other software teams to integrate capabilities into our broader robotic systems.\nProvide technical leadership and mentorship to junior engineers.\nCommunicate technical priorities and status.\n\nMinimum Qualifications:\nBachelor’s degree in Robotics, Computer Science, or a closely related field.\n4+ years professional software development experience in a production environment.\nStrong development expertise in Python.\nUnderstanding of parallel/distributed systems and asynchronous/concurrent programming.\nExperience with development and integration of drivers for robotic hardware, particularly robotic arms.\nExperience in developing APIs and SDKs for robotic systems.\nExperience in developing RESTful interfaces, gRPC services/clients, etc.\nFamiliarity with system design and design patterns.\nExperience with Git, code reviews, and automated testing (unit, integration, and hardware-in-the-loop).\nAbility to work collaboratively in a team setting and communicate effectively with both technical and non-technical stakeholders.\n\n\nPreferred Qualifications:\nMaster’s degree in Robotics, Computer Science or a closely related field.\n6+ years of experience in software development in a production environment.\nExperience with ROS/ROS2.\nExperience in designing and implementing software and algorithms for motion planning, motion execution, multi-arm coordination, robotic kinematics, and/or environment representation.\nFamiliarity with robotics simulation tools and test environments.\nFamiliarity with the Linux ecosystem.\nFamiliarity with Python’s asyncio library.\nProgramming experience in C++.\nExperience with NoSQL databases (e.g., MongoDB).\nExperience with Fanuc robots is a big plus!\n\n\nWhy Berkshire Grey?\nOpportunity to work with cutting-edge AI-powered robotic solutions that are transforming the supply chain and logistics industry.\nA culture of innovation and collaboration, with a commitment to professional development and growth.\nCompetitive compensation and comprehensive benefits package.\n\n6110-2506DS"
  },
  {
    "title": "Java Software Developer - Space Domain",
    "company": "Peraton",
    "location": "King of Prussia, PA 19406",
    "salary": "$112,000 - $179,000 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0BWrJOJIc9CpN6yMpv0V0AydpTkzwx7H4nhH8WAx3qz9LO0mISChZgts3QCvI8K0IvAtyz_8p567NwGDS2PF-bpRlFh0PTYaeE0qjTUMFCgCGH_vzvhcnjYdhc4vYUADdQetlARmi5fZGAxa_B70wmTZeH7aWuyXr3DkRgfa8VrgPiLbfS5dfY-f4ykxUYRqfOTRd9fHX5KLlx9_aVKf9eMi41TOzNDSEbxGJrICS1hKOzsMDX4zxMiKVJEUHJjwfEBJMnNQnhWEnMV0IRQGPsjP3lyQxczjmSAApAe_qUF49VYniNPkhvCAKXsjyF8JNLsCE9E4_5JroBxhHtUGou69s59QTWD2A0N5rRuDNMqgzePr4nbCc9_OKisNbtE--5Z6XbLWMbFLzGFCqq4jiuMX01nzR9s9ugKC4c9DZBCLNhgUcvf_XCo5NNSLmE-vZ2P4U9hlUL2b_CbhskUAjWkkEp3yS1yA5YYdiw_-rhHyC2gzScCMbq97IozaCsbR28wh1z59XHxKAb6Em2Z8c4KJhItjAH1EkeMivZErvNFqfKcbzDjAyHBUwZ0-jM1136svULAcHsnH_YP8BuJrxg67cW9oXxYFJmAxJTzQxsRIR_AL56MqA-He5tYjfVzq1U9rEu7Q27Vl5t9cAaReO67d8PtNYFtkQjvVyqOj_Xuv1VyuuaYjnGNrbBEa6qMetZCcZwM3zaXwy3tScphY9NQWjuIJUH7xznEc--tVizwdbfKSIJTqJPDkwfkUufAvtqqYULwGE_7DBAGtcX0CyHFwaxt4Z0oMbxsDGZZdmCBS2hM-WsTGUMpVExzwahVGtQGmZYq8iCRduxQLp4Z1B6b35W2X3WKu8xsKHf8vPLM2A==&xkcb=SoAq6_M3sjCkNN0HpJ0HbzkdCdPP&camk=nUmJqO2E8riLxIhWV1rwzg==&p=12&fvj=0&vjs=3",
    "description": "About Peraton\nPeraton is a next-generation national security company that drives missions of consequence spanning the globe and extending to the farthest reaches of the galaxy. As the world's leading mission capability integrator and transformative enterprise IT provider, we deliver trusted, highly differentiated solutions and technologies to protect our nation and allies. Peraton operates at the critical nexus between traditional and nontraditional threats across all domains: land, sea, space, air, and cyberspace. The company serves as a valued partner to essential government agencies and supports every branch of the U.S. armed forces. Each day, our employees do the can't be done by solving the most daunting challenges facing our customers. Visit peraton.com to learn how we're keeping people around the world safe and secure.\n\nProgram Overview\nThe program is a next generation Space Domain Awareness (SDA) Indications and Warning (I&W) system. It establishes a repository of resident space objects (RSOs), finds RSOs of interest, and provides data to ground operators.\n\nAbout The Role\n\nPeraton is seeking a Software Developer in King of Prussia, PA to support Intelligence Community and DoD customers as part of a talented, high-performing team. As part of this team you will work with emerging service and distributed computing technologies for satellite situational awareness (SSA) data processing and distribution.\n\nThe EMMETT program, a next gen Space Domain Awareness (SDA) Indications and Warning (I&W) system, establishes a repository of resident space objects (RSOs), finds RSOs of interest, and provides data to ground operators. The EMMETT team uses: programmatics, sensor modeling, and system engineering expertise to deliver this world-class SDA I&W system.\n\nWhat you'll do:\n\nProvide TS/SCI Java software development of modules. Some of these techniques include but are not limited to event-driven or state-driven programming, error logging, and exception handling.\nPerform TS/SCI software analysis, architecture, engineering, and integration services at the unit, module, and system levels.\nPerform all aspects of software engineering support required to implement systems.\nAdhere to open standards and modern software development methodologies, including what is considered 'best' practices by Industry to the extent that operational requirements will allow.\nProvide technical reports, white papers and other documentation as required to documents findings of all software engineering service activities.\n\nQualifications\n\nRequired Qualifications:\n\nA Bachelor's degree with 5+ years of relevant experience; OR masters degree with 4+ years of relevant experience. Additional four (4) years of experience may be considered in lieu of a bachelors degree.\nThis position requires the candidate possess a minimum of Top Secret clearance with ability to upgrade to TS/SCI and pass a polygraph within 30 days of employment or at customers request- contract requires TS/SCI with poly. The candidate must maintain the clearance.\n2+ years of experience with Java\n1+ years of experience in working with microservices and containerization technologies, including Docker and Kubernetes\nExperience with backend frameworks, such as Spring Framework or Spring Boot\nExperience with API development, including REST architectural style\nAbility to obtain a DoD 8570 certification, including Security+ or CISSP, within 6 months of start date\n\nDesired Qualifications:\n\nExperience with network security, including access and authorization for PKI and chain trusting\nExperience with writing unit tests and E2E testing\nKnowledge of Apache NiFi and Kafka\nKnowledge of JIRA, Confluence, Git, and GitLab\nAbility to investigate root causes and provide corrective actions\nTS/SCI clearance with a polygraph\nDoD 8570 certification, including Security+ or CISSP\n\nBenefits:\n\nPeraton offers enhanced benefits to employees working on this critical National Security program, which include heavily subsidized employee benefits coverage for you and your dependents, 25 days of PTO accrued annually up to a generous PTO cap and eligible to participate in an attractive bonus plan\n\nSCA / Union / Intern Rate or Range\n\nDetails\n\nTarget Salary Range: $112,000 - $179,000. This represents the typical salary range for this position. Salary is determined by various factors, including but not limited to, the scope and responsibilities of the position, the individual's experience, education, knowledge, skills, and competencies, as well as geographic location and business and contract considerations. Depending on the position, employees may be eligible for overtime, shift differential, and a discretionary bonus in addition to base pay.\n\nEEO: Equal opportunity employer, including disability and protected veterans, or other characteristics protected by law."
  },
  {
    "title": "Principal Software Engineer, Perception",
    "company": "Berkshire Grey",
    "location": "Bedford, MA 01730",
    "salary": "$136,000 - $221,000 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0BZ-6ifTI44FfgNmgxONT89MOOGS1ao-rWwGZIFnAIb3Uyoh4dkbIcmnyvZ8SddPk96o7itcr6iUOdQUGxvlIdhwUIp7QRPQASB1BnBHMpfhjMRPFRNMBvnTDVeNx0QQDIeZUh58CCwoknr_SaQ57IeahYVS14v8FuU93UdZQ88C0qyHS003hEl-YpIjJyyyXwIkPW1LIFPxEfQWNAPVC_UbN9AlY0Xh8vnMiInWNlmYWgfkrtdlKmnFrm0hSijDwJ-j6Y2NchyIm5dlfKM5EH7bGaIKS0ZJZ3BhNJb0Fl4qrxTBdO6I4Wrj3lM_qGbpLUz-4xs7DwezVYMFBoL9B-EAuD_BoASic2bIKVmSqVzzLKvpCqbS1bK7RxcrRddBj7q2DnAGxfdkRO1M87xnHF76gvl_b1kZ6BwvG74vV8zMzndXEencx0ZPbwzzJGi09Rcd5Xmo5iyuzzRcD1OoSZ5kqKf_53oPK26P79YYyedvJwKxk5cupgqT1Xw3r9utkEzXDma0cg1pF3JceFh0M2qPGfOYPBydShcbccJvHzphSC3k6VqAdBNfe65AhXqavFgqTG_sIKcq4_YJPa_gW5RMxkZcMa3rAbX74cjmHtbzISKRUvhm2JS&xkcb=SoDq6_M3sjCkNN0HpJ0KbzkdCdPP&camk=nUmJqO2E8rhugpEtlYO2mA==&p=1&fvj=0&vjs=3",
    "description": "About The Job\nBerkshire Grey is a leader in the field of AI and robotics, providing innovative solutions for e-commerce, retail replenishment, and logistics. Our technology automates complex pick, pack, and sort operations.\nIn the role of Principal Software Engineer, Perception, you will develop, optimize, and own perception software deployed on real-world robots, allowing them to understand and interact with their environment in unprecedented ways. Your work will directly contribute to enhancing the capabilities of our robotic solutions. This position offers a unique opportunity to deploy the latest perception technologies, pushing the boundaries of robotic perception applied to real-world challenges.\n\nResponsibilities:\nDevelop and apply advanced perception algorithms for robotic applications.\nProvide technical leadership and mentorship to a small team of software engineers.\nDesign and architect robust software solutions for real-world robotic systems deployed around the world.\nEvaluate and integrate perception libraries and machine learning models into our solutions.\nCollaborate with cross-functional teams to ensure seamless integration of perception software with other software, hardware and controls teams.\nCommunicate technical priorities and status.\nStay abreast of the latest advancements in perception and robotics, evaluating applicability to our challenges.\n\n\nMinimum Qualifications:\nMaster’s degree in Computer Vision, Machine Learning, Robotics, Computer Science or a closely related field.\n8+ years of experience in software development with a focus on computer vision and/or robotics.\nProficiency in Python and C++.\nA strong knowledge of computer science algorithms and data structures.\nKnowledge of 3D point cloud processing algorithms and libraries (PCL, Open3D).\nKnowledge of 2D image processing algorithms and libraries (OpenCV).\nKnowledge of machine vision sensors (RGB and grayscale 2D cameras, 3D sensors).\nDemonstrated ability to:\nApply perception algorithms to real-world problems.\nProvide technical leadership on key projects.\nManage execution of technical efforts across a small team.\nMentor junior engineers.\nOperate autonomously.\nDevelop on and debug real robotic systems.\nDetermine and communicate justification of technical priorities.\nKnowledge of software design principles and patterns.\nExperience with team software development (agile project management, task planning, and tracking).\nExperience with refactoring and maintenance of the existing codebase.\n\nPreferred Qualifications:\nPhD in Computer Vision, Machine Learning, Robotics, Computer Science or a closely related field.\nPractical experience with the application of machine learning for computer vision.\nWork experience in the material handling industry.\nExperience with unit test frameworks for C++ and Python.\nExperience with designing multithreaded and asynchronous applications.\nExperience with ROS1 or ROS2.\n\n\n\n6110-2414YW"
  },
  {
    "title": "Principal Software Engineer",
    "company": "Liberty Mutual",
    "location": "Boston, MA",
    "salary": "$117,000 - $221,000 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0DepOg7TDxGKZPUDK5aMJwXQn2YTYIL3PVVUU2ENsp1lfsN6FS_mRfuY4z9zWDT3bdtsqXgEAh5YJyTBgqC3fFwxeTCVfH01JjTPI2ksHy_iCB_E4w0IBRCOHFc0tyHETyrb6xH_yueXhOHxa7M2o24bjyjiAbwpWrcPvJbGz_3EllLAgIg-HgWD74p43pzOC0Z42Cpp2J9KS1OLjhhl9Ao_yWN3jvNXm03JdxTY-MYV0PH_9-I5goFQ0riIGyZAV0jCjPxz8sHSAXW5aechubMdLtt4nzQxmBE95o-kwO9TyUcG-2iq5MmU7fJ440FPt4_8mLG_6dauRD2qgsRl0rrKjk1t7r1dPRPwjkIBHj1SmaMv5vYbeHHTKff0YermUTaUD3fVhc-ug1-DG1FFiggUj8GYlgVttxIYVRBzICzUg6oGeR-klCZL-1X5v9-TdW36nuln1obaThguPqDwFE4Z1hKlals6dxeWJ1Z9wHaT2i0RXVxJWcd__o2x9K009Uc91PerHVTqB5SQ72g2XfVPzTq8sSh6tEKlz2m80MeLW8qotwCkPGZTqFOJ6A3hlf8Gf0jQfNeMWzBDdP4VFrn4ZtEKbFE2tfkCBze9cK7K6vHJcMaAISk7j7RsNgXUzeyf23iNxl6n8jeTuyFQPVuuNxi40odP1FwrdFzRDJRUZM9UssPWudAk3EUsUM5PIcqTyjgo8Kj5KKd8wWsR7IjKo3aEg4ozJPIopZtzFZYw7Gqryu8sAf3qtEb8M_wgMI-ko-PdJCLN1xMAzA6xhGfbW9aWTqal5xwTimahvrPJWdDl8FBctDIXWQXx6bkSHGUXrPJp4i-GWO8EZv7vty593snK_fkydfDKpSs2DB8io-eCmz7d_mdC2w_3UOic0bPfz2dJgZ1qP84p0ZCvucLLG4Xpuc49J3AWCRhCPSNsEDv3j74GCV8ZgTUeSzKTMuIKEnI4Ku2hv7tMzC-xG77&xkcb=SoA56_M3sjCkNN0HpJ0DbzkdCdPP&camk=H-lBaXMUocKYX73x8uBU6w==&p=8&fvj=0&vjs=3",
    "description": "Description\nDo you have the skills—and drive—to join a tech team that’s working to digitally transform a trillion-dollar industry? From test-driving the latest technologies to creating intuitive consumer apps, Liberty Mutual is constantly innovating and creating industry-leading solutions that provide peace of mind for our customers worldwide. As a principal software engineer at Liberty Mutual in Claims Policy Retrieval, you’ll consult on highly complex projects and solve technical problems, while working in an agile environment that has the creative energy of a start-up—and the full backing and comprehensive benefits of a Fortune 100 company.\nWe encourage you to apply and bring your expertise if you’re a:\nTechnical problem solver: Going far beyond simply developing error-free source code, test scripts, components and system architectures, you’ll document and build deployment guides aimed at maintaining robust, relevant software\nCustomer-centric engineer: Putting clients’ needs first, you’ll translate customer requirements into technical applications and support the implementation of new software\nMotivated mentor: Exercise your technical chops while coaching and collaborating with junior software engineers.\nForward thinker: Merely fixing a problem isn’t enough – using your proactive mindset and initiative, you’ll also identify opportunities to enhance performance, quality and efficiency\nQualifications\nExperience\nEight or more years of software engineering experience\nStrong background in Claims or Product business operations and strategies, including global technology and financial services trends\nHands-on involvement with layered systems architecture, designs and shared software concepts\nFamiliarity with functional and system integration testing\nExperience working in an agile environment\nSkills\nExcellent negotiation, facilitation and consensus-building capabilities\nOpenness and adaptability to respond to fast-moving circumstances\nProficiency in multiple object-oriented programming languages and tools\nExperience developing or architecting cloud-hosted, responsive web applications using Java, Spring Boot, AWS, and CSSS3\nStrong background in code review\nExcellent oral and written communication skills\nAptitude for working in teams\nKnowledge\nIn-depth knowledge of diverse and emerging technologies, architectural concepts and principles\nA deep understanding of layered solutions and designs\nAwareness of policies regarding security and privacy\nUnderstanding of backlog tracking, burndown metrics and incremental delivery\nGuidewire experience is a plus\nEducation\nA bachelor’s or master’s degree in technical or business discipline, or equivalent experience\n\nAbout Us\nPay Philosophy: The typical starting salary range for this role is determined by a number of factors including skills, experience, education, certifications and location. The full salary range for this role reflects the competitive labor market value for all employees in these positions across the national market and provides an opportunity to progress as employees grow and develop within the role. Some roles at Liberty Mutual have a corresponding compensation plan which may include commission and/or bonus earnings at rates that vary based on multiple factors set forth in the compensation plan for the role.\n\nAs a purpose-driven organization, Liberty Mutual is committed to fostering an environment where employees from all backgrounds can build long and meaningful careers. Through strong relationships, comprehensive benefits and continuous learning opportunities, we seek to create an environment where employees can succeed, both professionally and personally.\n\nAt Liberty Mutual, we believe progress happens when people feel secure. By providing protection for the unexpected and delivering it with care, we help people embrace today and confidently pursue tomorrow.\n\nWe are dedicated to fostering an inclusive environment where employees from all backgrounds can build long and meaningful careers. By actively seeking employee feedback and amplifying the voices of our seven Employee Resource Groups (ERGs), which are open to all, we create an environment where every individual can make a meaningful impact so we continue to meet the evolving needs of our customers.\n\nWe value your hard work, integrity and commitment to make things better, and we put people first by offering you benefits that support your life and well-being. To learn more about our benefit offerings please visit: https://LMI.co/Benefits\n\nLiberty Mutual is an equal opportunity employer. We will not tolerate discrimination on the basis of race, color, national origin, sex, sexual orientation, gender identity, religion, age, disability, veteran's status, pregnancy, genetic information or on any basis prohibited by federal, state or local law.\n\nFair Chance Notices\nCalifornia\nLos Angeles Incorporated\nLos Angeles Unincorporated\nPhiladelphia\nSan Francisco"
  },
  {
    "title": "Principal Full Stack Engineer",
    "company": "Fidelity TalentSource",
    "location": "Smithfield, RI",
    "salary": "$70.00 - $115.70 an hour",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0AoYXfdOe7El6-Ykny_IbMrQLc_ftZ75MJybi-dJXWXjrzaN1ZZWx4HFoSx_x6obTFaTJBeqrRXgMvAGA-mCA-G2sQYIKNB2yZVA2BDaO02U2OA0CsbuA9H47K2gIxqI417XB2zyxZCgXMCgS_dQYs46JbFzOeSgC4mQmHE286NDtqK8bBvQ3fz9heiZKXqZYLVQZmzXM52eH6C7eTD9ik2SfRHW9JrAnd_OMzP_B9BydsCdvv0dNluXXolYJBNKwu2dseeIlT71h_ChO6t4pp8tme48lrhZRrNLiTmua7WK_9VziWC324mAXPjA_XS2Q6fk6e7sgruugtsLDQQ6kgM-yZbhpBrSMP61CLYdUgJhnyI3Qq1aKeG5mLzE4GDHj52rG5lIRHdRbMIS3e7c8WIyeu0rhVb7hNiFoo-mFcCIpniEz_a4-yEonRGtja7_YKivg5buIF3Q2w8TeNuKkq_cWV-UZFDnISQO1korUzOmrOiHeThjCehzyDFA1aXfxGhHZbgG5nNmaJ_e6GMlWZIE9k2MWeuhpiNCtp4KfoZzOslrIyh0YDXZMEetCQcOy0S5Kwovn8_bfEUeqwN7i0Q7CqazXxVnxuUHFZH-Gngo_jtMFI6YGpHhsi-jjwtyLvbGZfMIVD5JZsznPbvfKvwXcKNWkxY2XObm3lXx3HKRxs-EVuBKvkkKd9sfR8PjEeej99s0VDahSJGJLh66JdNA9ODEL5eZTE=&xkcb=SoAQ6_M3sjCkNN0HpJ0BbzkdCdPP&camk=UoKtGZLa3XJS7kbX3L3NnQ==&p=10&fvj=0&vjs=3",
    "description": "Fidelity TalentSource is your destination for discovering your next temporary role at Fidelity Investments. We are currently sourcing for a Principal Full Stack Engineer in Smithfield, RI or Merrimack, NH!\nPrincipal Full Stack Engineer\nThe Role\nThe Fidelity Institutional Wealth Management Services group is looking for top, full stack engineer talent with a passion for crafting and delivering software solutions to be part of its diverse, globally distributed team of IT professionals responsible for the development and maintenance of IWMS client platforms and offerings.\nIn this role you will use your knowledge of software development, platform integration, and cloud computing to modernize a diverse suite of applications that support our intermediary (clearing and custody) business! You will be a member of our team collaborating with product management, architecture, engineering, and technology partners to innovate, design, and deliver highly scalable applications and platforms using Agile methodologies.\nThe Team\nThe IWMS Platform & Technology domain is within the Fund and Brokerage Operations & Technology division. IWMS exists to enable our business partners to win their respective marketplaces by crafting, building, and maintaining the technology platforms and products of Fidelity’s Institutional business units. The Account Authorization and Search squad is part of the Operations Experience and Platform Foundations product area supporting modernization of legacy capabilities.\nThe Expertise and Skills You Bring\nBachelor's or master’s degree in Computer Science, Software Engineering or related field\nSuperior communication skills and experience mentoring junior developers\n9+ years of relevant full stack development experience developing, and maintaining multi-tier applications\nStrong expertise with the following desired skills: Java/JEE, Spring/Springboot, RESTful Services, Cloud (AWS), SQL, NoSQL, Python, Test and Deployment technologies, Kubernetes\nExperience with API design & development, AWS (Cloud) Migration, Data Design, Batch Processing, Workflow/Process Automation and UI\nCloud skills working with AWS EKS/ECS and AWS handled solutions such as Lambda, SQS, EC2, S3, CloudWatch and IAM roles/polices\nTerraform experience preferred, CloudFormation Templates\nExperience using logging/observability tools such as Datadog, Splunk and ELK Stack\nSolid CI/CD skills including full scale security and quality testing, build and deployment automation\nProficiency with front-end frameworks, libraries, and related technologies a plus\nGood analytical, communication and preparation skills and the ability to run with multiple tasks at a given time\nProficient with Agile methodologies\nThe Value You Deliver\nDeliver high quality, timely, efficient and maintainable software solutions in an agile environment to meet functional and non-functional business requirements\nActively contribute to and improve engineering practices such as code and design reviews, source control strategy, environment strategy, testing automation and CI/CD pipelines\nWork with product owners, peer technologists and architects as required to deliver technical improvements to the platform\nDevelop an understanding of the business domain and actively participate in technology discussions with partners\nInvestigate creative practices and share them with your teams\nPlease see the below pay rate range for the work location of Rhode Island only: $70.00-$115.70 per hour.\nPlacement in the range will vary based on job responsibilities and scope, geographic location, candidate’s relevant experience, and other factors."
  },
  {
    "title": "Software Developer-Test Engineering",
    "company": "General Motors",
    "location": "Warren, MI",
    "salary": "$101,000 - $154,800 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0BqJjBsvJkVIRVupdyx-l7jJlkPL5nU6SVET5Mq4mDejegpz4R4z9X6QNcQ1GgqKr7wFvoBmmrgRXCPYG6N9z926XX9TxT3JaWouvY4pvCD3i8_0398_k6GGduqgAmnxsumOAMFozAlxVwyLwyRES-ccJqofdTxTi597g2ZgZ9_LG0yFRJrk246_yGepJt1i3M3kma_Jsx_0Zen-UjNxuCynxkm3VHNTVLh4uToX2MT112NK2jlBlJOHjntan2u3dUD2r1L-0JyTgp4pl_KgbMoaHWG-Kt4ZoTZZy0OH46aiGQIrjbaWbF7IHudGe2Qax5Ca13_2CfaJvEsq9uy79Mr2jssUQMqqLOodiXimn43WPzLjoMd1UesR5LBWC0_3BAIE3LuUDJnTsHxKbR0165RkPf8NtdOqQIT61MHrDGGRihU-RGaMa7mZFm3fPubA44GCYDDM3B19quAwjceaPAwqZB-O_kctJRiHHM-8SKAL7q_3iM9p1KETEc24YLYxVyf8qb7W07J4FTPR0Vwmsymh39bPR6q7bIXTKdsLnlwANph4OdI1ynV_wowHBITivfzujbifKcKl1NmekT7Xgtxf4rJoXiecVYs7Fj8AqMK2N2x1dSyP1SNSAgZkmuz2swpwYgw-UO37ssQicKJSUcJIAxXNk4JZ5Zguwtg7e2_-dcJ-HE4VehP48x08GKBeEcLsJJnU3zRcc33Q5rLyhVmv1wxo2J_ntL_JbMtbrxKZOQczjv3x4KhLIfoUn8ammH5yXRgAD-nIN7WGGJWCfRu&xkcb=SoDQ6_M3sjCkNN0HpJ0MbzkdCdPP&camk=nUmJqO2E8rh8JLMt8M-EVQ==&p=7&fvj=0&vjs=3",
    "description": "Job Description\nJob Description Summary:\nSoftware Engineer (Test) ensures applications meet GM software and feature standards for functional, system, quality, security, performance and architecture requirements. Ability to drive advanced levels of test planning, execution and quality reporting of software applications through engagement with component developers, external system stakeholders, and sustaining/integration groups. This includes the creation and implementation of both automated and manual test cases and test execution plans\nLEVEL EXPECTATIONS:\nFully qualified individual contributor who has knowledge and understanding of all aspects of a function and exercises independent discretion and judgment on significant matters based on professional knowledge. Level most professionals can expect to achieve in their career.\nEXPERTISE\nRecognized as a fully qualified, experienced professional. Has complete knowledge and full understanding of own area and broad knowledge of related areas.\nTakes broad challenges and, through independent professionally developed analysis, identifies and analyses options, and breaks them down into initiatives capable of implementation. Identifies opportunities and proposes solutions to improve internal processes, services, and structures to support functional strategies.\nUses advanced analytical and problem-solving techniques to resolve a wide range of non-standard problems\nWorks independently; receives minimal guidance. Acts as a resource for colleagues with less experience.\nCOMPLEXITY\nIdentifies and devises solutions based on limited information and precedent. Uses evaluation and judgement to solve problems that are new to the organization and require a deep level of experience and strategic thought to create a solution.\nEnhances relationships and networks with senior internal/external partners who are not familiar with subject matter and often require persuasion. Uses data and analysis to demonstrate the value of a project, anticipating, and addressing objections and or concerns.\nOften effects change in broader functional area without direct exercise of command, using persuasion in situations where reaching agreement may be hindered by differing opinions, past practices, or experiences.\nSCOPE AND IMPACT\nChallenges and problems are of a diverse scope with multiple moving parts, where developing a plan and viewing the whole picture is a significant challenge itself. Work is done independently and is reviewed at critical points.\nOwns the development and delivery of solutions, driving cross team and group efforts. Leads by example, taking responsibility for their own actions, acknowledging mistakes, and holding themselves accountable for achieving goals. Addresses and evaluates a diverse range of issues using innovative methods and proposing alternative approaches.\nServes as a mentor to more junior level employees, providing coaching and guidance on difficult issues.\nHas significant operational impact across their function.\nThe Software Test Engineer will perform reviews of business and software requirements, design verification plans, execute tests, log defects, and report test metrics and test status to the project teams. This role requires a deep experience in software test strategy and automation, creation of test process deliverables, test metric definition, and clear/concise result reporting.\nWorks closely with architects, system engineers, developers, and project/program managers to collaboratively provide successful and on-time delivery of projects with the highest possible quality.\nAssists in maintaining optimal resource utilization across a functional area; calls out constraints and bandwidth limitations when appropriate.\nInteracts with managers, technical leads, and peers to share information and clarify instructions, lead projects, build/automate/execute test plans, and assist in test strategy and process improvements,\nAnalyzes and reviews business and system requirements. Derives and produces accurate test estimates.\nAbility to manage work across multiple projects and ability to lead all testing activities on a feature/project.\nComfortable creating test cases that can be executed manually when necessary, but designed and optimized to be automated; ability to write accompanying automation scripts using industry-standard tools and coding methodology should be ingrained\nExecutes manual and automated tests, troubleshoots script and test environment issues, triages and logs defects, and tracks progress to plan.\nLogs, tracks, and verifies resolution of requirements and software defects.\nReviews test plans written by others and provides insightful feedback/assistance.\nEvaluates and produces test and project metrics, and can speak knowledgeably to quality concerns and test blockers\nCreates test-execution plans, categorizes and manages test suites, and proposes innovations in the testing process via tools, techniques, and process tweaks.\nOver time, can act as an SME of the component, system, and business process domain.\nHolds themselves and others accountable for demonstrating GM values and cultural behaviors. Models GM behaviors and helps to build a winning culture.\nPerforms other related duties as assigned.\nRequired Skills and Experience\n4+ years of embedded software test experience; background in mobile or automotive industries is a plus\n2+ years of experience in testing Android code\nExcellent programming skills in common languages such as C/C++, Python, or Java\nStrong experience with test automation (Robot Framework is a plus), tool development, and scripting\nSolid knowledge of software quality assurance methodologies and tools\nOutstanding verbal and written communication skills\nSelf-motivated, curious, able to deliver on time, a quick-learner, and able to work in a fast-paced & flexible work environment\nKnowledge of, and experience with, Scrum/Agile software development process\nStrong problem-solving and analytical skills, coordination skills, and interpersonal skills\nExperience with vehicle communication network protocols (CAN, LIN, etc.) is a plus\nHands-on experience with CI/CD tools such as Jenkins, GitHub, and Artifactory\nCompensation: The compensation information is a good faith estimate only. It is based on what a successful applicant might be paid in accordance with applicable state laws. The compensation may not be representative for positions located outside of New York, Colorado, California, or Washington\nCompensation: The expected base compensation for this role is : $101,000 - $154,800 Actual base compensation within the identified range will vary based on factors relevant to the position.\nBonus Potential: An incentive pay program offers payouts based on company performance, job level, and individual performance.\nBenefits: GM offers a variety of health and wellbeing benefit programs. Benefit options include medical, dental, vision, Health Savings Account, Flexible Spending Accounts, retirement savings plan, sickness and accident benefits, life insurance, paid vacation & holidays.\n#LI-EL1\n&#xa;&#xa;&#xa;&#xa;This role is categorized as hybrid. This means the selected candidate is expected to report to a specific location at least 3 times a week {or other frequency dictated by their manager}.&#xa;&#xa;This job may be eligible for relocation benefits.&#xa;&#xa;\nAbout GM\nOur vision is a world with Zero Crashes, Zero Emissions and Zero Congestion and we embrace the responsibility to lead the change that will make our world better, safer and more equitable for all.\nWhy Join Us\nWe believe we all must make a choice every day – individually and collectively – to drive meaningful change through our words, our deeds and our culture. Every day, we want every employee to feel they belong to one General Motors team.\nBenefits Overview\nFrom day one, we're looking out for your well-being–at work and at home–so you can focus on realizing your ambitions. Learn how GM supports a rewarding career that rewards you personally by visiting Total Rewards resources .\nNon-Discrimination and Equal Employment Opportunities (U.S.)\nGeneral Motors is committed to being a workplace that is not only free of unlawful discrimination, but one that genuinely fosters inclusion and belonging. We strongly believe that providing an inclusive workplace creates an environment in which our employees can thrive and develop better products for our customers.\nAll employment decisions are made on a non-discriminatory basis without regard to sex, race, color, national origin, citizenship status, religion, age, disability, pregnancy or maternity status, sexual orientation, gender identity, status as a veteran or protected veteran, or any other similarly protected status in accordance with federal, state and local laws.\nWe encourage interested candidates to review the key responsibilities and qualifications for each role and apply for any positions that match their skills and capabilities. Applicants in the recruitment process may be required, where applicable, to successfully complete a role-related assessment(s) and/or a pre-employment screening prior to beginning employment. To learn more, visit How we Hire .\nAccommodations\nGeneral Motors offers opportunities to all job seekers including individuals with disabilities. If you need a reasonable accommodation to assist with your job search or application for employment, email us or call us at 800-865-7580. In your email, please include a description of the specific accommodation you are requesting as well as the job title and requisition number of the position for which you are applying."
  },
  {
    "title": "Web-based User Interface Software Engineer",
    "company": "Johns Hopkins Applied Physics Laboratory (APL)",
    "location": "Laurel, MD 20723",
    "salary": "$100,000 - $227,500 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0DND_cY4AdZ9uf0CyzxvdaEIkE64BMiSLR1NLUGRAKCdb0EIWzKl7iUQ7clxobffV96rihQjfglEfHwXu9bNNn9wdYhl3Ek300CcVKvuyuxfIEqZrvT1Nn3PY3fanyjJ4qHONJrhsi7LUzn_oKWWbA8GVhfxZMMvcAqNHJ3_LLEy8ZRC8g73zK5fkApi3c_GXb15Y526w67cd7eTGOHNc8IDZdoUNTLKGNzYDbUipMjd4iRo9dvGDH0g448HuTCUvU61cNdb24z5GqQkcRgCoZQcaFQ3UhKq8ZyP3pa51Lk4yqpdi4Ky4rcruVCCn-_pZsaguDD-lzxyqXPWhKwGpu67ky9-D5y1O1Zyw5sq2bwqQDAcePX4YZSXP1BFqVT7VGXtze9a2hcLGYgZ54SXfFl1tFO11EtT8ds0ea1B7jmgT7LrTD308cmzA4EJlk40sD29JHzUchQ0_PJAnRXhTtuIrgcH1jEHf8AhzEnhofuIe4SL9haiTRR9CPcditBkW6decFwyhaTMuCPJweclYzMqz2w5wIaFRdjN345AiM-sgmZaQaSj6BlsdYP-pSDiw5SBd6ymKkx-4SLHpHe0EczYOrtZuyjrL7LatGwmkCc-11TJn0Wjf3ajN_kGZfVYvHPyA2qqe7YigUmcOUKsTyfBVsrJQt7SbU=&xkcb=SoDD6_M3sjCkNN0HpJ0IbzkdCdPP&camk=H-lBaXMUocJHgoO6EZRaIg==&p=3&fvj=0&vjs=3",
    "description": "Description\n\nDo you thrive in a dynamic environment, collaborating with a group of passionate technical experts within a culture that fosters innovation and teamwork?\n\nAre you looking for an opportunity that will continue to challenge and develop your technical abilities throughout your career?\n\nWe're looking for someone like you to join our team at APL.\n\nWe are seeking a Web-based User Interface Software Engineer for the Multi-Mission Planning Development Group in the Air and Missile Defense Sector (AMDS). We apply expertise and use sophisticated tools to lead the design, prototyping, development, analysis, evaluation, and transition of advanced mission planning systems for multiple sponsors to support multiple warfighter missions and multi-echelon planning needs in support of revolutionizing the art of defense.\n\nOur software engineers collaborate within and across teams to encourage and support innovation. You will contribute to the development of one or more large codebases that are evolving to leverage modern software techniques to support a wide variety of challenges. This is a unique opportunity to dive deep into both software engineering and mission planning while using your skills to design, develop, and test User Interfaces for military planning tools associated with air and missile defense (AMD).\n\nAs a Web-based User Interface Software Engineer, you will...\nCarry out Web-based User Interface development for military planning tools, prototypes, and analysis systems\nCoordinate with backend developers from other project teams to integrate system capabilities\nMaintain codebase quality by taking part in code reviews and by writing software tests and documentation\nInteract with Human System Engineers, as required, during feature design, implementation, and review\nNote: This job summary and listing of duties is for the purpose of describing the position and its essential functions at time of hire and may change over time. A coding sample will be requested of all applicants.\n\n\nQualifications\n\nYou meet our minimum qualifications for the job if you...\nPossess a BS degree in Computer Science, Software Engineering, Computer Engineering or equivalent or equivalent years of experience\nHave 3 years of experience in Web-based User Interface development using Typescript and React\nUse modern software development tools and practices including Git, Jira, and Agile Scrum\nHave experience with the DevSecOps software development cycle\nHave demonstrated success working with large code bases in a team environment\nHave excellent critical thinking, written, and verbal communication skills\nAre able to obtain an Interim Secret level security clearance by your start date and can ultimately obtain a Secret level clearance. If selected, you will be subject to a government security clearance investigation and must meet the requirements for access to classified information. Eligibility requirements include U.S. citizenship.\nYou'll go above and beyond our minimum requirements if you...\nPossess a MS or PhD in Computer Science, Software Engineering, Computer Engineering or equivalent\nHave 5 or more years of experience in frontend web development using Typescript and React\nHave experience developing backends using Python\nHave written frontend tests with Jest and/or Cypress\nHave developed and maintained Gitlab CI/CD pipelines\nHave used the Material UI component library\nHave containerized new and existing software using Docker and Podman\nHave proven success working in a multi-disciplinary team environment\nHold an active Top Secret level security clearance\n\nAbout Us\n\nWhy Work at APL?\n\nThe Johns Hopkins University Applied Physics Laboratory (APL) brings world-class expertise to our nation’s most critical defense, security, space and science challenges. While we are dedicated to solving complex challenges and pioneering new technologies, what makes us truly outstanding is our culture. We offer a vibrant, welcoming atmosphere where you can bring your authentic self to work, continue to grow, and build strong connections with inspiring teammates.\n\nAt APL, we celebrate our differences of perspectives and encourage creativity and bold, new ideas. Our employees enjoy generous benefits, including a robust education assistance program, unparalleled retirement contributions, and a healthy work/life balance. APL’s campus is located in the Baltimore-Washington metro area. Learn more about our career opportunities at http://www.jhuapl.edu/careers.\n\nAll qualified applicants will receive consideration for employment without regard to race, creed, color, religion, sex, gender identity or expression, sexual orientation, national origin, age, physical or mental disability, genetic information, veteran status, occupation, marital or familial status, political opinion, personal appearance, or any other characteristic protected by applicable law. APL is committed to providing reasonable accommodation to individuals of all abilities, including those with disabilities. If you require a reasonable accommodation to participate in any part of the hiring process, please contact Accommodations@jhuapl.edu.\n\nThe referenced pay range is based on JHU APL’s good faith belief at the time of posting. Actual compensation may vary based on factors such as geographic location, work experience, market conditions, education/training and skill level with consideration for internal parity. For salaried employees scheduled to work less than 40 hours per week, annual salary will be prorated based on the number of hours worked. APL may offer bonuses or other forms of compensation per internal policy and/or contractual designation. Additional compensation may be provided in the form of a sign-on bonus, relocation benefits, locality allowance or discretionary payments for exceptional performance. APL provides eligible staff with a comprehensive benefits package including retirement plans, paid time off, medical, dental, vision, life insurance, short-term disability, long-term disability, flexible spending accounts, education assistance, and training and development. Applications are accepted on a rolling basis.\n\n\nMinimum Rate\n\n$100,000 Annually\n\nMaximum Rate\n\n$227,500 Annually"
  },
  {
    "title": "Staff Software Engineer - Backend",
    "company": "OpenAsset",
    "location": "Remote",
    "salary": "$175,000 - $215,000 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0C4Tabrtcbt4ExmXtHRH1Po8yB0VJ0sezETT7KgwkmHbvH8q1XMgRyeal7bVoc4A4RWV593EnigxDiU6RUJv4inZI6xg38YTmFfm8P8LCOb0bp97a2m5ZYfDNzufCAw8KVmMqrjSEo5oB3dW2mr3eNgq9wbH_SJMtiYoekaV5vofA6ghWPJ9xcX5ScViQvmesHnmGwmRxzLrfmGyKNA5hU45YIroDpfnrTm_2DJxyJfPmRW8afmHQLWLNPWFZe4v93aDNQMl54yy-Rkz__DmUXBUtAp-fsFzm1WplXV8QRILb3ktiokymBahHbMNPqp9OahKZQr5oeG64Qn6qyD2DioQZCtpRfciNYJgck66mWnTJVeMb3f44xUjqyBqFRknSYfuNQjDRe_rLfijSK0PP0KY-mXYERHPidy0i7gtl6Bzm9lFXNVHHQY7NWSrLOs1P93PHIkBHiIldHTc26MMC7MnvNwyToXaaZm8Z34NY__3jbDp7EZoVU1cMsk6tBkEbyprbNpTDMMZvS2HYuV2pdHREIHWEOGmZ6-xx9uZumR6Fa2cqFfmJ7YLSylO_n7NWiDBtibgHL_mkv9BsRZt6TcrYFZgh8KtoVVtpyDwotwHiMjXxUzcQZlDpgmmvgRYUyYVBpiAkRDFQ==&xkcb=SoD56_M3sjCkNN0HpJ0ObzkdCdPP&camk=UoKtGZLa3XKhqtHv6Mt3rg==&p=5&fvj=0&vjs=3",
    "description": "We are looking for a US based (EST working hours) Staff Software Engineer - Backend to join our talented, dynamic, and rapidly growing global team. We have an in-office policy of 2 days per week for local employees.\nCompany Description\nOpenAsset is the leading marketing platform for the Architecture, Construction, and Engineering industries, trusted by 1,000+ clients over 20 years. Our mission is to be the most innovative partner to AEC firms, delivering solutions that help win more projects. We recently announced a new AI-Proposal product Shred.ai to continue this mission.\nWe’re a diverse, collaborative, and fast-growing team of 100+ employees with offices in New York and London and a global client base. Backed by Marlin Equity Partners, we’re passionate about creating an inclusive workplace where everyone feels valued and has a voice, and we actively hire from a diverse pool of candidates.\nDescription\nEmbark on a rewarding journey as a Staff Software Engineer - Backend at Shred.AI, leading the charge of our dynamic backend team. In this hands-on technical role, you'll be at the forefront of crafting exceptional microservices and distributed systems using Python, Terraform, and AWS technologies. As a pivotal force in our team, you will not only contribute directly to code but also champion best practices, guide the team through technical challenges, and advocate for excellence in all aspects of software development.\nYour expertise will shape the technical direction of our services and applications, ensuring they remain scalable, performant, and maintainable. If you're passionate about delving into the intricacies of backend technologies, mentoring fellow engineers, and making a tangible impact on product delivery, we invite you to be a driving force in our collaborative and forward-thinking environment. Join us, where your hands-on technical leadership will be instrumental in the success of our projects and the growth of our talented team.\nResponsibilities\nAs a Staff Software Engineer - Backend, your day-to-day activities will revolve around technical leadership, effective communication, and a hands-on approach to solving complex challenges, contributing to the overall success of the backend team and the company.\nProject Ownership\nLead the design, planning, estimation, testing, and coordination for ongoing and upcoming team projects spanning multiple releases.\nTake ownership of the entire development lifecycle, ensuring the delivery of complex systems on time and within budget.\nCross-Team Collaboration\nCollaborate with Product and Engineering teams to address cross-cutting technical issues, contributing to the overall success of company-wide initiatives.\nWork on issues requiring in-depth evaluation, providing creative and effective solutions to complex problems.\nTechnical Leadership\nProvide technical advice and weigh in on decisions that have an impact on other teams or the company at large.\nResearch and propose new technologies to enhance the capabilities of the backend services and applications.\nCommunication and Mentorship\nCommunicate effectively within and outside the Engineering organization, fostering a collaborative environment.\nContribute to the growth of team members through code reviews, documentation, technical guidance, and mentorship.\nStrategic Problem Solving\nActively identify and propose strategies to resolve technical problems affecting the team, demonstrating a strategic mindset.\nDetermine methods and procedures used by the team, focusing on continuous improvement and efficiency.\nSecurity, Reliability, and Compliance\nActively work to refine the team’s approach to security, reliability, privacy, and compliance.\nComplete tasks and projects in these areas with minimal guidance, ensuring the highest standards are met.\nDocumentation and Knowledge Sharing\nTake responsibility for team and system-wide documentation, ensuring that knowledge is well-documented and shared within the team and beyond.\nSkills and Experience\n7+ years of backend engineering experience\n3+ years of technical leadership experience and/or managing teams\nExpert and high proficiency in programming languages such as Python and/or Go\nExpert in systems architecture and experience working with multiple backend systems at scale\nExpert understanding of microservices architecture, continuous integration, and deployment for reusability and testability\nExperience leading and mentoring engineers without formal direct reporting relationships\nProactive collaboration with different engineering teams and advocacy for team’s needs\nExperience working in an Agile/Scrum methodology\nBachelor’s or Master’s degree in Computer Science, Engineering, or other related technical field\nTechnologies we use\nPython\nTerraform\nDocker\nAWS\nMySQL\nGithub (and Github actions)\nBenefits\nCompetitive salary\nMedical / Dental / Vision coverage - 100% employer-paid for employees, 50% employer-paid for dependents\n20 days paid time off per year + federal holidays (UK style!)\n5 paid sick days\nWork from home flexibility\nCommuter benefits\n401k\nPaid parental leave\nCareer growth and development opportunities\nThis position is not eligible for visa sponsorship.\nAxomic is an Equal Opportunity Employer. We base our employment decisions entirely on business needs, job requirements, and qualifications—we do not discriminate based on race, gender, religion, health, parental status, personal beliefs, veteran status, age, or any other status. We have zero tolerance for any kind of discrimination, and we are looking for candidates who share those values. Applications from women and members of underrepresented minority groups are welcomed.\nJob Type: Full-time\nPay: $175,000.00 - $215,000.00 per year\nBenefits:\nReferral program\nWork Location: Remote"
  },
  {
    "title": "Software Engineer",
    "company": "ChemDAQ Inc.",
    "location": "Pittsburgh, PA 15205",
    "salary": "$100,000 - $120,000 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0Cw9HWr2PLJka-hNNFardGZ4cYIKkaYtpHH55oSyrsHFoMfDYWyohGOzJKMjoU8PFFNpdK2ztNepFHt3cD8dAZwrj71KMUejJQBSxW6L1QF6LephOL_SCSEo1dO7gjJqZdrE2y3V95rLlfozA2vLYhKzSQqdlx9-Iazbo7WdhlKS1rVt_ynjE550hBOrmXC9m98e0uWgKYqTRfieeB39oW4lJwV8Dxe-cJpdWqHoQcwPt_oHgQMrkwxVXCj7UttcIjYGTGJVSTT4C3Wgs71pXPTMYilDIouZq_xUiFXsiAfodfG5DBJWO_tSSuUFD2btOhoUheNK2yvCnRf8VVkXiWd77aFak3E6PDu2N7L1aRermec7a-nEzQo4brdQjg8llaS06GEbYdLpOYdijUMU7iXfJrLD-NySK0qK1kk6FDmCbCKPPfK4CEZEqcnKk5UQY_-E8i0LsGUnYcwWGsfxuG-ofcG-oX0jBrOIxIcsQWNd2pH6wKCqphmnNdhQjfTgUb-HkUbk4UYHXRJyPO3qbDYu9RM7iTa5koqG2g8f02MTsg1hoVB3ORjFEdtAmJ1oQUqQPgpYHvfzqeeOwshoiCWCW0QLYQxRiwzV4CuvyeIuYiFbR9KjEtmedKKUCZ7a2p9yhVcj6d_vUawQ0-w7HxI&xkcb=SoAD6_M3sjCkNN0HpJ0FbzkdCdPP&camk=UoKtGZLa3XJVBizUiqBGfA==&p=14&fvj=0&vjs=3",
    "description": "Get to know ChemDAQ\nChemDAQ, Inc., is a rapidly growing, leading-edge technology and manufacturing company based in Pittsburgh, Pennsylvania. The value we bring to the market lies in safeguarding human health, ensuring operational compliance, and optimizing safety practices.\nChemDAQ’s mission is to help customers eliminate workplace exposure to toxic chemicals through innovative monitoring and control solutions, industry-leading partnerships, and superior safety expertise. Our patented sensor technology provides superior chemical monitoring and control products that our customers trust, our employees are proud of, and our partners seek solutions to providing a safer workplace.\nOur Core Values – Trust, Innovation, Empowerment, Teamwork, Loyalty and Vision – shape our company culture and guide our daily operations.\nTo learn more about our growing company, visit www.ChemDAQ.com.\nAre you ready to join a company with a strong purpose and a winning culture?\nAbout the Role:\nWe are seeking an experienced Software Engineer with a strong background in software, firmware, and database development.\nPrimary Responsibilities\n● Application development in Windows and Android OSs\n● Support and optimize existing applications present in C, C++, Python, Visual Basic and database applications.\n● Support current databases in AWS RDS, MySQL and MS Access\n● Maintain clear technical documentation for code, processes, and system designs.\nRequired Skills\n● Scripting languages: PowerShell, Bash\n● Web Development: Python (Django/Flask), Java, JavaScript (Node.js), React, Angular, PHP, HTML and CSS\n● Cloud & DevOps: AWS, Azure\n● Version Control: Git, GitHub, GitLab\nWhat You Bring\n● Bachelor’s degree in Engineering (Software, Computer Science, and/or Information Technology, or related field);\n● Minimum 5 years of software engineering experience within a technology company or a similar industry (e.g., industrial safety, sensors, or chemical detection).\n● Strong understanding of software, cloud-based database development; firmware desired\n● Design, write, and test software to ensure functionality, reliability, and performance.\n● Work in a team environment with shared code; disciplined use of source code control and process documentation.\nWhy join us?\n● Competitive compensation\n● Comprehensive benefits package that includes health, dental, vision, life insurance, PTO and 401(k) with company Contribution.\n● A unique opportunity to work with a family-owned and operated business that has a trusted reputation among our partners and customers.\n● You will be joining a growing team of individuals that care about their employees and customers and have a genuine passion for what we do.\nJob Type: Full-time\nPay: $100,000.00 - $120,000.00 per year\nBenefits:\n401(k) matching\nDental insurance\nDisability insurance\nEmployee assistance program\nFlexible schedule\nFlexible spending account\nHealth insurance\nHealth savings account\nLife insurance\nPaid time off\nProfessional development assistance\nVision insurance\nExperience:\nC, C++: 5 years (Required)\nAbility to Commute:\nPittsburgh, PA 15205 (Required)\nWork Location: In person"
  },
  {
    "title": "",
    "company": "",
    "location": "",
    "salary": "",
    "url": "https://www.indeed.com/viewjob?jk=a1b2c3d4e5f67890",
    "description": "None"
  },
  {
    "title": "Backend Developer",
    "company": "Aquent Talent",
    "location": "Remote in California",
    "salary": "$65 - $75 an hour",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0BwP6NSyPII8Kiv0kbFbbebDSx5gYZqV2yJNSnCXD8tkAnehI63LfFW9nH99Nziaiz02cT_92qCj_Th6tFL_biQF3F2xUS7Faao-uPwOUZqBJLXGRTj75hkvDOeEtbSDFHEYn68EEQKWSEGck2sJUBaWQFtGG2I0RRHWUKBoC1J-3fF1lM2TlwVDUjJA05dC-2xhBUd_kPpQQTwpwSTWbXC8aZaB3jUesE3BSmcL474n3oyxLPFhzeuxSqSo6FzCa4yN9SfQKtt6lNG7qTIze-VZNf9bZSFImmeKdhDfqDkLyK-AHOkHncawFCqgvKzl8rLribOg_ZE9Sq1fW19EkStxNf0XCnvTcLrWH13MFkDIbEPsLzOdc6Ytf11kiSDC0N0n7kgxMYfBfNm-lufN58_w48eKzxx7xWF6BxkiRDZoQz1HeetlJd0RLuine3EhFgeUQOmrTBh15nygcTVhK10CGHC3hcO5kks8hjhl0by9uhbQN2rpNly4pw0Ac0Noc0a2Ju2jrTYnFjdNSN-crbjKzd2FJ4Z3o-QslFswKEXTvlP7vjuGdVmQW_xeAg7O56VDrZ-UcA1IdJpCrJ5I7ZAEPbjzIomOl6SQhPSvXp4YrpuQg7ZHeJrbVWOux17ZetTy8djq-QOi7PvD8kDnbH-wDpqfZ3iWJI=&xkcb=SoDr6_M3sjCgVSx7gx0BbzkdCdPP&camk=nUmJqO2E8rjGpow4Svs_Mw==&p=10&fvj=0&vjs=3",
    "description": "*Candidates requesting to work as C2C or 1099 will not be considered*\n– This is a fully remote role, working PST hours, approved for 9 months, with a possible extension past that point.\n– Compensation is based on several factors including, but not limited to education, relevant work experience, relevant certifications, and location. Additional benefits offered may include; medical health insurance and dental insurance, life insurance, and eligibility to participate in a 401k plan with company match.\n– This is primarily a backend development / coding related role, with 75% of time to be dedicated in this area.\nFor this role Candidates must have:\nStrong Java experience with Kotlin and Scala experience (all 3 are needed for consideration for this role)\nCandidates who have worked for Financial organizations or produced work for Financial organizations will have preference, others who have worked within highly regulated industries (Insurance / Healthcare) will be considered.\nOther key skills that will set a candidate apart from others:\nACH transaction experience / NACHA compliance experience is an added advantage for consideration for this role\nRole description/Summary:\nOur established Financial Client is seeking a strong candidate for a Backend Developer/Software Engineer who will play a key role in transforming a client’s product architecture.\nThe primary purpose of this role is to design, build, and maintain backend services that power our financial transaction processing systems, with a focus on ACH processing and NACHA compliance.\nWill be responsible for developing secure, scalable, and efficient services using Java/Kotlin/Spring in a micro-service-based architecture running on Kubernetes.\nSuccess in this role will be measured by:\nAccuracy and timeliness of ACH transaction processing.\nSystem stability, scalability, and uptime.\nCompliance with NACHA, FedACH, and internal policies.\nReduction in transaction discrepancies and resolution turnaround time.\nKey/Principal Responsibilities:\nProcess incoming and outgoing ACH transactions and files in accordance with NACHA rules and FedACH requirements.\nInvestigate and resolve ACH discrepancies, errors, and exceptions.\nDesign, develop, test, and maintain backend services and APIs in a microservices environment.\nCollaborate with cross-functional teams, including product, operations, and compliance, to gather requirements, provide estimates, and deliver high-quality solutions.\nParticipate in sprint planning, code reviews, and system architecture discussions.\nEnsure backend systems follow security, compliance, and data privacy best practices.\nMonitor, analyze, and improve system performance through analytics, metrics, and logging integrations.\nMaintain documentation and contribute to knowledge sharing within the team.\nWork closely with senior engineers and architects; may mentor junior developers depending on experience level.\nRequired Skills and Experience:\nMinimum 6+ years of programming experience, ideally with a modern backend stack.\n4+ years’ experience with Java, Kotlin, and Scala.\nStrong understanding of relational databases (PostgreSQL preferred) and ORM frameworks\nExperience with micro-services and service-oriented architectures (SOA).\nCloud platforms experience (Kubernetes preferred).\nProficiency with CI/CD pipelines.\nTest-driven development experience, including unit and integration testing.\nProven ability to translate business requirements into scalable technical solutions.\nFamiliarity with secure coding practices and regulatory compliance in financial services.\nAgile software development experience.\nNice to have skills:\nExperience with Fiserv systems and/or general credit product knowledge.\nNACHA experience (highly preferred).\nExperience processing ACH returns, NOCs, and DNEs.\nExposure to analytics and monitoring tools.\nRelevant technical certifications (e.g., Java, Kubernetes, AWS, or NACHA Accredited ACH Professional).\nAbout Aquent:\nAquent connects the best talent in marketing, creative, and design with the world’s biggest brands. Our eligible talent has access to amazing benefits like subsidized health, vision, and dental plans, paid sick leave, and retirement plans with a match.\nAquent is an equal-opportunity employer. We evaluate qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, and other legally protected characteristics. We’re about creating an inclusive environment—one where different backgrounds, experiences, and perspectives are valued, and everyone can contribute, grow their careers, and thrive.\nThe target hiring compensation range for this role is $65 to $75. Compensation is based on several factors including, but not limited to education, relevant work experience, relevant certifications, and location.\n\nAbout Aquent Talent:\nAquent Talent connects the best talent in marketing, creative, and design with the world’s biggest brands.\n\nOur eligible talent get access to amazing benefits like subsidized health, vision, and dental plans, paid sick leave, and retirement plans with a match. We also offer free online training through Aquent Gymnasium. More information on our awesome benefits!\n\nAquent is an equal-opportunity employer. We evaluate qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, and other legally protected characteristics. We’re about creating an inclusive environment—one where different backgrounds, experiences, and perspectives are valued, and everyone can contribute, grow their careers, and thrive.\n\nClient Description\n\nClient Description:\nFreelancing long-term with Aquent gets you access to some pretty cool things:\n– You’re paid weekly\n– Subsidized health and dental benefits after your first four weeks of work (averaging at least 20 hrs/wk)\n– Paid Sick Leave for all US and Canada talent\n– Access to Fidelity 401(k) with company match\n– Access to FSA Program (pre-tax payment toward bus or train passes, etc.)\n– Direct deposit for your paycheck\n– Access to our Talent Rewards Program (we reward for referrals!)\n– Access to free online courses via Aquent’s Gymnasium, to help you develop your skills: http://gymnasium.aquent.com/\n– Aquent support: your Aquent Agent checks in with you during the course of your contract to make sure you’re happy and progressing according to your expectations (we’re also there to be looking for new opportunities for you when you’re close to wrapping up)\n#LI-Remote"
  },
  {
    "title": "Web Developer",
    "company": "CGI Group, Inc.",
    "location": "Newport News, VA 23606",
    "salary": "$61,900 - $137,100 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0CmPt6JXytAhZscz-5ZOP53MMQ49Xi4hmwETo1lvmuAlZ7fNcZ2Zn_F3aUkaZRnPorsegnL3-r0zlyRHk68wJIX0OiUT48ObNuZlHRAI0c62HW8G2jmwFfrW8wxllIUVfKNODMKWws3AWiVX31tGGOxXEaN2ymzXx6B3cAukR5Q-sIyRm6PKlrZF7YXlXd8bHPQumRV_fyXgQ0fx_e883hx6y6dLI7WR3h62zj6Y2_PDUDK5wkLWKCEFZLprn30pRK3mAlwp8rt8uaJljKijjVxZK_icy_QNJOhjJ2qAgZYgWTPWBYmnlnvrRTZ0VQfdlzWKb-uS7I5vtqiCVgoWppjHUGT70CUSHMfHH-Y6FWT7PnndSDwEVTwdXk5hDCkVCw6xjlT8_6OXqLdopLG7VUhtWuMTQ6v4PbHegO2yAN5gSoh6WJH_q1Ir5bgoNQaUi36gIMPUQK9RC3v8v72WE47URDbmAI3ia04YNXfK_8b-3sECrle2-ONeRs4DR9FHe7XHlBpSHAIlHX5hMN4T_Sg5QnbiHSZwmuAFYi2n6j-homtQVsKHotvz4Imn3TdKSvQ7qTgRnRNCmvRyMuZWN_zm6r_Mkr-5xRmJ8TngBy71ta0DeSq-QfqIYM85SANgQkvFVRnc6wWDTYBKUvpbMWTWyv1Dn8X690RtpDNetrHpw==&xkcb=SoDC6_M3sjCgVSx7gx0DbzkdCdPP&camk=4HOcmqOLYrDRUgFLBjquYg==&p=8&fvj=0&vjs=3",
    "description": "Position Description:\nAt CGI Federal, we are dedicated to innovation and excellence. We are a dynamic team of professionals committed to creating solutions that drive the future of technology. Join us and be part of a company that values creativity, collaboration, and continuous learning.\nWe are seeking a talented and highly creative Web Developer to work with a Department of Defense (DoD) client in the Newport News, VA area. The ideal candidate will have a foundational background in web development, with a keen eye for detail and a passion for creating user-friendly and visually appealing websites. This role will involve designing, developing, and maintaining our web applications to ensure optimal performance and user experience. This is an excellent opportunity for an early-career professional to grow their skills and contribute to meaningful projects\n\nThis position is located in Newport News, VA.\nYour future duties and responsibilities:\nAssist in the design, development, and maintenance of web applications using modern web technologies and frameworks.\nCollaborate with designers, product managers, and other developers to understand project requirements and deliver high-quality web solutions.\nImplement responsive design principles to ensure a consistent user experience across various devices and screen sizes.\nTroubleshoot and resolve technical issues and bugs in a timely manner.\nStay current with industry trends and best practices in web development.\nEnsure the security and integrity of web applications by implementing best practices and security measures.\nParticipate in code reviews and provide constructive feedback to underpin objectives of producing high quality code.\nDevelop and maintain documentation for web applications, including code comments, user guides, and technical specifications.\nRequired qualifications to be successful in this role:\nDue to the nature of the work, US Citizenship and an active DoD Secret clearance required\nBachelor's degree in Computer Science, Information Technology, or a related field, or equivalent work experience.\nExperience as a Web Developer or similar role, with a strong portfolio showcasing web development projects.\nProficiency in web development technologies, including HTML, CSS, JavaScript, and relevant frameworks (e.g., React, Angular, Vue.js).\nUnderstanding of web standards, accessibility, and best practices.\nKnowledge of version control systems (e.g., Git).\nExcellent communication and collaboration skills.\nAbility to work independently and as part of a team.\nStrong attention to detail and ability to meet deadlines in a fast-paced environment.\nIAT II certification required (e.g. Security+, Cloud+)\nDesired qualifications/non-essential skills required:\nKnowledge of Scaled Agile Framework (SAFe)\nExperience with cloud platforms (e.g. Azure, AWS, Google Cloud)\nKnowledge of containerization and orchestration tools (e.g. Docker, Kubernetes)\nExperience with Azure DevOps and Git\nFamiliarity with CI/CD Pipelines\nExperience with DevSecOps principles and DoD policies related to the topic\n\n\nCGI is required by law in some jurisdictions to include a reasonable estimate of the compensation range for this role. The determination of this range includes various factors not limited to skill set, level, experience, relevant training, and licensure and certifications. To support the ability to reward for merit-based performance, CGI typically does not hire individuals at or near the top of the range for their role. Compensation decisions are dependent on the facts and circumstances of each case. A reasonable estimate of the current range for this role in the U.S. is $61,900.00 - $137,100.00.\n\nCGI Federal's benefits are offered to eligible professionals on their first day of employment to include:\nCompetitive compensation\nComprehensive insurance options\nMatching contributions through the 401(k) plan and the share purchase plan\nPaid time off for vacation, holidays, and sick time\nPaid parental leave\nLearning opportunities and tuition assistance\nWellness and Well-being programs\n\n#CGIFederalJob\n#LI-PC1\nSkills:\nCompTIA Security+\nCSS\nEnglish\nHTML\nJavaScript\nVue.js\nWhat you can expect from us:\nTogether, as owners, lets turn meaningful insights into action.\n\nLife at CGI is rooted in ownership, teamwork, respect and belonging. Here, youll reach your full potential because\n\nYou are invited to be an owner from day 1 as we work together to bring our Dream to life. Thats why we call ourselves CGI Partners rather than employees. We benefit from our collective success and actively shape our companys strategy and direction.\n\nYour work creates value. Youll develop innovative solutions and build relationships with teammates and clients while accessing global capabilities to scale your ideas, embrace new opportunities, and benefit from expansive industry and technology expertise.\n\nYoull shape your career by joining a company built to grow and last. Youll be supported by leaders who care about your health and well-being and provide you with opportunities to deepen your skills and broaden your horizons.\n\nCome join our teamone of the largest IT and business consulting services firms in the world.\n\nQualified applicants will receive consideration for employment without regard to their race, ethnicity, ancestry, color, sex, religion, creed, age, national origin, citizenship status, disability, pregnancy, medical condition, military and veteran status, marital status, sexual orientation or perceived sexual orientation, gender, gender identity, and gender expression, familial status or responsibilities, reproductive health decisions, political affiliation, genetic information, height, weight, or any other legally protected status or characteristics to the extent required by applicable federal, state, and/or local laws where we do business.\n\nCGI provides reasonable accommodations to qualified individuals with disabilities. If you need an accommodation to apply for a job in the U.S., please email the CGI U.S. Employment Compliance mailbox at US_Employment_Compliance@cgi.com. You will need to reference the Position ID of the position in which you are interested. Your message will be routed to the appropriate recruiter who will assist you. Please note, this email address is only to be used for those individuals who need an accommodation to apply for a job. Emails for any other reason or those that do not include a Position ID will not be returned.\n\nWe make it easy to translate military experience and skills! Click here to be directed to our site that is dedicated to veterans and transitioning service members.\n\nAll CGI offers of employment in the U.S. are contingent upon the ability to successfully complete a background investigation. Background investigation components can vary dependent upon specific assignment and/or level of US government security clearance held. Dependent upon role and/or federal government security clearance requirements, and in accordance with applicable laws, some background investigations may include a credit check. CGI will consider for employment qualified applicants with arrests and conviction records in accordance with all local regulations and ordinances.\n\nCGI will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with CGIs legal duty to furnish information."
  },
  {
    "title": "Software Developer",
    "company": "ConEquip Parts & Equipment, LLC",
    "location": "Depew, NY 14043",
    "salary": "$75,000 - $115,000 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0AluXfLm5_7ltELWPFhE_RHKNv3eRg99X2c_r_ABfd_ASEuvFXkJ5VRkV3jWgv41wnbAj4uwYWs7kCoD59C8t471pDrfdmr_2Lsfqey42vslljGyYX5ARxymxao-iKLIuGqMSLfVeVJbblqw2FYE6eN3cEN44h8NPTbp3Jk589rlbV3UmkHx2d5jF3LkybJWfHHaqJTiPLI09r1kVP_UpBaVcBQK2rJwpOyEmcwTX01ZXubZ0CyRjEYNdaJeqtODVjX1mSAd-LzQZGh6eQbXL6LzyAFGXKT1flsfCmKKK4a-PmH9QFG67GrzsB2zmXVD6bmE71Z7A_Z5yr5FTDrRutzmzEtWA80TNMu6P28MpKHjiYRPRU2cZ80aGutcE63Gz-FRwPNjC5xa9BQ0XWNacRi4UePHbXlaBwQmbd8FtACxuj-P_adFwNYAX5UZy4FotO6GmujzgCiyuHnlLnYNQ13oYD9RY_coX2IP66Bpn51eRR587PinGcacYJ43bdADtuFVWxI1yRl6dOoSpB_Mj2J22MUGZT5T80AwlVKnPEIB-tpwhQgACfJjB_Vp8MqwH4rFSXJsI43U4k7GcvFqbMEuYesaMzVLn0IvtCZ9pOq-hs1dEr8vrQACkGS-7uTdj1yjFkzIArOGiQAkBFKVTpb&xkcb=SoDR6_M3sjCgVSx7gx0HbzkdCdPP&camk=UoKtGZLa3XJks7bxTamotA==&p=12&fvj=0&vjs=3",
    "description": "Company Overview\nConEquip Parts, a growing construction equipment parts supplier, is seeking a Software Developer to join our internal development team. This is an in-office role that will focus primarily on maintaining and extending our Magento-based e-commerce platform, while also contributing to Python-based tools and integrations, including our ERP system (Odoo).\nWe are looking for a versatile and experienced developer who enjoys problem-solving, has a strong foundation in backend and full-stack development, and can collaborate across business and technical teams to bring ideas to life. The Software Developer is responsible for the scripting of websites and updating existing web applications using scripting languages. As a Software Developer, you will be responsible for coding, testing, design adjustments, and client reviews.\nEssential Duties and Responsibilities\nAutomate tasks via scripts.\nTesting and maintenance of front and backend applications.\nCreation and maintenance of the data warehouse.\nTroubleshoot, debug, and upgrade existing systems.\nCollaborate to implement new technologies.\nKeep up to date with the newest technology and programming trends.\nUse user feedback to correct and implement on the database.\nQualifications and Skills\nProven problem-solving abilities with attention to detail and strong analytical and critical thinking capabilities.\nSolid experience with Magento 2.4.x or strong knowledge of PHP OOP frameworks (Laravel, Symfony, Zend).\nFamiliarity with Composer, dependency injection, and modular architecture.\nExperience building or maintaining backend services, APIs, and data workflows.\nCompetent in Python, with experience in building applications, scripting, or backend services.\nFamiliarity with Odoo or similar ERP/CRM frameworks is a significant plus, especially experience in customizing and extending business workflows.\nBasic understanding of SQL, particularly PostgreSQL, for data querying and manipulation.\nExposure to web development technologies (HTML, CSS, JavaScript) and other languages.\nEducation and Experience\nA bachelor's degree in information technology, computer science, or a similar field is preferred.\n3–5 years of hands-on development experience, particularly with Magento, PHP and Python-based applications.\nDemonstrated experience with one or more backend or full-stack development environments.\nProven track record in PHP web application development (Magento or related frameworks).\nEquivalent combinations of education, experience, or technical training will be considered based on the strength of the applicant’s portfolio and practical knowledge.\nIf you're ready to make an impact in the world of construction equipment parts through innovative software solutions, we invite you to apply today at ConEquip Parts!\nJob Type: Full-time\nPay: $75,000.00 - $115,000.00 per year\nBenefits:\n401(k)\n401(k) matching\nDental insurance\nDisability insurance\nHealth insurance\nLife insurance\nPaid time off\nPaid training\nVision insurance\nWork Location: In person"
  },
  {
    "title": "Software Dev Engineer II",
    "company": "Belcan",
    "location": "Seattle, WA 98108 \n(Georgetown area)",
    "salary": "$64.36 an hour",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0DXzDzZ1Oulz9LSjzVbF8otUHEujJfFPwzVdyJWZPnyGP21i8g1idx-A-BThzGW7o9vKffkTrZjCHH9OD8M6A6gBZmxULCgxDbMFPVtKN9L9RuxoYCHx7pJW3agxpDTEM6LEGvbCp75yLxaMhBFnZQZn25Wagz60CVpOa5_XNIbK9CFpDDXoFfR1Lxe8VonKELq_FZSPyv2D5QdmwA0a3uPcI-S4ojvqQPTglHuuhSiXhedZnmmm97_f982G4JbGJOSiXylxVxh_Vrzwu6q3kkY-2tuwYaSlHDZAdt0q2GcSfWPdpGylFRxNhNlBO665EoD7B69JreLP4cHoOUfyFrFZYU1VMlyUIqg57FKg6w4A-nwah26e5tgqNaYm6rsHmUJcjzIbc0BedtqKgirKkmGvRLqztOHXy30k0EvlaK8a7fD3238U4gwkYPpZTpk-oCjc_5Vavv4cehU0s0_NwQNAsb06OCqKpNx8ZUUIAvXxRpKfj6wGADJxLxwCn4Q86lggSG3_yuzpvJGJY2MB662i8-INibV-z3vyB9x1VzKYMF-6e0ekUg3YI5g-yJ7VzJvPGicW4x8mR3WNJlhjSvb1NYXML2oED-h2Za8A7NID2rNHUo1friqJPjJIfYVr9F045KpoJOXSyNxoAmNxRzmH8kuzHBL1qdLT7TufSkS55Ma0BPkpjAtu8jYHOKCiAQEwv6WB4W1QudIGn1mRs0J5L-Zks-2-G9v_8bZ2esFHzXx7aMtfHsVDdHqJbIiKp9By19c1aQGmLD8MSy10lwHU1uslKpB2y4nSY8-6biEgj-pvi409HT9-DvYiRaNHsr22V4FDJ16SF8jmKBkh_pZCfUZyIPXdMvKmIEm03vU0F1xPw8xLnpe4cciK8_0DfWcKctmKzoL4-6SKQqb8rqhtHBTjLtoII8sMWDJdSQ-kPhCQ9-ndKXZ9aKM4cf6q20qiPP0Gg2uiQr9QWponGI5&xkcb=SoB26_M3sjCgVSx7gx0CbzkdCdPP&camk=YU1lDJX-4XGSZjmdCmw0Ew==&p=9&fvj=0&vjs=3",
    "description": "Job Title: Software Dev Engineer II\nLocation: Seattle, WA\nZip code: 98108\nPay rate: $64.36 /hr.\nJob type : Contract\nDuration: 6 months\nStart Date: Right Away\nKeywords: #SoftwareEngineerJobs; #SeattleJobs;\n\nJob Description:\nOur Client is seeking an experienced Software Engineer who combines superb technical, research and analytical capabilities with a demonstrated ability to get the right things done quickly and effectively.\nThis person must be comfortable working with a team of top-notch developers and collaborating with our research teams. We\"re looking for someone who innovates, and loves solving hard problems.\nYou will work hard, have fun, and of course, make history!\n\nRequired:\n5+ years of full-stack or large scale distributed systems experience, experience in object-oriented Java,\nProficiency in data structures and algorithms\nExperience with software design patterns and architecture\nFamiliarity with Agile development methodologies\nKnowledge of version control systems (e.g., Git)\nUnderstanding of database systems and SQL\nExperience with web technologies and frameworks\nExperience with at least one major RDBMS (e.g., MySQL, PostgreSQL, Oracle)\nFamiliarity with NoSQL databases (e.g., MongoDB, Cassandra)\nFamiliarity with cloud platforms (e.g., AWS, Azure, GCP)\nPreferred:\nExperience in AWS such as EC2, S3, Batch and Glue, Experience with SQL, Experience with CI/CD pipelines and DevOps practices, Understanding of test-driven development and automated testing frameworks\nBelcan is a leading provider of qualified personnel to many of the world's most respected enterprises. We offer excellent opportunities for contract, temporary, temp-to-hire, and direct assignments. We are the employer of choice for thousands worldwide. For more information, please visit our website at Belcan.com"
  },
  {
    "title": "Senior Full Stack Engineer (local Candidates )",
    "company": "Health Data Analytics Institute",
    "location": "Hybrid work in Dedham, MA 02026",
    "salary": "$146,235 - $165,321 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0BCiN5p_k29LybVLB04mYa_egsHTCPsjUODsZMgeNdy5HPqzy-IUM8efr3LT9ZBJHN5qtAc_Lk2_kCgi8fdJkVhNyQCMP2MxnaOqiWrh-w37KPtzyOI2e1SooCQCBqvJbQ-MEenhTZ33sJ-GVJdaLtfLeOjalqGT6Bgf3JRD9HXJXKiZBqJlHj4Slk-qXhv3iKBkVMqlz5sLP3BNXTPpNaCjpFZMOGaH15SpUFC4LcFPv9KXrJR024SI6MaKvF87P_odGk2eZAo2ONjgrzmngOqj8zdhVK_EEuck5EIEJTDEE3Re2uOKW0DpgnwcYZEWD_NaXeP3H92jDolZM5zSjdKBR4DmLtFUtVuzrQfWQKmVXqt3Unu3gBXydq2968qLclw2Id8qcvkmNzsCwyeRpvnSsKAVC_nyxXxxP4KXZMyyLg4S0K4JM_gG5z9Oo3NRL2kzK3668tK_HH5oLQXk02m3tpg0u2vHhkLe-z6T_siMiSwD-nVAYxatOZrnDTzLZb-TyI7MURTMOsBZDb8AG3eQ87h6lIK_18xOZkp7EMMD3StJalQM4Eusw-zkme1coCHJcGlSjCAnTrt9qt8EYAdb_Wy-h6YJDsv1pnhjZD4Zl7k9hAetIsPJGjQyGtoJbHi1MQShxNmXuMGXk6cMZv_MBUNGpxAvylCgJb6miZVv2UYAKpLO3QyFu3HhguzWS7mJ5sHSVDhknHRg7LCHEn0TTnh5LmFKUU=&xkcb=SoCl6_M3sjCgVSx7gx0LbzkdCdPP&camk=UoKtGZLa3XIxGdyWF47J1w==&p=0&fvj=0&vjs=3",
    "description": "Senior Full Stack Software Engineer\nAbout us\nHealth Data Analytics Institute (HDAI) is a commercial-stage HealthTech company. Our Intelligent Health Management System, HealthVisionTM, is a first-in-class enterprise solution leveraging real-time predictive analytics and generative AI to deliver improved outcomes, efficiencies, and economics for health systems and value-based care organizations.\nHDAI is located in Dedham, MA near the Dedham Corporate Center Commuter Rail station on the Franklin/Foxboro line (25 minutes from Back Bay and South Station, Boston) and I-95/128. Interviews are being conducted remotely.\nRole overview\nWe are seeking an experienced Senior Full Stack Engineer who is passionate about delivering high-quality, scalable, and maintainable code. A strong understanding of full-stack development principles, microservices architecture, and a commitment to writing clean, efficient, and well-documented code are essential for success in this role.\nIf you thrive in a collaborative environment and have a desire to work on impactful projects within the healthcare sector, we encourage you to apply.\nResponsibilities\nDevelop High-Quality Software: Design, develop, test, deploy, and maintain high-quality full-stack applications in React, Node.js, FastAPI, Postgres DB, DynamoDB, AWS, and Datadog.\nCollaborate with Cross-Functional Teams: Work closely with team leads, product managers and other engineers to deliver end-to-end solutions that meet business requirements and user needs.\nOptimize Applications: Focus on writing efficient, scalable, and well-documented code. Continuously refactor and improve the existing codebase.\nCommunication and Feedback: Communicate technical plans, progress, and issues effectively to both technical and non-technical stakeholders.\nEnsure Best Practices: Follow industry best practices for security, performance, and reliability. Implement automated testing and deployment scripts where applicable.\nProblem Solving and Troubleshooting: Investigate and resolve complex technical issues, using debugging tools and methodologies to identify root causes. Implement fixes and improvements, ensuring minimal disruption to services.\nImprove AI Integrations: Adapt and implement AI solutions into our workflow to enhance efficiency and innovation in our applications. Participate in the definition and execution of security standards and compliance.\nAdopt New Technologies: Stay updated with emerging technologies and participate in the evaluation and adoption of new tools\nMinimum qualifications\n5+ years of professional frontend or full-stack development experience\n5+ years designing or leading the architecture of cloud-native systems (AWS, Azure, or GCP)\nStrong hands-on coding skills in React, TypeScript, and Python\nProven ability to work effectively on cross-functional teams (Product, QA, MLOps, etc.)\nComfortable and productive in fast-paced, high-ambiguity environments\nFluent in SQL with experience in relational databases (Postgres) and familiarity with NoSQL stores (DynamoDB, MongoDB, etc.)\nExperience writing unit tests and applying test-driven development (TDD) practices\nConfident using Git and Terraform within CI/CD pipelines\nAble to articulate engineering design choices and tradeoffs across scalability, performance, security, usability, and developer experience\nDemonstrated expertise working with complex data sets and data relationships\nPreferred education\nBachelor’s degree in Computer Science or equivalent practical experience; Master’s degree preferred\nBenefits\nHealth Benefits (health, vision, dental, HSA, FSA, life insurance available)\n401K w/ Company Match\n12 Company Paid Holidays\nGenerous PTO policy\nPay based on experience\nHybrid work environment\nJob Type: Full-time\nPay: $146,235.00 - $165,321.00 per year\nBenefits:\n401(k) matching\nFlexible spending account\nHealth insurance\nLife insurance\nVision insurance\nWork Location: Hybrid remote in Dedham, MA 02026"
  },
  {
    "title": "Software Engineer III - Workday Payroll (Remote Work Option)",
    "company": "NIKE",
    "location": "Remote in Beaverton, OR 97005",
    "salary": "$107,700 - $212,600 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0CLAFIAocNJ4Wfrhm82ciahvtobYpoaf72Vrs-CtZeLT_ILOwoZihKlzfNjHCtQsEoANuXKgGYDN-pGsTje2axVrTNdK8oOIAwYArzg1p7PJAf0m5aoDDmtu21j60UKB7zj_73E4rDAFOHGiiN-ECc4tU7VOTml6vG1vME4EP5ubFPZLvh49koWLc5Z1bZ3ewh2Eq-2qpig-1zXPDD-nuJO_sJxyLdyMHuPL7XPa6vucQ5JboJljiHo-GE5-7GNbs7SR9vfWQPnDkO7hrPC5MwhicvcGR2z-E2tHb4BwNmaq3zmMfXR3Xc-wDI0fTFGB-oJTh9n9VREkUAhrxMr1emzqNmgQcB_9a16uEo4Y5AiYhpyhUqApStQNsZKjDpvh76e2dV2mQIeuYQnObFwPz6Bi9JgJguKUvEG-d79KidGRopX9MYXjP0kuol9THW5ub0k4XvDne77c9LXTqqtW2v7YvEDbkpIZl2KN0W7Kq7Iby4cwwXa326kE4RXsWUJmsE43jdXBkEDrdUAtfjZt-8z72kTN9Fxt0IUQCTN-xMtotZoDAPyYpQvi9J4O5F5nzDi0FxfsY7fzLSvaB3F7tV19a3jUX5San7P4vT0Azqy_ke2EyBb5UaXtWUNsCUG3-mgdk1ioXWvNeJoeUy-907sDmbBRNZKMpge5YbhobtEEg==&xkcb=SoA46_M3sjCgVSx7gx0IbzkdCdPP&camk=UoKtGZLa3XK3McxbXcXWcw==&p=3&fvj=0&vjs=3",
    "description": "Open to remote work except in South Dakota, Vermont and West Virginia.\nThe annual base salary for this position ranges from $107,700.00 in our lowest geographic market to $212,600.00 in our highest geographic market. Actual salary will vary based on a candidate's location, qualifications, skills and experience.\nInformation about benefits can be found here.\nWHO WE ARE LOOKING FOR\nAs a Workday Payroll Senior Software Engineer III, you will work with the team of engineers across products. You will responsible to configuration, test, and deploy changes related to Workday Payroll, Leaves and Benefits required to meet business requirements. You will be driving the technical deliverables to be delivered on time.\nWHAT YOU WILL WORK ON\nDesign, develop, and maintain payroll modules within the Workday ecosystem.\nConfigure payroll business processes, pay components, earnings, deductions, tax setups,\nEnsure compliance with local, state, and federal regulations.\nDebug and resolve production issues and support change requests.\nPerform root cause analysis and implement solutions to prevent recurrence.\nCollaborate with functional teams (HR, Finance, Compliance) to understand business requirements.\nCreate user guides and support documentation for ongoing maintenance.\nIdentify opportunities to improve payroll system performance, accuracy, and efficiency.\nStay updated on Workday releases and proactively suggest enhancements.\nConduct root cause analysis to determine appropriate action plan for break/fix.\nEnsure 100% alignment to all policy, processes, and procedures.\nMaintain discretion and confidentiality in all areas of HR data and information, whether internal to Nike or customer specific.\nWHO YOU WILL WORK WITH\nWork with lead / Manager to make sure assigned work is delivered on time.\nWork with product management to understand business requirements.\nWork with cross product engineers and integrations to deliver the deliverables on time.\nWHAT YOU BRING\nBachelor's degree in Computer Science or related field. Will accept any suitable combination of education, experience and training\n7+ years of experience with configuring payroll, leaves, benefits\n5+ years of experience configuring Workday Payroll, Leaves, Benefits\nExperience with Workday Core HCM and Advanced Compensation is preferred\nStrong knowledge of Workday Payroll architecture and processes\nExperience with Workday EIB, Global Core Connectors, and Workday Report Writer\nAt least one full implementation of Workday, with demonstrated Workday Functional and technical experience\nAdvanced understanding of the complete software implementation lifecycle including integration requirements gathering, design, development, testing, and move to production\nKnowledge of SaaS applications and SaaS deployment models\nAbility to collaboratively work with Product owners in the implementation of the technical content in Agile Framework\nWorkday Payroll Pro Certification preferred\nDetail oriented with superior analytical, problem solving, pragmatism and organization skills\nAbility to pick up new technologies and common applications\nWe offer a number of accommodations to complete our interview process including screen readers, sign language interpreters, accessible and single location for in-person interviews, closed captioning, and other reasonable modifications as needed. If you discover, as you navigate our application process, that you need assistance or an accommodation due to a disability, please complete the Candidate Accommodation Request Form."
  },
  {
    "title": "Programmer Analyst (#5180)",
    "company": "Central Susquehanna Intermediate Unit",
    "location": "Hybrid work in Milton, PA 17847",
    "salary": "$55,000 - $65,000 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0CDyfwWR-14Li9SIb6xY6BYykgmztoTXORueB1SvRULuQFDISSEQNguVTSzzWg5p_hdcIqkpQuK0J91-dYOk5sORSg-kIIHSuxNND8oyo06QfGYIA1jzL5MUWDIAmiz2mEag9givWDP7gmThq1atFfL9LaCXPjeffANln7sJPmVHkbTZXCH4VPVX8aY6VHpackeqpC1N-L00apyT4_qXd6XXmtnyVkLNc3UxPVMarXVqGs6yKlqyD7CoTay-Ya1AUY5_RDeOFyhqhCeTWSeZypAIFQJiTb9hjyw5u4nzHIobGc2yXriiJwdLHPIL8azTRNmWedkBVcgcs0N_dz8Yj1OkPi0kkBrpGeGYeD3JIYD2EHKOV8j7W7z-xal7NE3er3oOZQnKqaBAmAL9e0ZNsu2Uyzlk0HWaEbNvo46Ghb_1vICbU6lqsxA1U91qcfndddo07saAeoonl-hxU5aK2kjhLISjiTrk8qASwNoBIU3PKUBeCgFop3SBQYcT-yL0yb_81S4vnyMNKSIbGd3-VvZ8pKt8z2-Es0gwlFxOgELIqCQGVndsBV36LbMmTIy2gdB4w9TFd7_0poTvjctWhILUjkCaa0Bh4cviFN9OvSdyQKJ_0VBRDwK7CrHr6MHx7c=&xkcb=SoCM6_M3sjCgVSx7gx0JbzkdCdPP&camk=UoKtGZLa3XLKVw_ok-oaFw==&p=2&fvj=0&vjs=3",
    "description": "Programmer Analyst\nMilton, PA\nThe Central Susquehanna Intermediate Unit (CSIU) is seeking candidates for a full time position as Programmer Analyst. This position is responsible for entry-to-mid level programming changes and entry-level design and analysis for school educational and financial information systems. The Programmer Analyst also updates existing requirements documents.\nSalary: $55,000 - $65,000 full time exempt position following a 260 days per year, 12-month remote work schedule. This opportunity includes excellent benefits including medical, dental, vision insurance; retirement options including Pennsylvania Public School Employees Retirement System (PSERS) and life insurance options.\nThis full-time position follows a regular Monday through Friday (37.5 hours per week) work schedule. Although the position offers the opportunity to telework from home, occasional in-person attendance at the CSIU Main Office, located in Milton, PA, and in-person visits to clients, meetings, and trainings in Pennsylvania will be required. Transportation to the Main Office is the employee’s responsibility. Certain requirements based upon CSIU telework policy and administrative regulations must be met. The CSIU has the right to cancel or suspend the employee teleworking privileges at any time, for any or no reason, due to the requirement of the CSIU and client needs.\nEducation, skills and experience required:\n· An Associate’s degree in Computer Science, Management Information Systems, or related field required. Will consider a high school diploma/General Education Diploma (GED) with completion of a minimum of one (1) year post-secondary education and five (5) years of related work experience. A Bachelor’s degree is preferred.\n· One (1) year of database experience is needed. Structured Query Language (SQL) database experience is preferred.\n· Knowledge and/or experience with Visual Studio, SSMS, and Microsoft .NET Framework is preferred.\n· An understanding of cybersecurity principles and practices is preferred.\n· Adept at using Microsoft Office products (Word and Excel) as well as using virtual meeting platforms, such as Zoom, Skype and Microsoft Teams.\n· Requires complex problem-solving skills to identify problems and reviewing related information to develop and evaluate options and implement solutions.\n· Requires self-starting skills as well as being detail-oriented.\n· Excellent organization and time management skills to coordinate and prioritize the tasks based on project deadlines as several projects can be assigned simultaneously.\n· Must have strong communication skills with the ability to communicate with non-technical team members and/or clients.\n· Must be able to work independently and as part of a team.\n· Ability to maintain positive working relationships with staff members, as communicating customer needs depends on this.\n· Requires the ability to develop and maintain positive and collaborative relationships using tact and diplomacy and to remain calm in unpredictable situations.\n· Excellent verbal communication skills for working with clients.\nApply online at www.csiu.org/jobs and follow the application requirements. In addition, please upload a current cover letter, resume, three (3) letters of professional reference, college transcripts conferring degree(s). Apply by October 1, 2025. EOE.\nJob Type: Full-time\nPay: $55,000.00 - $65,000.00 per year\nBenefits:\nDental insurance\nEmployee assistance program\nFlexible spending account\nHealth insurance\nHealth savings account\nLife insurance\nPaid time off\nProfessional development assistance\nRetirement plan\nTuition reimbursement\nVision insurance\nWork Location: Hybrid remote in Milton, PA 17847"
  },
  {
    "title": "Principal Software Engineer",
    "company": "Liberty Mutual",
    "location": "Boston, MA",
    "salary": "$117,000 - $221,000 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0DepOg7TDxGKZPUDK5aMJwXQn2YTYIL3PVVUU2ENsp1lfsN6FS_mRfuY4z9zWDT3beg3eAWliZjferZ-XMI6iamD1gLW1KcbOM57_i924WnQYrsQfDcKoyWagZx3TpAy0efjS1P-W2_WXAPxMUPFPnEKgM0CCatG_FOmCs8U2wWhAm-o-U1DgRX22PTMLbxl-k8KTdUKQZuQv6OYL2iH2dg4e5UcUWh8Abm6LysZa2r-n9txkktt4bpYNfY74cZlMhLFMgrjTS6g8G7hK7OcoZkmp-v8TopYkW5NxaucNigduC_defebzYgCELrgKUNWQzuOTj7uunErPXSE25OLreZF8XjqOXtYnk2imUdag0CjYt4D4oyMXYBJ4GMJza-pDZI-ykDT6-CDPSxognO7grtxbMQ7m9QFY_O_nLjxjlW1TrvjMmcuu_r-XtpVub_t83x7h6r3wWqP9Vm0VpGSqRu70vcdYlBDjdKwFQjKzsk1i2ywrxSYxIc-gHps8gp0kj6VgZLWrQb4TMgROhOKBfqkLAt9qJwZABehqFCpEyOOMNoKLTWhtw8BrJKwzotuF8_CkjhOfh3A8DO5iILv-DtT-DEYvM3r6lr4pupxrNCPp6EO0RfXg-YtECSSzkDvrGAhVVn0zruI2y_rWw6ojEorjUE_8Z7S4iAnXTPhdA_toZ88gXWph2713IOnC242CFM6V0vz_uD9y_9vrXNVW6HH9u78rmZLjfEzd5LTb2gKz32V6tXYGmk34b03XTpUoCoBHfD2acUqJnl2kxIqkxS-grqqNpvBQjYCMNEOysnpMh2cmbh-SLMWuZQs85ZNS-HqUG94UCCMkESTzU5KmSe1uBSRSaE3S5Ak8cqSHFD6Ai5Tw9Pec2mTLdqN5CQKJQhs4IFSCD5oIi2g6TH5YeUupxTdF55IWr_q_OS7LXRSWZpiB-YjyhstQqYrOkgVvLhcxr6M28uBAHGP2CWl7Di&xkcb=SoAR6_M3sjCgVSx7gx0KbzkdCdPP&camk=H-lBaXMUocKYX73x8uBU6w==&p=1&fvj=0&vjs=3",
    "description": "Description\n\nOur passion for placing the customer at the center of everything we do is driving a transformational shift at Liberty Mutual. Operating as a tech startup within a Fortune 100 company, we are leading a digital disruption that will redefine how people experience insurance.\n\nWe are seeking an experienced Principal Software Engineer to join the GRS Platform Engineering Team to help drive high performance engineering by advising and consulting on public cloud usage for the GRS Tech global environments that focuses on optimizing existing and new environments for cost, performance, and design.\n\nIn this role, you will participate in identifying, developing, and enhancing engineering enabler platforms and tools, reuse patterns, public cloud standardization and lifecycle guidance to help reduce the cognitive load for GRS developers. If you have a robust skill set in delivering AWS and/or Azure public cloud solutions, a passion for problem-solving and an empathetic approach to mentoring and collaborating with a diverse team, we would love to connect with you!\n\nResponsibilities:\nPartner with GRS Tech teams from around the globe to provide guidance and advice to optimize public cloud usage and spend, as well as promote and support the use of Platform Engineering solutions and best practices.\nProvide consultation on cloud architectures to application teams\nPartner with cross-organization team members to help influence and shape the product roadmap.\nDevelop and maintain cloud enablement solutions market-wide across many cloud accounts.\nContribute to and own centrally managed cloud patterns, templates, libraries, and generators.\nLead research and proof-of-concept initiatives to develop creative solutions for engineering enablers, tools and reuse patterns.\nDrive improvement in Agile practices within self-organized team and share ownership of Agile ceremonies with all team members.\nMentor/Coach other engineers to foster their growth and development.\nParticipate in cross team collaborations with other teams in the Engineering and Technology Operations group to share knowledge and promote continuous learning.\nProvide production support as needed.\n\nPreferred Skills:\nExpertise in AWS services and platforms including RDS, Containers, Lambda, EC2, and GitHub Actions CI/CD pipelines.\nExperience with cloud networking concepts including VPCs, Peering, PrivateLink, and security groups\nExpertise in cloud Identity and Access Management concepts, preferably AWS IAM\nExperience with Python, TypeScript, CDK, and CloudFormation technologies, with proven experience building and maintaining cloud-based applications.\n5+ years’ experience delivering highly available enterprise grade applications, including a strong focus on security, monitoring, observability, and production support.\nExperience with the concepts and strategies behind Disaster Recovery (DR)/High Availability (HA) and resilient cloud-based applications\nSkilled in utilizing tools such as Splunk, Datadog, and CloudWatch to extract insights and troubleshoot issues\nExperience in responsibly and effectively using GenAI tooling such as GitHub Copilot\nExperience working in Agile teams with a solid understanding of how to use agile metrics to inform areas of improvement\nExcellent analytical skills as well as communication skills both verbal and written. Skilled at breaking down complex technical concepts and communicating them effectively to diverse audiences, from technical specialists to non-experts, adapting terminology and depth based on the listener's knowledge level\nAWS Associate-level (or higher) certification preferred\nQualifications\nExperience\nEight or more years of software engineering experience\nStrong background in business operations and strategies, including global technology and financial services trends\nHands-on involvement with layered systems architectures, designs and shared software concepts\nFamiliarity with functional and system integration testing\nExperience working in an agile environment\nSkills\nExcellent negotiation, facilitation and consensus-building capabilities\nOpenness and adaptability to respond to fast-moving circumstances\nProficiency in multiple object-oriented programming languages and tools\nExcellent oral and written communication skills\nAptitude for working in teams\nKnowledge\nIn-depth knowledge of diverse and emerging technologies, architectural concepts and principles\nA deep understanding of layered solutions and designs\nAwareness of policies regarding security and privacy\nUnderstanding of backlog tracking, burndown metrics and incremental delivery\nEducation\nA bachelor’s or master’s degree in a technical or business discipline, or equivalent experience\nAbout Us\nPay Philosophy: The typical starting salary range for this role is determined by a number of factors including skills, experience, education, certifications and location. The full salary range for this role reflects the competitive labor market value for all employees in these positions across the national market and provides an opportunity to progress as employees grow and develop within the role. Some roles at Liberty Mutual have a corresponding compensation plan which may include commission and/or bonus earnings at rates that vary based on multiple factors set forth in the compensation plan for the role.\n\nAs a purpose-driven organization, Liberty Mutual is committed to fostering an environment where employees from all backgrounds can build long and meaningful careers. Through strong relationships, comprehensive benefits and continuous learning opportunities, we seek to create an environment where employees can succeed, both professionally and personally.\n\nAt Liberty Mutual, we believe progress happens when people feel secure. By providing protection for the unexpected and delivering it with care, we help people embrace today and confidently pursue tomorrow.\n\nWe are dedicated to fostering an inclusive environment where employees from all backgrounds can build long and meaningful careers. By actively seeking employee feedback and amplifying the voices of our seven Employee Resource Groups (ERGs), which are open to all, we create an environment where every individual can make a meaningful impact so we continue to meet the evolving needs of our customers.\n\nWe value your hard work, integrity and commitment to make things better, and we put people first by offering you benefits that support your life and well-being. To learn more about our benefit offerings please visit: https://LMI.co/Benefits\n\nLiberty Mutual is an equal opportunity employer. We will not tolerate discrimination on the basis of race, color, national origin, sex, sexual orientation, gender identity, religion, age, disability, veteran's status, pregnancy, genetic information or on any basis prohibited by federal, state or local law.\n\nFair Chance Notices\nCalifornia\nLos Angeles Incorporated\nLos Angeles Unincorporated\nPhiladelphia\nSan Francisco"
  },
  {
    "title": "Full Stack Web Developer",
    "company": "American Academy of Sleep Medicine",
    "location": "Hybrid work in Darien, IL 60561",
    "salary": "$95,000 - $105,000 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0DnvFuKM-RdOdTuMsNi2J3H0w3L5YcsbwJoVoWsN2eL-ICWq8BKeo9q4orxu9KL2gLYaCXUrSIWZ-e5YEpf-_l4CDLfKj8aYd-24iQ-ygpbGWuUmh2J0NIZCawYm2AIr4n1ahOJ_vwXPK0Lfc6FdNpmb5L4sOiqkntAIqzg1RzF9eCSkEyy-KciVD7Wft7-xmVcix20-8JNM8HRzFlQ4PC-g66YLm3aHd5ZTJkQ12QYwDn0-T-9U0i8xsZ9OlA2WAt2qrkNHfyY8uTT9sA1IGaudcpS73xGdlHIL6YDoNHS5oz-Nz47m_DlayZcRngTg6tKpLLdcsO0VXN8DVl6HGqQLXPn2UTrCvpksYqXyAjnlGb_1VR90BQbRoFvl5wynxBeBgFJ34PojeKgumGGevAjyK5rhdT5pM7S3IINdnvkQMuPX4ye1iFXRN63rruKRO4n3Vro-9rx6Aevpu6z4c7EXq6Q9lTnB2DAuPUFsDKWuveXpBHQ65sv21kmZ5Fe0WLw0fVdVxoPmti7OsseJ1JZbwqnGzfTvFAAMV6mlWuhz3NuRgZeS4RkmnJ-4H9rCxHRsa5VFJqg2rNqE2vqfIiHTEbndJmyant_IplehKG8UtGEq7FOwq-eoGQoa-1qeDRVPG1Z7_YLmXst3I2b2XlPDf7eJNAWR3TNct3isIzUFe2ZZj-B8Cp0GSbjV94qvTFb89odwvF7H2ejY5gBaMAw&xkcb=SoBf6_M3sjCgVSx7gx0AbzkdCdPP&camk=UoKtGZLa3XLZTQMRhdEstw==&p=11&fvj=0&vjs=3",
    "description": "We are the American Academy of Sleep Medicine (AASM), an innovative professional medical association located in Darien, IL, a southwest suburb of Chicago. Established in 1975, the AASM is the only professional society in the U.S. dedicated exclusively to the medical subspecialty of sleep medicine. Our mission is to advance sleep care and enhance sleep health to improve lives. We represent a combined membership of over 11,000 accredited member sleep centers and individual members, including physicians, scientists, and other healthcare professionals who specialize in the sleep field.\nIn pursuit of improving sleep health and promoting high-quality patient-centered care for all people, the AASM is dedicated to fostering a culture that is committed to excellence, inclusive, flexible, collaborative, appreciative, supportive, and innovative. Our staff connects to these team values in many ways, and we are looking for others who would like to experience the same.\nWe value the benefits of work/life balance through a hybrid work environment. We strongly encourage our employees to work in the office two days a week, with Wednesday as an anchor day to strengthen our collaborative and supportive culture. Managers (with direct reports) are required to work in the office on the anchor day. Office presence for this position will be once a week on Wednesdays for the first month of training and then flexible after that. Generally, twice a year for two consecutive days, all employees report to the office for special staff meetings/functions. As a result, only local candidates will be considered for this position.\nAt the AASM, we get it. To stay ahead of the game, we need to invest time and money in cutting-edge technology. We’re looking for a mid-level Full Stack Web Developer to join our talented team. You will work on exciting projects including the development of major feature additions to our flagship web applications and taking part in the cutting edge advancement of artificial intelligence in sleep medicine.\nSalary Range: $95,000 - $105,000 commensurate with experience.\nA typical day in the life of an AASM developer:\nWrite and maintain code for a range of custom-built web applications and APIs.\nManage and construct queries for SQL databases, ensuring optimal performance and integrity.\nDiagnose and resolve issues with web applications, enhancing user experience and system reliability.\nDevelop and maintain integrations for APIs, Single Sign-On (SSO), and OAuth, ensuring secure and efficient connectivity.\nWork collaboratively with other developers, project managers, and network administrators, contributing to a cohesive team environment.\nConduct code reviews and test the code of other developers, ensuring high standards of quality and consistency.\nWhat we need:\nB.S. in Computer Science (or comparable degree)\n3+ years of programming experience\nStrong skills in Full Stack Web Development including C# or VB, ASP.NET, .NET Core/Framework, Web Forms, MVC, SQL, HTML, JavaScript/TypeScript, CSS.\nExperience with source control tools such as Git or TFS.\nStrong understanding of database design\nExperience in creating and managing RESTful Web APIs and OAuth integrations.\nProficiency in coding responsive web design using media queries or CSS frameworks like Bootstrap.\nAbility to think creatively and develop innovative solutions.\nExcellent written and verbal communication abilities.\nStrong capability to manage and coordinate multiple projects simultaneously.\nCompetence in reading, analyzing, and interpreting technical and business documents.\nAbility to effectively present information and respond to questions from various stakeholders.\nWhat we’d love:\nFrontend framework experience (React, Blazor, or similar)\nMobile Development (.NET MAUI or similar)\nKnowledge of iMIS, HubSpot, Stripe, Azure DevOps, Shopify, OpenAI, Vector Databases, and/or Microsoft Azure.\nThe AASM is proud to be an Equal Employment Opportunity employer and a recipient of the 2025 Best Workplaces in Illinois award. We celebrate diversity and are committed to creating an inclusive environment for all employees. Aside from the great job opportunity, we offer a collaborative and fun work culture with amazing benefits. Visit https://aasm.org/about/working-at-aasm/ for a glimpse of AASM work life.\nAffordable medical & dental coverage for you and your family\nFree life & disability insurance\n3 weeks of PTO (personal/vacation/sick time) plus paid company holidays\n8 weeks PAID parental leave\nFlex-time hours\nBusiness casual environment\nGenerous 401(k) plan\nFlexible spending & dependent care accounts\nHealth savings account with generous employer contributions\nProfessional development assistance\nPet insurance\nTheft ID coverage\nDiscounted fitness membership\nDoor Dash meal perks\nService recognition and peer-to-peer platform with reward points redeemable for gift cards or charitable donations\nWeekly “Wellness Wednesdays” with walk, stretch, and healthy snack breaks\nTwice daily “plank breaks”\nSeasonal staff events\nJob Type: Full-time\nPay: $95,000.00 - $105,000.00 per year\nBenefits:\n401(k)\n401(k) matching\nDental insurance\nEmployee assistance program\nFlexible schedule\nFlexible spending account\nHealth insurance\nLife insurance\nPaid time off\nParental leave\nProfessional development assistance\nReferral program\nVision insurance\nWork Location: In person"
  },
  {
    "title": "Senior Golang Software Engineer",
    "company": "Credit Acceptance",
    "location": "Remote",
    "salary": "$130,047 - $190,736 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0AsbktAG5_d7zZpvjjXSmUmcD4iMcRvongZk4cc4SyVxl1iNPhZYD-Wv7IpeTcySjP7pxtOeeoyzWvkqWLIx4qcsf0J2s_tzWVnxbLfywHYguLi_gStuaBe5lGE7Ai7_vU9hcQsfA1J6lZFe1ohjZ4HCYMW2A7uG1bxyi8Ek_Xo7BYIa5r8pHcQayi_poSuYFOeGGmR8Rf7RdcndYaFIBpj28IxHA8VBjRMO6at2xgAiluT1qMVc21nVoIO3AW1qDyETJIPP9Eu__4ULrcjngD7AIANbu3BloFEQE-uzxc9MB4FEhMfdRTmg1_dghZ6_VLeeiChckeShu0kk6XqhGpXXIVoegB9XRjkReAtZCnklPdxyh0B25sG0dkiRkNtYfHyV_Tq6Z0qf6L9AAZt6illgik3DxwbWId2_V_mgu0nXuhC3B59Bsnxg0sR8KjcXsfmwhOziQ38_23bbXzeHQZ52AXrYSagPp72BsWxOcVmtgh_AOWdjIA6_905fJu-gGx6uX6t6e3jTja03Cqrwg7S4ReFnsw7uG1RMkbGsP9sggtOdgYStZVQnOMLOCNHdzbNqbYh6st1l1wThshnIyhaO7kWvgK_0DiwFQ2DICKGcOTv-EdhazIENYaaNhlNFFXDPlD2pdbHTw-5usZYd6mCuYz2n_KXbqA1LLc1uOo2g_q-ksejlR_gJfVgFFhl8kK7cI8Kmhbbi03W3huGmPN51I6fIGDEEsenVNGn2DLAxA==&xkcb=SoAr6_M3sjCgVSx7gx0MbzkdCdPP&camk=4HOcmqOLYrBXgGRMyqxztw==&p=7&fvj=0&vjs=3",
    "description": "Credit Acceptance is proud to be an award-winning company with local and national workplace recognition in multiple categories! Our world-class culture is shaped by dedicated Team Members who share a drive to succeed as professionals and together as a company. A great product, amazing people and our stable financial history have made us one of the largest used car finance companies nationally.\nOur Engineering and Analytics Team Members utilize the latest technology to develop, monitor, and maintain complex practices that help optimize our success. Our Team Members value being challenged, are encouraged to express their ideas, and have the flexibility to enjoy work life balance. We build intrinsic value by partnering with all functions of our business to support their success and make strategic business decisions. We focus on professional development and continuous improvement while enjoying a casual work environment and Great Place to Work culture!\nWe are seeking a highly driven and innovative Senior Software Engineer to take ownership of end-to-end solutions, drive innovation, and deliver exceptional results. The ideal candidate is a self-starter with strong technical expertise, a collaborative mindset, and a passion for continuous improvement.\nOutcomes and Activities:\nDesign and develop software and improve existing code to make it more efficient to detect bugs in the code\nWrite unit-tests and validate your software against acceptance criteria\nAuthor, apply and advocate for team coding, documenting and testing standards\nConduct impact analysis to proactively identify impact of a change across multiple applications\nLearn the business process domain to better support the business\nExperiment and test ideas, validate assumptions against needs, reach conclusions and recommend solutions\nLead code reviews and communicate application changes\nDocument code and projects so others can easily understand, maintain and support\nDebug the problems which arise in production and propose effective solutions within the application and across multiple applications\nRead, write and review design documents\nContribute to team's sprint commitments and actively participate in our Agile practices\nLead continuous learning activities to improve design and code quality as well as to increase application domain knowledge\nParticipate in the talent selection process\nGuide and review the code, designs and documentation of less experienced software engineers\nCompetencies: The following items detail how you will be successful in this role.\nCustomer Empathy: Customer Empathy is the ability to understand the perspectives, pain points, and experiences of customers. It involves actively putting oneself in the customer’s shoes, comprehending their needs and challenges, and using that understanding to provide a better, more customer-centric experience.\nEngineering Excellence: Engineering Excellence is about bringing great craftsmanship and thought leadership to deliver an outstanding product that delights customers and solves for the business. This involves the pursuit and achievement of high standards, best practices, innovation, and superior solutions.\nOne Team: A One Team mindset refers to a collaborative approach across the organization, where individuals work together seamlessly, without boundaries, as a single, cohesive team. Shared goals, open communication and mutual support create a sense of collective purpose. This enables teams to navigate challenges and pursue shared objectives more effectively.\nOwner’s Mindset: Owner’s Mindset involves adopting a set of behaviors that reflect a sense of responsibility, accountability, strategic thinking, and a proactive approach to managing your domain. As an owner, you understand the business and your domain(s) deeply and solve for the right outcome for the domain(s) and the business.\nRequirements\nBachelor’s degree in Computer Science, Information Systems, or a related field—or equivalent practical experience.\n5+ years of professional software development experience\nStrong proficiency in Golang and Java and solid object-oriented programming skills.\nPractical experience in Software Development Life Cycle (SDLC) including Agile/SCRUM and Waterfall\nPractical experience in data modeling, design and messaging\nExperience working on mission-critical enterprise class applications\nProven experience designing, building, and scaling high-load microservices and APIs using modern architectural principles and design patterns.\nProven track record of leading feature development from requirements and documentation to implementation and production rollout, while coordinating effectively across teams.\nStrong communication and collaboration skills, especially in working closely with product management to translate requirements into scalable solutions.\nComfortable working autonomously while coordinating effectively with peers and technical leadership.\nWillingness to participate in an on-call rotation and support production systems as needed.\nDemonstrated ability to coach and mentor less experienced team members.\nPreferred Qualifications\nMaster’s degree in Computer Science or a related field.\nProficiency in Go (Golang) or experience with other high-performance languages like Kotlin, Rust, C#, C++ or similar.\nExperience transitioning systems from monolithic to microservice architectures.\nStrong database tuning and query optimization skills for both PostgreSQL and Oracle.\nFamiliarity with CI/CD pipelines, containerization (Docker, Kubernetes), and infrastructure tools like Terraform or CloudFormation.\nExperience with observability tools (e.g., Datadog, Dynatrace, Prometheus) and understanding of SRE best practices.\nKnowledge and Skills:\nAbility to challenge the status quo and influence stakeholders to create innovative solutions\nBe collaborative with other team members, seeking a diversity of thought to meet business outcomes\nBring a strong understanding of relevant and emerging technologies, provide input and coach team members and embed learning and innovation in the day-to-day\nAbility to communicate complex technical information (both verbal and written) to all levels, including senior leadership\nTarget Compensation: A competitive base salary range from $130,047 - $190,736. This position is eligible for an annual variable cash bonus, between 7.5 - 15%. Final compensation within the range is influenced by many factors including role-specific skills, depth and experience level, industry background, relevant education and certifications.\nCandidates who reside in the following major metropolitan areas may be eligible for a premium on top of the posted range based on their specific zone: San Francisco, Seattle, Boston, New York City, Los Angeles and San Diego.\n\nINDENGLP\n#zip\n#LI-Remote\nBenefits\nExcellent benefits package that includes 401(K) match, adoption assistance, parental leave, tuition reimbursement, comprehensive medical/ dental/vision and many nonstandard benefits that make us a Great Place to Work\nOur Company Values:\nTo be successful in this role, Team Members need to be:\nPositive by maintaining resiliency and focusing on solutions\nRespectful by collaborating and actively listening\nInsightful by cultivating innovation, accumulating business and role specific knowledge, demonstrating self-awareness and making quality decisions\nDirect by effectively communicating and conveying courage\nEarnest by taking accountability, applying feedback and effectively planning and priority setting\nExpectations:\nRemain compliant with our policies processes and legal guidelines\nAll other duties as assigned\nAttendance as required by department\nAdvice !\nWe understand that your career search may look different than others. Our hiring team wants to make sure that this would be a fit not just for us, but for you long term. If you are actively looking or starting to explore new opportunities, send us your application!\nP.S .\nWe have great details around our stats, success, history and more. We’re proud of our culture and are happy to share why – let’s talk!\nRequired degrees must have been earned at institutions of Higher Education which are accredited by the Council for Higher Education Accreditation or equivalent.\nCredit Acceptance is dedicated to providing a safe and inclusive working environment for all. As part of our Culture of Compliance, we are proud to be an Equal Opportunity Employer and value our culturally diverse workforce. All qualified applicants will receive consideration for employment regardless of the person’s age, race, color, religion, sex, gender, sexual orientation, gender identity, national origin, veteran or disability status, criminal history, or any other legally protected characteristic.\nCalifornia Residents: Please click here for the California Consumer Privacy Act (CCPA) notice regarding the personal information Credit Acceptance may collect from you."
  },
  {
    "title": "Mid-Level Software Developer",
    "company": "Leidos",
    "location": "Bethesda, MD 20889",
    "salary": "$85,150 - $153,925 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0CZUO70VSdYKA8PR3jfrSh5ljhqJhfDt0PzQCMubt8cRmvypw7oDpSFoKSlg7BUk5hszmB60YQ2LOj1hYhiBpPZTvrhdhvplSrzGeu2agleJbv33y8jrBRWNkJQb_C7Ziadpg_hYzcWjxapVizPVVWlhooYLYYVmTy7szt4SSyou__INdYQdWq_Hz4sA50YIaJaH8Svihv4yMmvUGh2UpVnTuHAl-sjJgdIBmHM-Rv7Nuf1ns-PaYqNo8FdNM0enJrkF03MTYmWpqTh52aWMLAiVfutUbkDh0Ud5uuPSMQSpmk6a8EEzC2ZOhcZORa8QURUVE8cYJ_joLJoqrySC5Gv0h-x9CUea15Ko_-iBui7SLVzrEf15oiX0lqtx4JQ_1zXUxERpaefE04QxUs1GKyKfahc9oirLgz-0gDhBEiEMcuQyEBGbxRLfPXWFJmaz-loOrWqRJ6OWhUcqUMcoRs-frU8_J4unFYHwGMcP52D9JlR5bs2fMMsKKlYOIVfNXPubLsAJUQ5MabxAPplFn6xn-5sOBb7PSQvHkmOfMHYg8pLZ9MxEDssIZIiH03YwTkpTk5mRR1ahph2WFyZRlJao0eSbe8drSdIp73lOEAn3H_YxgP-8v5rN43hadFCV8AtyPdd7dAj2I0eIWlYM14uR4YoYU5hKi3ft5cGiPaMluh-Zgv01C228Pslt49yfO59KFjm7TZx6pzebKfjwH6jatLh-bks4Zvm7hdVxgJn-sMgbKoW8LYH&xkcb=SoBl6_M3sjCgVSx7gx0GbzkdCdPP&camk=ethIe0s0heeQhnZOR7c6Ig==&p=13&fvj=0&vjs=3",
    "description": "Description\nJoin Our Innovative Team at Leidos!\nJob Description: Jr Software Developer\nReady to break away from the ordinary and dive into an extraordinary career? At Leidos' High Fidelity Simulation Business Area, we’re not just building systems—we’re revolutionizing the future of naval simulation, training, and analysis for the US Navy. Imagine being part of a team where your work directly redefines naval capabilities. That’s the Leidos experience.\nWhy You’ll Love Working Here\nForget the cookie-cutter corporate gig. Here, every day is a new adventure. You’ll be at the cutting edge, working with state-of-the-art tech to shape naval training systems like CIAT - Combined Integrated Air and Missile Defense (IAMD) and Anti-Submarine Warfare (ASW) Trainer. As a Software Engineer, you’ll develop real-time software on Linux using C++ and Java, diving deep into all phases of the development process, using the best available tools and modern architectures.\nYour Impact\nYour work won’t just sit on a shelf. It’ll be front and center, shaping the trajectory of naval operations. Plus, you’ll get the chance to travel to strategic locations like Pearl Harbor, San Diego, and Norfolk, immersing yourself in the real-world impact of your creations.\nWe’re Looking for Innovators Like You\nHave an advanced degree or continuing education in computer science? Maybe you have a knack for advanced math or physics? Perfect. If you’re a whiz with cluster computing, signal processing, Kubernetes, numerical simulation, multi-threading, GPUs, data visualization, underwater acoustic modeling, or sonar systems, you’re exactly who we need.\nWhat’s in It for You?\nStability & Growth: Join one of the longest-running Leidos contracts, spanning over 30 years. Enjoy extensive career mobility and professional growth.\nFlexibility: Early bird or night owl? Work the hours that suit you, whether starting at 5 am or wrapping up at 4 am.\nImpactful Work: Engage in meaningful projects with systems going into production within six months. Your work matters here.\nOvertime Compensation: Any hours worked beyond the standard 40-hour workweek are compensated at straight time rates.\nRequired Education & Experience\nEducation: B.S./B.A. in Computer Science or equivalent experience.\nCitizenship: U.S. Citizenship and eligibility for a U.S. Government granted security clearance. Interim Secret security clearance required for employment.\nSkills: 4+ years of C++ software development, strong Linux tools/library knowledge, and a solid grasp of software engineering principles.\nDesired Experience\nEducation: Advanced degree, continuing education in computer science, or advanced math/physics background.\nSkills: Experience in cluster computing, signal processing, Kubernetes, numerical simulation, multi-threading, GPUs, data visualization, underwater acoustic modeling, and sonar systems.\nTools: Familiarity with Agile development, Atlassian products, and DevSecOps methods/tools (Gitlab, Conan, Jenkins, Docker).\nJoin Us at Leidos\nReady to make waves in your career? At Leidos, we don’t just offer jobs—we offer a chance to drive innovation and make a tangible difference. Be part of something bigger. Join Leidos and embark on a career that’s anything but traditional.\nIf you're looking for comfort, keep scrolling. At Leidos, we outthink, outbuild, and outpace the status quo — because the mission demands it. We're not hiring followers. We're recruiting the ones who disrupt, provoke, and refuse to fail. Step 10 is ancient history. We're already at step 30 — and moving faster than anyone else dares.\nOriginal Posting:\nSeptember 30, 2025\n\nFor U.S. Positions: While subject to change based on business needs, Leidos reasonably anticipates that this job requisition will remain open for at least 3 days with an anticipated close date of no earlier than 3 days after the original posting date as listed above.\n\nPay Range:\nPay Range $85,150.00 - $153,925.00\nThe Leidos pay range for this job level is a general guideline only and not a guarantee of compensation or salary. Additional factors considered in extending an offer include (but are not limited to) responsibilities of the job, education, experience, knowledge, skills, and abilities, as well as internal equity, alignment with market data, applicable bargaining agreement (if any), or other law."
  },
  {
    "title": "Experienced Full-stack Developer (C#, SQL, ASP.NET Core, Blazor) - On site, no remote",
    "company": "SmartAdvocate",
    "location": "Melville, NY 11747",
    "salary": "$90,000 - $150,000 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0DJahHSWP86OfQJR0UEKLk1T408OfjM5syBm1alShyZhpVdRcfqWDqFglXHAH0iZb3vjJ76z49pHIlauscOFdyDpGjcogkq0AODCPhocnWAn8AbdYnFnMhwDZ55DX2_vCK17bSwFGUDFFDa9YBjDEtIUxALipvYuBnOs2K3PVVPLsNbMmQ9WZh6J3vJPZLv-LMHJ2ekKDf6XJN_JcdQ9tt5Vb8S7a3jJ3OevrzlKd6Btvc8a8rN3UzCW-yUEyAy1lsdNvft_Q3jvMiSG_5TmLdvJZxPbTQr1Q00lH7zfFAKYbhk1MaMyeOfTVKl-g0ILSrOZT5nYPyVo1cQ28MXGTYvmLLWmZwiwVRaWSkdPt9Bpz9FpHbvRtvKbDY7brWLIy8Co_UDYG0QvUAf_C43AOFBiUMLTYAExTz3xNcPwuxC3D6yaq5QigTls1pPTKh3ReGbVW9Z95vU-wIpWcfCe-BfkqzVo4T7wb1VNliGgPaAusZJ3Lbn_tNIAsdyiM0ZiMH5YcWEfkqN6YXzwYLkpru8yoCMhP_Ryy4Xj0LdagEwt5DJjtpWi9u9oeGD87Jvm36nxuSwnzRyz2LvqYUN0Xy4Ud9GgpNbVjGO9MT5WgNPInxzeMNHFlZKAUzCF2JgVBqBpWquT2bd3EHjtrebhQphGweVhrJKEam48XVReWXSCkfMZYqworDo1ZzUKtw-JUgfjL8vi0K5PTchvBkXDJTwpLz93mPwqF8=&xkcb=SoC26_M3sjCgVSx7gx0PbzkdCdPP&camk=UoKtGZLa3XJjyZnknkvgLw==&p=4&fvj=0&vjs=3",
    "description": "About SmartAdvocate®\nSmartAdvocate® is a leading legal case management application. Conceptualized by the founding partner of a prominent personal injury law firm, SmartAdvocate® is offered as either a cloud-based or self-hosted application. Legal professionals use SmartAdvocate to manage pre-litigation and litigation cases including contacts, communications, case data, documents, document scanning and filing, document creation, calendaring, and more.\nWe’re looking for a skilled developer to join our team and contribute to an Accounting project integral to our platform.\nResponsibilities\nAs a Full Stack Developer at SmartAdvocate®, you will:\nCollaborate with cross-functional teams to design and develop software solutions tailored to client needs.\nBuild and maintain robust, scalable, and high-performance web applications using C#, ASP.NET Core, and SQL Server.\nDevelop REST APIs with ASP.NET Core for seamless integrations.\nImplement and enhance Blazor components (Server and WebAssembly) for modern UI experiences.\nIntegrate third-party services and APIs to enhance application functionality.\nEnsure code quality by participating in reviews, writing clean, maintainable code, and following best practices.\nTroubleshoot and resolve software defects and performance issues promptly.\nStay up to date with evolving technologies to keep our software at the forefront of the industry.\nRequired Skills and Qualifications\n3+ years of professional experience with C# and .NET Core.\nStrong proficiency in REST API development with ASP.NET Core.\nHands-on experience with Blazor (Server and WebAssembly).\nExpertise in SQL Server including database schema design, ADO.NET, and Entity Framework Core.\nSolid understanding of Dependency Injection and software design principles.\nFamiliarity with version control systems (e.g., Git) and CI/CD pipelines.\nExcellent problem-solving skills, attention to detail, and a collaborative mindset.\nNice-to-Have Skills\nExperience with DevExpress components.\nKnowledge of other front-end technologies (HTML, CSS, JavaScript) or frameworks.\nFamiliarity with legal case management systems such as SmartAdvocate, Needles, TrialWorks, Filevine, Litify, or Time Matters.\nBenefits & Work Environment\nSmartAdvocate® is a dynamic, rapidly growing company focused on helping organizations thrive. We offer:\nCompetitive compensation and benefits package.\nMedical insurance.\nPaid time off.\n401(k) Plan.\nA safe, healthy, and collaborative working environment.\nEqual opportunity employment.\nJob Type: Full-time\nPay: $90,000.00 - $150,000.00 per year\nBenefits:\n401(k)\n401(k) matching\nDental insurance\nHealth insurance\nLife insurance\nPaid time off\nVision insurance\nAbility to Commute:\nMelville, NY 11747 (Required)\nAbility to Relocate:\nMelville, NY 11747: Relocate before starting work (Required)\nWork Location: In person"
  },
  {
    "title": "Software Developer (Data & AI Engineer)",
    "company": "Washington Metropolitan Area Transit Authority",
    "location": "Washington, DC 20024 \n(Southwest Federal Center area)",
    "salary": "Full-time",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0Cvv68pjbPa1PHwRCTDblEsgpIqu8mdJOOUPZKf7xzDNq6cQvjSYfKUbJ5RAQdhWReLOXqcE21_ngjZYBTIYFOVsU2hU9-cual7o2ZxM898ux0zLfSTcs0k7iyIDMMvxThn3lHGlzFl6K2sttTAXeZuZpF6zxz1hhNHT-Ig36tf04tzctxDsJY9JBbbJ9i8VSw9UgcBnxUC4c5Qag8iVcU6C4z7nBVKHg0qNiIYw_GJD5d55POpAiToEHAzhIH2hmUonLHxdlksftLFsodcOxwRHLYSWFA0uA_fK9dz4j-d0OLK0ez2jCIp-dECjp5fyhmyJeRxhJ0nw0gnqAkZYNXtnqMB9ZXVV6_16xXReaSnxOvvWUlVaKQR6L3xeoaoT20Xw1FSoKmie5bssPyrHWs0pkH11IlvjzJuYaai617YKp-Dsy6aTQXVpNMQ9SbKdw9DUfHnLbku_Qo69GKSsp6aOOScq3byNEkEl5zu50u-Jd4Q43FsctshaPtJoygZyuYRbG9Zu8yMmQiXrzHuAxnpyVPz6WrghemAVU5N1cKiODnIhzpYuLQoaplfj30x68XRsOv2ACAdX2rPxZnFOVrJH822hkk0qswmJ9qSQ1INMcdUE7MQ0vDGT-tyRNVLYJHaa6U-jpZwVlw6U_21458Aa6C641lTUh8pYp4U4rHaEjDdh6TVjQ7zmPNb3sCowQ7-AtCwJKyVRMgVkCeVrBqanHIBrgLsfrKpSVeEH_ifULCFHPX55FFjuquBRpJCzJfeXB31RnQrFguTEfpb41wcvz2_F1bTZAY=&xkcb=SoAC6_M3sjCgVSx7gx0ObzkdCdPP&camk=CPChkbYSGj__kIGVUpzBuA==&p=5&fvj=0&vjs=3",
    "description": "Job Description\n\nDepartment Marketing Statement:\nWMATA is hiring two experienced Software Developers to join our Enterprise Applications team ¿ one focused on Data Engineering and the other on AI Engineering to help drive innovation across the organization.\nData Engineer will bring hands-on experience with Oracle Cloud Infrastructure (OCI), Azure, including Autonomous Data Warehouse, Data Integration, and Lakehouse architecture, to build scalable data pipelines that support enterprise analytics.\nAI Engineer will have a strong foundation in machine learning, deep learning, and NLP, with experience deploying models using modern frameworks (such as TensorFlow or Hugging Face) and MLOps practices on cloud platforms.\n\nIf you're passionate about building impactful, enterprise-grade solutions using cloud, data, and AI technologies, we want to hear from you.\nMinimum Qualifications\nMinimum Education\nGraduation from an accredited college or university with a Bachelor's Degree in Mathematics, Computer Science, Engineering or related field.\nIn lieu of degree, a high school diploma or GED and additional four (4) years of experience in progressively responsible and diversified information systems, communication systems management and technical experience in a large organization.\nMinimum Experience\nFive (5) yearsof experience in progressively responsible and diversified information systems, communication systems management and technical experience in a large organization.\nMinimum Certification/Licensure\nN/A\nPreferred Qualifications\nExperience in design, development and maintenance of operational applications preferably includingresponsibilities as seniortechnical staff and project managerand as senior technical staff and project manager is preferred.\nMedical Group\nSatisfactorily complete the medical examination for this position, if required. The incumbent must be able to perform the essential functions of this position either with or without reasonable accommodations.\nSummary\nThe Software Developer is responsible for resolving the most complex application system problems within Digital Modernization. The incumbent plans, leads, coordinates, and participates in the design, development, quality assurance, installation, testing, and maintenance of assigned software/hardware systems to achieve project objectives and minimize the real-time operational impact of changes on current and developing application systems. The Developer ensures that established system functionality, reliability, performance and availability are maintained throughout the system development cycle, from initial inception through implementation and routine monitoring. The incumbent serves as functional area task leader and may serveas project leaderon complex systemsor technical task forces by planning, assigning, scheduling. They may monitor contractor performance for effectiveness in meeting objectives and solving problems, as well as coordinating projects within Digital Modernization. The Developer is responsible for one or more application projects to include identification and resolution of technical problems. The incumbent has considerable latitude for independent technical and professional judgment within approved plans and established guidelines.\nEssential Functions\nPrincipalJob Duties\nProvides technical leadership and/or specialized technical assistance in problem-solving and application systems development.\nProvides expert assistance in assigned criticalsystems areas withinthe department.\nDevelops, enhances and maintains applications and integrations withinDigital Modernization's portfolio\nPrepares concise reportssuitable for all levels of management regarding projects and technical issues within assigned areas of responsibility.\nPerforms assignments using a full complement of software engineering skills such as requirements specification, system design,software development, qualityassurance, documentation, and testing.\nFunctions as project engineer for system configuration management plan, with assigned responsibilityand is designated as the prime pointof contact. Responsible for the maintenance and execution of project configuration version control when making changes to existing application software or designing new software.\nIs responsible for being on call during\"off\" hours and must respondto emergency outageseither via telephone, email, or in person and assists on-site staff until normal operations are resumed.\nProvides technical leadership and/or specialized technicalassistance in problemsolving and application systems development.\nIs responsible for a high level of operational performance and software reliability within major application systems throughout Digital Modernization.\nDevelops, reviews and updates varioussystems or softwareas required, in compliance with WMATA Standards and Criteria and Standard Specifications with industry standards, best industry practices, and current or future WMATA practices.\nDevelops and reviewsother department technical specifications and task orders for procurement of hardware, software, test equipment and services.\nPerforms failure analysisand prepares reportsincluding root causeand recommended corrective action for stakeholders and management. Evaluates and provide guidanceon system changesto determine feasibility, alternative solutions, and back out procedures.\nWorks closely with end usersto understand theirinformation requirements and to directresolution of their problems.\nMaintains up-to date supportrequests and projectwork plans. Preparesstatus reports to compare progress with work plans.\nAdvises supervisory staff concerning system modifications and applications system deficiencies, end user requirements, and computer hardware,and recommends softwaresupport, work method and practice improvements.\nWorks variable hours to avoid adverse impact on operations and availability.\nOther Duties\nMaintains and promotesawareness and accountability with safety policiesand procedures while performing job functions. Promotes a positive safety culture and encourages reporting of safety consistent with our Agency SafetyPlan, other regulatory requirements within the Safety Management System and just culture principles.\nThe functions listed are not intended to limit specific duties and responsibilities of any particular position. Nor is it intended to limit in any way the right of managers and supervisors to assign, direct and control the work of employees under their supervision.\nEvaluation Criteria\nConsideration will be given to applicants whose resumes demonstrate the required education and experience. Applicants should include all relevant education and work experience.\nEvaluation criteria may include one or more of the following:\n¿ Skills and/or behavioral assessment\n¿ Personal interview\n¿ Verification of education and experience (including certifications and licenses)\n¿ Criminal Background Check (a criminal conviction is not an automatic bar to employment)\n¿ Medical examination including a drug and alcohol screening (for safety sensitive positions)\n¿ Review of a current motor vehicle report\nClosing\nWMATA is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, status as a protected veteran, or any other status protected by applicable federal law.\nThis posting is an announcement of a vacant position under recruitment. It is not intended to replace the official job description. Job descriptions are available upon confirmation of an interview."
  },
  {
    "title": "Machine Learning Engineer",
    "company": "Edison Welding Institute Inc",
    "location": "Buffalo, NY 14211 \n(Grider area)",
    "salary": "$85,000 - $120,000 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0ADHDVjEfsdcfJKmuq_eAGE74sJSVkMxBxgW86bODLpAEe_gNVvp0jWk9kSptJN3Z7ioTx4KDpNEyA3bMi34r6BqjRzj0BDwVzYSnEkDS7riTeV9UpyE_Ba3KzrCdlj1r5wxQyBCqM_iHzDZ5DqQtyWFbBF4-9xsvdieQQ4CWXE8wfPykOzwVpDbefrpqVczntNz82lyZCbscDCnsqmBjxkEBdcpJ3cBLjKTXaZ7Gz9RIIVB4Qbe0IJS2OoCqcdN5bfvAI2oJonU_mvPc89o4RWzetQxcZvDv5ssgrlU3IJcytklC503HKkE2oh7qtj7gGNikwJ9sqkzOWOJ7jwIDBPQqYZsDz-kGJ325HkTLLs1CQXTXqd7JeCVXOZv1NWa-NZD8bRoxNuryYLzIDJ8kaSHF9vF45Q4700TTaQ8OgH5XriUDe41wX1Rt0SLl_5ev7BAePuIo461FUn6oW7SvKTx3URgMU5DIYBxb9RO9CBEsvWqxPlDklh2QmDdVkeqLmXEt9MD0OFWRxdRHfm3OIdDfxM5JxUrsf_gmuYS24hsO-zrfWKbiUTr58B9BW-poMv3JqVoQ8ClZqIX-YupFaZmaXoTdsBtnuiVW5iZs3eLmGC891x_Bcs1lBzKUeZV-9lkvUGtRBd3tApxdzMmVrVfDfjo8PfHeg21rQtsqiBB3WwzXBSUUgpspjFvT2wRrzDRu6u2g413z7JYQIifw0Tu8dPQanDWYb7259ShG3rkY36vDSYsqBQPKLtvmLhtyraEvbccYPWowazyHwUrNK-92C5AhenCWSM5WSU6iYiG-b2TLdWUNM6yhe9FpyE_Mnr7obHc1my56ZXk5Cy5UFTrPkYBosUGAkcgP-V88HBHy_6nztKPglA&xkcb=SoCf6_M3sjCgVSx7gx0NbzkdCdPP&camk=UoKtGZLa3XKqRBQhAw55ww==&p=6&fvj=0&vjs=3",
    "description": "EWI is a world leader in developing and deploying new technologies that enable companies to bridge the gap between R&D and manufacturing implementation. EWI associates are passionate about identifying out-of-the-box options that provide a long-term competitive advantage for our clients. Our clients tell us we are a valuable extension and complement to their innovation, engineering, and manufacturing teams. If you enjoy dealing with customers and solving difficult, technical problems, EWI is the place for you.\nEWI’s Data science group acts as turbo charger for EWI’s innovation engine. We specialize in working cross-disciplinary with EWI’s cutting-edge manufacturing technology teams including additive manufacturing (3D printing), advanced stamping, robotics, ultrasonics, and lasers. Data science focuses include the industrial internet of things (IIOT), using in-line sensing to predict part quality, semi-analytical modeling, probabilistic modeling, and data modeling. For the Machine Learning Engineer role, we are searching for expertise, practical experience, and visionary thinking in manufacturing data science. Our customers are based across the country and include world-class leaders in the aerospace, automotive, consumer products, electronics, medical, energy & chemical, government, and heavy manufacturing industries.\nThe Machine Learning Engineer position is located at Buffalo Manufacturing Works, operated by EWI – a one-of-kind center for advanced manufacturing focused on developing, maturing and implementing new technologies that have an impact on the clients we work with and the communities in which they live. Located in Buffalo, New York, we are dedicated to building a nationally-recognized hub of manufacturing innovation and are looking for smart, passionate, entrepreneurial, inventive and driven people to help us achieve this goal.\nWork on projects such as these:\nLithium Ion Battery Quality Control: https://www.spiedigitallibrary.org/conference-proceedings-of-spie/11591/115910I/Investigation-of-monitoring-methods-for-ultrasonic-metal-welding/10.1117/12.2583121.short\nComputed Tomography Algorithm Development: https://patentimages.storage.googleapis.com/5c/81/0c/9b7e0b34fbc450/US10969771.pdf\nSmart Forming: https://www.mdpi.com/2076-3417/11/20/9530\nProbabilistic Qualification: https://link.springer.com/article/10.1007/s11837-021-04770-3\nICME: https://www.sciencedirect.com/science/article/pii/S2214860423002889\nWe are currently looking to add a data scientist to our collaborative team of researchers.\nESSENTIAL FUNCTIONS:\nCollaborate with world-leading manufacturing process experts to understand manufacturing challenges in areas such as\nArc welding\nAdditive manufacturing (3D printing)\nRobotics\nUltrasonics\nLasers\nIdentify potential solutions that could bring clear value to manufacturers\nDevelop code to automate data acquisition, management, and analytics\nCreate frontends to expose models to process experts\nOrganize data so that it is findable, accessible, interoperable, and reusable\nDevelop, apply, iterate, and test analytics\nPresent results to stakeholders\nEstablish thought leadership through conference presentations, peer reviewed publications, patents, and marketing pieces\nKNOWLEDGE/SKILLS/ABILITIES:\nThe candidate must have all of the following general skills:\nExtensive experience in Python\nModerate experience in web development (e.g., React, TypeScript, HTML, CSS)\nBackend development tools such as FastAPI and/or Flask\nExperience with SQL\nVersion control, unit/integration testing, and code review\nContainerization with Docker\nExperience with Kubernetes preferred\nPrevious work on large codebases highly preferred\nExperience testing and applying a range of ML/AI approaches\nAbility to interface with manufacturing process experts\nProficient in MS Office products (Word, Excel, PowerPoint, etc.)\nDue to the nature of this work supporting federal contracts, sole US citizenship is required\nEDUCATION:\nB.S. in Computer Science, Statistics, Applied Mathematics, Physics, or similar discipline\nPhD is preferred\nEXPORT CONTROLS - This position requires access to information and technology that is subject to U.S. export controls. To conform to U.S. export control regulations, applicant should be eligible for any required authorizations from the U.S. Government.\nEOE/M/F/Disability/Protected Veteran Status\nAccommodations\nIndividuals who need reasonable accommodations under the ADA in order to participate in the search and/or application process should contact Human Resources at (614) 688-5000."
  },
  {
    "title": "Application Engineer - II",
    "company": "Vanguard",
    "location": "Malvern, PA",
    "salary": "",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0BWQs_M7ZA8XLbIFWVw-PYcVVEPryqVLyWhKaEKPskHy2YkbHyHJDwB5vIJ0eSmX6YpM92vIy3RuMqqa1FyVIpV9-5jvDdDiNJdy499yUVCeAgM0IaIZj4RRjkUtmj2xk3CeWopOGmZxmE5CGr34Az5pjiHGN9rnZt4l43U1ctSl2evM7IEX6wv0UIu-4lF9QXhRw4jM8i5iYvy9leq9UkgsHwfJ-fCUoUA9Nl0SmvRw2G8TTNvUtpATwUx8APluL1DDkNDmhCD-U36oMoujBygQthbFoVEcX5UIwTSJk52CUHTeFeh1tlS2D7R29Vb5XQZ6Z-0dJfh0u6JBzg1SXqIuX7-t4b0Grk-iS2Gw3klhZFwRJmppRRZf28RmJR6aqZyWTAHKxzjyBkrOsI4XHACdNeYqRS12uDis9vt5XhA_JiBveqiV2CXsP0J1fo8NTogBM-Sg7YLdMstqkuZrxZzIAwRxtuI_TFTR6dyfrPhIGIWJ3Tsge22AKpfBL3rAjIr9NgeBagW8Lu_uaQnWa_0GoB7XqBi3UAaRyVfVVlrNPnri9AMud7w5YMIKFOXv-F_ooVWbFk-AV35nxcHQ2YN4aQ1En_oXrfyWHZN-8D3zlmJKWqrB-RBJ0VueJmN_xRRp2_AYsnQ1okg22KbIXW4yDOIOzAMrE96aCTiB7cGc-kDHnD7Fdw6L3iRsOtgjjFSAjR1D-yVprL_urlEcQ72g04iTvFsVMaxYl6z3MW_fjnXgeZ516DwYQHtn0BU6PQr-7v0Hgq8D6klXnbU_vN1TyWkCfj2IcKsrfwtnetSFeIh0uA8IG50qVsQt0QWgkTwNMr3DEkqAshxLKp6pCUVIKCeTIynj91U3YeAS1BaD0dAE2n9tR7TnAnddAsUQALelkOuUG1At-9K8Kd1PvcNZOzM1AH7vdZtvILCg40SeFzdcOSescen-PaZe-DLq4dnRRxT1eE29ypaK8fF4WZFW-lRb2rbuepWOjTSkW12cYp9yevFTkizFukPzuZMoR8K-TsxMU_9uRnkLZA4Ym8rc7wfYVlesJsG8YYQbcQBNeSzNZ4WJt9w47VYVZxwN9l387_w_av7M0ifdmZY2Y_wSV8ej8WE2pwVJEFMsDj5r99wJdtcQTAeaCvfFvYTuen37qRowAo3Yv-KEc0WHlrGWxEz8UAeJSxrQMbLcCTU1umWHSWTa-plf4_R-iHzFxnQw_sCy1y0I0U0j2sccKcYf6fLmEhFkBVIsJdqx--48FoH_z7YZFM6ORkclqKxNiZy-rsVIy8Lng==&xkcb=SoD46_M3sjCgVSx7gx0FbzkdCdPP&camk=G42KULXkIwNaEmQcdlbbiw==&p=14&fvj=0&vjs=3",
    "description": "We are seeking a passionate and skilled Application Engineer - II to join our Full Stack Modernization Team. This team is leading the charge in transforming the Plan Sponsor experience through innovative, greenfield application development and cutting-edge technologies. We are specifically looking for an experienced UI developer who is eager to further hone their skills and be an integral part of our modernization journey.\nKey Responsibilities:\nDevelop and maintain front-end applications using Angular and TypeScript\nCollaborate with cross-functional teams to design and implement scalable, high-performance solutions\nParticipate in system analysis, design, development, and implementation of applications and databases\nContribute to back-end development using Java and Node.js\nWork within AWS environments and leverage CI/CD pipelines using GitHub\nEnsure code quality through automated testing and continuous integration practices\nStay current with emerging technologies and frameworks\nRequired Qualifications:\nMinimum of two years related work experience in frontend development\nProficiency in Angular, TypeScript, HTML 5, CSS 3, NodeJS\nStrong experience with Angular and TypeScript\nUnderstanding of front-end design patterns or Architecture\nFamiliarity with Java, Node.js, and AWS\nAbility to work independently under general supervision\nExcellent problem-solving and communication skills\nSpecial Factors\nSponsorship\nVanguard is not offering visa sponsorship for this position.\nAbout Vanguard\nAt Vanguard, we don't just have a mission—we're on a mission.\nTo work for the long-term financial wellbeing of our clients. To lead through product and services that transform our clients' lives. To learn and develop our skills as individuals and as a team. From Malvern to Melbourne, our mission drives us forward and inspires us to be our best.\nHow We Work\nVanguard has implemented a hybrid working model for the majority of our crew members, designed to capture the benefits of enhanced flexibility while enabling in-person learning, collaboration, and connection. We believe our mission-driven and highly collaborative culture is a critical enabler to support long-term client outcomes and enrich the employee experience."
  },
  {
    "title": "",
    "company": "",
    "location": "",
    "salary": "",
    "url": "https://www.indeed.com/viewjob?jk=890abcdef0123456",
    "description": "None"
  },
  {
    "title": "Software Engineer",
    "company": "Teltrium",
    "location": "Greenbelt, MD 20770",
    "salary": "$100,141.40 - $120,600.39 a year",
    "url": "https://www.indeed.com/rc/clk?jk=74365ea13f1e2a57&bb=z8J32LtRmvoH46VceviI_hEDWVmiRtW8Ukr6_3QUKj_GDT_C0jmXEijnDURE3D_wvxuv7pX378NZYMDblC1tK3Uz6b-QrpnX4yrsn1OfM8imOdqCtvJ61nb6bhhAhpAYKtIGzWiSs6nd5D9k1OcBYQ%3D%3D&xkcb=SoA567M3sjC8xDR7gx0KbzkdCdPP&fccid=201abf303c4886b0&cmp=Teltrium&ti=Software+Engineer&vjs=3",
    "description": "www.teltrium.com\nSoftware Engineer - NASA Projects\nTeltrium is a technical services company that provides systems engineering and project execution support and capabilities to satellite communications and spectrum management technology programs for NASA and other customers.\nWe are seeking Software Engineers to join our growing team. This position is responsible for bringing software engineering expertise to assist in accelerating and improving systems engineering and modeling and simulation capabilities at NASA Headquarters and other NASA centers. An enthusiasm for space science and exploration is preferred.\nThe core responsibilities include (but are not limited to):\nDesign and development of custom tools to support customer needs including back-end analytical processing and front-end GUI development\nDatabase development and maintenance\nDocumenting architecture and design\nThe selected candidate will have the opportunity to take ownership of development projects—with significant input into the choice of technologies used for said projects—and will both collaborate with other software developers as well as support engineers with modeling, and analysis software.\nQualifications\nEducation: Bachelor of Science in Computer Science, Computer Engineering, or related field\nYears of Experience: 2-5 years of experience in a relevant professional field\nWork Authorization: Candidates must be a U.S. Citizen or Permanent Resident.\nRole / Work Schedule\nThis is a full-time, on-site position at our Greenbelt, MD office.\nPreferred Skills\nSelf-starter and creative problem solver with the ability to meet strict deadlines\nAble to quickly and independently learn new programming languages, libraries, and frameworks\nFamiliar with full-stack web development\nReact, Typescript and Node experience a plus\nFamiliar with code optimization techniques, including parallelization\nExperience with Machine Learning and AI techniques a plus\nConfident with Git for collaborative version control\nComfortable with Unix-like development environments\nExperience with Atlassian product suite preferred\nStrong organizational skills and attention to details\nExcellent verbal and written skills including articulating and presenting technical topics in a clear and concise manner to peers as well as executive level customer audiences\nJob Type: Full-time\nPay: $100,141.40 - $120,600.39 per year\nBenefits:\n401(k)\nDental insurance\nFree parking\nHealth insurance\nVision insurance\nApplication Question(s):\nDo you have a bachelor's degree in software engineering or a comparable field?\nEducation:\nBachelor's (Preferred)\nExperience:\nSoftware Engineering: 1 year (Required)\nLocation:\nGreenbelt, MD 20770 (Preferred)\nAbility to Commute:\nGreenbelt, MD 20770 (Required)\nWork Location: In person"
  },
  {
    "title": "Lead Software Engineer, Mobile Solutions Engineering & Operations- Project Hire",
    "company": "Universal Orlando",
    "location": "Orlando, FL",
    "salary": "",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0A8dBNt2Xi2s2VyZMdbOlonzlm4bxv48OGaZczYzhjJpk3FxPQbd_G7kvoFbAWLVNcVatHXwXIGKSzwaVyhXN0oGIxZd2Z1GedBuFuGedZZucV7YgeDF3Ymn9-pThJ3j5cy6994AAh0hkAGZGERZ5AY9KqGpAUzmVNSu5u9jK9Xrr7o2Al4diRxNj9t8RGRzrEmx6QFuFRfonHFGQE8OOiZRU6-nQsUlCBJM06MMxVJnfY8mOmRNIbUGNrKxOG3n7dCGaFuhtU8IftOPONUTADbdlM4KvbW5KWjGyXh8XIW1PXG7juOUGtMiIJ4DUZ5poD7QOi8A8ZLo6XKCmyxg4bpEGYkB9devHa3a2Wsp6gG0mEpJXZeVKvwXnl8sSc98iLfegdk4D-tQM4Vqa4zE-FGGo6UL1T6Xou1NiLHPskMFGjqPhgrfdqE0fQCMj1bmniwOgtqogtuUOxsnEE3DUdOsJ0cgBDu-IDnZNB26fCf6d-F3e3Q2b4VmPezyorchj6JgxG7qvhSZR8ogYB2krRxWexVu2PlzV54TDoDCPhpYnOK-IeeXBqcc3EH5ZtTlXJcrQIyAZoifTG09qlgVvfLvKRdR9y--3Ou01qeaL65eeoDzy9czoKAgT4zLcYRlHUojDE_ErgZWtzAyLYDSIw2NEdCt6u4aDzFjAvN3vOKefBshgoF13iVg5_dF8N9whTM8LEAkuiZ4rcq-CyVFk8GxkIIVOhXMtCSk3mTH4SZjPq4xcs1LwW6GjEfUfb8U_jQgoDuk49u84-6H05iDztv6OZKS5g_u6VvwKCI9R22DBaiOJX9KER9rhlAyNyRhZtTM79Gcuwh-ZXbIy23yibQpaSedBPfsxl5LrG_Vv8ZHW7gM4Msj3EtjiuUb42IjLvelY9CoYPM69O_Lu94TU5s5gjZne6EodX61CTakxSE9C6_F2egunqL1UYruH02JHPjZ_pqjI-J4S9aJR0Dk2l98fetecwjzHysq9ktQw-TLtiKotoiW9LqFC_6LW-oEAjs_UyTf_8X6CeF-FQYZAbv-L9aEAMbuSCfx7XxP8A-f9poYH489cqfFMXjOar1534xUqJrT5nMHPlvPHYHqDg_G3WLZaRCkpSZeby_upZhB2kifc7YzA-_M0fTMFsDex7v5mXezcp0u7orJS_fjgj0F_2Cy0NJt83McwKuDsRouhlDMDWeSqrAUmeo2GvP8lOP61wjSfGo-1DihqQrSnJeHXqie-1FVcMozfNoJiun4Aflqi7RYdppzgZWt51Oqq-7Em9Ll1ijELAzUo3zurnzg_TKsjzIbrdiYS-SpmUkmiE-ORsPHW796lkyElis5ASZV2k6Nh_n73Wy9P2zEopd5kCxisPi9Dt87FvbNP9ubzh_6g60ed72DvGVONBWgr7Lg-dwO0s0yoYWQv72FjDjqQKHas-k_i_eWwPO012MfR7ESxQwfdxt53gC5y6apAVyXIU8SylZMg==&xkcb=SoCD6_M3sjC8xDR7gx0AbzkdCdPP&camk=nUmJqO2E8rjRsfc1gIeQcA==&p=11&fvj=0&vjs=3",
    "description": "JOB SUMMARY:\nThe Lead Software Engineer will have a unique opportunity to utilize Flutter as a cross-platform language to build large mobile applications and experiences in support of our theme parks. This role will work with our mobile team to design and build the next generation of our mobile applications that will be leveraged across our parks and venues around the world. The Lead Software Engineer will work closely with other app development and technical teams. The role will provide highly specialized skills and knowledge that will enable the successful design, code, and delivery of complex solutions for Digital Technology in support of business requirements. This includes writing, coding, testing, analyzing, and supporting complex codebases along with configuration management of new Flutter applications. The Lead Software Engineer will also research, design, document, and modify Flutter specifications throughout the life cycle of our applications.\nMAJOR RESPONSIBILITIES:\nDesign & Development - Where applicable, architect, design/develop, and oversee implementation of mobile solutions. Be a mobile domain expert for development teams as part of implementation. Influence strategic direction and deliver the ‘art of the possible’ for improvements and/or alternatives. Review and provide guidance on new and existing solutions designed and delivered by Architects with an eye for compliance, industry standards and mobile best practices. Interface and coordinate tasks with internal and external technical resources. Collaborate with Project Managers, vendors and IT stakeholders to provision estimates and develop overall implementation plan for installation, customization, and integration efforts.\nStrategy & Planning - Act as a strategist for the mobile domain. Assist, design and implement long-term strategic goals for mobile technologies and capabilities. Provide mobile expertise, and direction to delivery teams, DevOps engineers, and architects. Conduct research on emerging technologies in support of systems development efforts and recommend technologies that will increase cost effectiveness and systems flexibility. Provide technical assessments for new work efforts. Lead creation and documentation of formalized mobile development methodologies. Build and maintain repository for deliverables.\nTechnical Collaboration - Confer with delivery teams, product team, or management to refine business requirements and collaborate on technical designs and resolve technical issues. Participate and actively engage with other developers, architects, and domain experts.\nUnderstands and actively participates in Environmental, Health & Safety responsibilities by following established UO policy, procedures, training and team member involvement activities.\nPerforms other duties as assigned.\nEDUCATION:\nBachelor’s Degree or equivalent in Computer Science, Computer Engineering, or related subject.\nEXPERIENCE:\n7+ years of software experience.\nExtensive hands-on experience with business requirements gathering/analysis.\nStrong analytical and problem-solving skills, including a thorough understanding of how to interpret customer business needs and translate them into practical applications and operational solutions.\nA solid background in software development with the ability to be a hands-on coder and knowledge of APIs and SDKs.\nProven experience in system design and development.\nStrong understanding of information processing principles and practices.\nStrong knowledge of software evaluation principles and practices.\nGood knowledge of applicable data privacy practices and laws.\nExpert knowledge of mobile languages and design patterns including but not limited to Flutter, Dart, MVC, and MVVM.\nStrong knowledge of Flutter’s plugin ecosystem, BLoC,CMS Driven Widget Design, Atomic Design, Widget Trees, and other Flutter UI concepts.\nProficient with Git, Git flow and other branching strategies.\nProficiency in multi-threading.\nExperience mentoring a team of other engineers.\nExperience with pull requests and performing code reviews.\nExperience with RESTful APIs using JSON.\nExperience designing application architecture.\nExperience creating frameworks and integrating external SDK’s.\nExperience with localization within a Flutter application.\nExperience working on a development team that practices Agile/scrum methodologies.\nFamiliarity with continuous integration tools.\nSolid architecture, analytic, design and problem-solving skills.\nExcellent verbal and written communication.\nAbility to understand and maintain existing complex codebases.\nPassionate about mobile technologies and building great guest experiences.\nAptitude to work as change agent that believes in a continuous improvement approach.\nComprehensive understanding of software development lifecycle (SDLC), continuous integration, agile software development methodologies, values, and procedures.\nStrong experience in mobile architecture documentation skills.\nExcellence in communication with the ability to communicate complicated technical design ideas to a range of people from developers to executives.\nStrong experience with reverse proxies, web servers, API gateways, service-oriented architectures, web services (REST), microservice patterns, service buses and integration patterns, security practices, database technologies;\nor equivalent combination of education and experience.\nADDITIONAL INFORMATION:\nExperience leading global enterprise engineering projects or teams is a plus. A self-starter with the ability to manage a broad workload and accommodate change with a proven ability to deliver results.\nThe Lead Software Engineer will understand vision, communicate possibilities of technology solutions along with roadmaps to achieving the results. The Lead Software Engineer will work closely with application owners and solution architects to design integrations with a focus on security, performance, reliability, reusability, scalability, and maintainability. The Lead Software Engineer will also build an in-depth technical knowledge of Universal’s global portfolio of systems and platforms and act as a subject matter expert for architects, delivery teams and support teams. The Lead Software Engineer will be a subject matter expert across mobile platforms and will influence the technical direction the mobile organization is driving to and will possess excellent communication and collaboration skills.\nYour talent, skills and experience will be rewarded with a competitive compensation package.\nUniversal is not accepting unsolicited assistance from search firms for this employment opportunity. All resumes submitted by search firms to any employee at Universal Orlando via-email, the Internet or in any form and/or method without a valid written Statement of Work in place for this position from Universal Orlando HR/Recruitment will be deemed the sole property of Universal Orlando. No fee will be paid in the event the candidate is hired by Universal Orlando as a result of the referral or through other means.\nUniversal Orlando Resort. Here you can.\nUniversal Orlando is an equal opportunity employer. Universal elements and all related indicia TM & © 2025 Universal Studios. All rights reserved. EOE"
  },
  {
    "title": "Backend Engineer (PHP)",
    "company": "All Cares",
    "location": "Remote in Maine",
    "salary": "Full-time",
    "url": "https://www.indeed.com/rc/clk?jk=c883489b46a0d262&bb=z8J32LtRmvoH46VceviI_n3DLEd4WaiKCVKsKUHfDKREyeZ-gydNOKX-9_Vk_YY31kuLJyq1AEfx3eSRAH3FY5II7zGCLSqCNJi_gVqeyrXrbMvHJ8n0it7xkipRTthzBSeY8oOVdpdFqYPN70FSvg%3D%3D&xkcb=SoAq67M3sjC8xDR7gx0ObzkdCdPP&fccid=914ca86337ac5bb5&vjs=3",
    "description": "We empower businesses in the financial ecosystem with cutting-edge white-label and SAAS solutions.\nOur comprehensive suite of tools is tailored for EMI, PSP, e-commerce, and open banking platforms. With us, clients gain access to a platform designed for flexibility, scalability, and seamless integration.\nOur mission is to help businesses unlock their full potential in a rapidly evolving financial landscape.\nWhether scaling your PSP, enhancing your EMI services, or diving into open banking,\nWe are a remote-first technology company and welcome applications from candidates across Europe, including the EEA, the UK, Switzerland, and other non-EEA European countries such as Ukraine, Moldova, Georgia, Armenia, Montenegro, Turkey, and the Western Balkans. We also consider applicants from different locations who can work within Central European Time (CET).\nYour role and impact:\nIn your role, you'll be at the heart of our mission to revolutionize payments worldwide. Your expertise will be critical in analysing data, processes, and code to identify, resolve or prevent issues and drive product improvements. You will contribute to developing a secure, well-tested and high-performing product, setting new standards in the fintech industry.\nYour key responsibilities will include:\nDesigning, developing, testing, documenting, releasing and supporting software from scratch.\nEnhancing and refining our existing API and backend systems.\nIntegrating third-party solutions to broaden our payment ecosystem (acquirer, gateway, alternative payment methods, token platforms, systems for verification/scoring/monitoring of customer operations, reporting, etc.).\nRunning tests to make sure everything works as it should and setting up a testing environment for checking new features.\nFixing existing bugs and debugging the developed software.\nPreparing necessary technical documentation.\nProvide support for the implemented software in production\nCollaborating with the front-end developers and other team members to complete all of the above tasks in the most efficient way.\nThis role is about improving our products and solving problems, so we're looking for someone with excellent troubleshooting skills, curiosity for innovations and unconventional solutions.\nWhat makes you stand out:\nUnderstanding object-oriented programming and its application in PHP.\nKnowledge of security threats and security measures in PHP, including protection against SQL injections, XSS attacks, CSRF.\nExperience writing and executing tests, including unit tests, integration tests, and failure tests.\nGood knowledge of syntax, language structure, data types, operators.\nDeep understanding of OOP.\nProficient use of core Symfony.\nPractical experience with Doctrine ORM.\nExperience with PHPUnit.\nProficient in data manipulations (basic CRUD operations) using SQL, Postgresql.\nUnderstanding of basic Docker, Kubernetes.\nUnderstanding of the basic concepts and benefits of Continuous Integration (CI) and Continuous Deployment/Delivery (CD) processes.\nTheoretical SOLID, GoF design patterns, GRASP knowledge.\nHands-on experience with Domain-Driven Design in designing and developing complex PHP applications (must-have).\nUnderstanding the basic principles of CQRS.\nUnderstanding the concept of integration tests and how they differ from other types of testing, such as unit testing and functional testing.\nUnderstanding of the basic concepts of Event Sourcing, including events, aggregates, projections and event streams.\nUnderstanding of basic microservices concepts, such as dividing functionality into small, independent services and communicating between them via APIs.\nUnderstanding of the basic functionality of Jenkins, the quality of software assembly, testing and deployment.\nGood knowledge of traditional monolithic architectures and Microservices Architecture, as well as Hexagonal Architecture's emphasis on separation of concerns.\nFull SDLC cycle.\nStrong understanding and practice of Agile Development Methodology and its SCRUM and KANBAN frameworks.\nBonus points for:\nExperience with Elasticsearch, Redis\nExperience with Gitlab CI/CD\nUnderstanding of or working experience with Event Sourcing\nExperience with nginx, shell\nOpenAPI (swagger-php)\nUML,TDD\nAgile/Scrum experience\nOur recruitment process typically follows these stages:\nApplication screening\nInterview Stages (2-3 weeks):\nPrescreening call (40 min)\nTechnical Interview (60 min)\nSoft Skills Interview (40 min)\nJob Offer\nReferrals: Employment and Background Check\nWe offer:\nCompetitive compensation package (commensurate with your experience)\nAccess to paid corporate English lessons (through Preply)\n19 business days of flexible Paid Time Off (PTO)\nFully remote work with flexible hours (within the CET time zone) from any location of your choice\nValues-driven culture with a friendly and supportive work environment\nOpportunity to regularly participate in conferences and community events as both a participant and contributor\nMatrix organizational structure designed to streamline communication, remove barriers, and promote efficiency\nEmbrace the opportunity to develop your skills in a cutting-edge fintech environment.\nPlease apply now to be part of our dynamic team and make a tangible impact on the future of payments!\nLet's build something great together!"
  },
  {
    "title": "Backend Engineer",
    "company": "Stemuli",
    "location": "Hybrid work in Dallas, TX 75201",
    "salary": "Up to $160,000 a year",
    "url": "https://www.indeed.com/rc/clk?jk=625b35672f20d4a4&bb=z8J32LtRmvoH46VceviI_uI3DbDlz8jYsyT4B4WrMBWecpF6qv76smO6awIi3JDTvFcUZbNOWDVDhSrOxNaWBRWFYSutqisxgMggLH8puP0ECI-qbacnTigKtA72KuQhnhzRg5Jk9NATe3nYZ3Pkuw%3D%3D&xkcb=SoC367M3sjC8xDR7gx0NbzkdCdPP&fccid=6d2e96ee9a232a6e&vjs=3",
    "description": "Note: If the above video doesn't vibe with you, stop reading. If changing the world and entire sectors does interest you, please continue. We're excited to meet you.\nCompany Overview:\nStemuli is a pioneering technology company at the intersection of AI, workforce development, and gaming. We're backed by the Gates Foundation, Google, Tim Draper, National Science Foundation; and recently named the 2024 Global Champion of AI For Good, the U.N.'s platform on AI. Our mission is to make education and workforce development personalized and accessible to billions of people while helping them navigate intellectually and economically fulfilling careers.\nPosition Overview: Join Stemuli as a Backend Engineer in the AI team and help transform education with advanced AI. As an early team member, you're key in driving the mission to empower millions through innovative AI and gaming tech. Build the critical bridges between Unity-powered 3D experiences and our generative AI to create scalable, engaging educational tools that engage and motivate students. Our customers expect us to scale to 100ks of learners, soon. Backend execution is central to our ability to deliver at that pace. Your solutions will directly impact learners from elementary school to career, opening doors to economic mobility and lifelong learning. Shape the future of learning technology in this high-growth, high-impact role.\nResponsibilities:\nDevelop and scale robust systems and databases that power scalable, engaging educational tools\nStand up centralized databases for AI and research use\nCollaborate with backend engineers across the company to ensure our AI innovations integrate flawlessly into our educational products\nWhat We're Searching For:\nDeep expertise on the trade-offs and principles of database design and management (e.g., PostgreSQL vs MongoDB).\nExperienced (3+ years) in backend development, with strong skills in Python and database technologies.\nFamiliar with RESTful API design and implementation, Postman.\nStrong problem-solving skills and a collaborative mindset. You must be comfortable with a mix of short-term tasks and long-term projects.\nPassion for building the systems needed to revolutionize education: making education highly engaging, extremely effective, available to all.\nStrong foundation in algorithms, data structures, and software design principles (CS, related undergrad, or equivalent experience)\nTech Stack and Approach:\nWe live in a Python world where possible. There are a couple of existing backend systems for Stemuli products, one example is MongoDB in Google Cloud. You will build interfaces with them.\nThere's a series of external APIs and interfaces our systems will need to plug into, including ones may not be immediately familiar in design (LTI launches in an Edtech setting).\nSome of our data ingestion involves using WebDriver to grab simple screen scrapes (with permission!) You'll find good ways to iterate beyond that, parsing and storing media in an efficient manner.\nYou will define the databases/backend for AI team use (curate data for model training and data science needs). We will work with you, but this is yours to lead.\nWe emphasize practical solutions, iteration, and using the right tool for the job. Mantra: “If it can be done with an if statement, we use an if statement”\nA large part of our long-term AI advantage will come from how we combine unique proprietary datasets. We care a lot about data curation, and have a wide variety of sources to draw upon. You will be key to this!\nWhat We Offer:\nA mission-driven culture led by an inspirational founder, where you'll work alongside passionate experts to make a global impact on education through AI\nOpportunity to be a part of the first power brand in Future of Work x Education.\nHybrid work environment (2-5 days/week in our Seattle office, which is home base for our AI team).\nCompetitive salary range of up to $160,000, with meaningful equity.\nComprehensive benefits package.\nIf you're passionate about transforming education through AI and gaming technology, even if you don't meet every qualification, we encourage you to apply. Stemuli is an equal-opportunity employer committed to creating an inclusive environment for all employees."
  },
  {
    "title": "Principal Software Control Engineer - Hybrid (Indianapolis - Relocation Available)",
    "company": "Rolls-Royce",
    "location": "Hybrid work in Idaho Falls, ID",
    "salary": "$113,179 - $183,916 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0BpoqgxHRNBTpjENCZWzXT09bDa6sxOE5CBwUS8NyAt6-_QzxoUoVQIFKfwgSkMPvPLTru7MI6aDBK3tEth6wAnBujNT4zehaIR5MxUfFp6QKizN3mxlxfkPyqSDSgfArUiGmhGHN49o47vYK0ZuHRMCtOIi6qYwycnxwd877y4VA0V5q7tw-GuMVTYDFguteqxRDKmywMAeu-EVVFY5CbI8uP5RpwaU34HPTB76r_t1ghP-hjK_C68TiNanI5fzZcM7seEGoMuN1odMTvuCeWhWHUM2wzO6KDDN3rqAV6gy2IdJQmbgLDKUE4vIuvgfn185qLIHfoCCPwL7bPzoesQHq_zyS5wz7G8QmbiMeUbKfrcLI0V7yTMIxalgMuZ3w_EtrTM3_bzIK8hCQf5OtwopG-1Gv2NA8u0zyiBIS1QzKvDxM-qjOZU5XVy9n1CzpUZSxIudWu61yM4aedRDZQd-xX9Rw_nBDYqc6tvk3L5tRICEDwwrsMWC53xvdbIQVG2llmgUAqLcM9SdLdQtLXyps-XDKkSdIL-gH_qc_xVqXltIEMn-9NHaHLcps3GHwxUk2NN3Lz2BGBHYj25wP7Du9OlIimUMXXiiWqbz33r61yaCLsSH1mSbkEHNMhcLiTd042FGp2PFMHQS2N7SYTZZTdSBr8iXqjJuycpmCWSKggwkgl_Goa8P_-nYqSknDESlAkWHFINy1U899ZNV_zI6c4FCOn6jHRbBAfUyAQC4O9o4y43-5dDgW032qLCYTbsY7MLtw1-PzB_Ezc-IA-FN0i5y3uPwKc=&xkcb=SoCq6_M3sjC8xDR7gx0CbzkdCdPP&camk=UoKtGZLa3XK3jTek42sIQA==&p=9&fvj=0&vjs=3",
    "description": "Job Description\nJob Title: Principal Software Control Engineer\nWorking Pattern: Full-time\nWorking location: Indianapolis, IN/Novi, MI/ West Lafayette, IN\n*Relocation assistance is available for this position.\nRolls-Royce is looking for a Principal Software Control Engineer to join our growing team. In our team as a Principal Software Control Engineer, you will develop, write, test and document embedded code for safety critical electronic engine control and monitoring systems.\nYou may be involved at any stage of a project lifecycle from concept development, integrated/component testing through final production release. You'll usually work in project teams with colleagues in other branches of engineering.\n***This position is eligible for a hybrid work schedule allowing for remote and in-office work based on location. Hybrid work arrangements are subject to change based on business needs and/or changes in company policy. All hybrid employees must have a secure, high-speed internet connection and an appropriate workspace that complies with applicable information security and confidentiality requirements.\nWhy Rolls-Royce?\nRolls-Royce is one of the most enduring and iconic brands in the world and has been at the forefront of innovation for over a century. We design, build and service systems that provide critical power to customers where safety and reliability are paramount.\nWe are proud to be a force for progress, powering, protecting and connecting people everywhere.\nWe want to ensure that the excellence and ingenuity that has shaped our history continues into our future and we need people like you to come and join us on this journey.\nRolls-Royce has been recognized as the top employer in the Engineering & Manufacturing category on the prestigious Forbes Top Employers for Engineers list for 2025. This ranking highlights our commitment to innovation, employee development, and fostering a collaborative environment where engineers can thrive.\nBe part of a team that sets the industry standard and drives groundbreaking solutions.\nAt Rolls-Royce, we are committed to creating a workplace where all employees feel respected, supported, and empowered to do their best work. We foster a welcoming and innovative work environment that invests in you, giving you access to an incredible breadth and depth of opportunities where you can grow your career and make a difference.\nRolls-Royce is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to any protected characteristics.\nWhat you will be doing\nWith this attractive opportunity you will get a chance to:\nCollaborate with other teams and customers to develop safety-critical software on programs utilizing model-based and code-centric software design\nWork with a cross-functional team to establish the highest standards of technical capability, quality, professionalism, and teamwork\nDevelop high integrity control systems for gas turbine engine applications\nPrepare and review engineering work products supporting internal and external stakeholder reviews\nLiaison with certification airworthiness authorities to explain approaches, demonstrate compliance to objectives, and close out audit findings\nResolve complex problems through the application of acquired technical experience and knowledge\nDevelop and communicate complex technical ideas and information in a concise and logical way\nWho we’re looking for:\nAt Rolls-Royce we put safety first, do the right thing, keep it simple and make a difference. These principles form the behaviours that guide us and are an essential component of our assessment process. They are the fundamental qualities that we seek for all roles.\nHighly Qualified Candidates Will Possess:\nGas Turbine experience\nExperience with developing safety-critical software\nExperience in C/C++, MATLAB Simulink, or similar\nExperience developing logic for closed-loop systems\nExperience with embedded software design\nModel-based system engineering\nBasic Requirements:\nBachelor’s degree in Aerospace, Mechanical, Electrical or Computer Engineering, or Computer Science with 5+ years of product development engineering experience, OR\nMaster’s degree in in Aerospace, Mechanical, Electrical or Computer Engineering with 3+ years of product development engineering experience, OR\nPhD in degree in in Aerospace, Electrical, Mechanical or Computer Engineering\nIn order to be eligible for consideration, you must be a U.S. Citizen\nWhat we offer:\nWe offer excellent development opportunities, a competitive salary, and exceptional benefits. These include bonus, employee support assistance and employee discounts.\nYour needs are as unique as you are. Hybrid working is a way in which our people can balance their time between the office, home, or another remote location. It’s a locally managed and flexed informal discretionary arrangement. As a minimum we’re all expected to attend the workplace for collaboration and other specific reasons, on average three days per week.\nFor fully remote roles, employees can live in any state except Idaho, Nebraska, Nevada, Vermont, and Wyoming.\nPay Range: Novi salary range $121,523 - 197,475/ Indianapolis salary range $113,179-$183,916-Annually\nLocation: Novi, MI or Indianapolis, IN\nBenefits:\nRolls-Royce provides a comprehensive and competitive Total Rewards package that includes base pay and a discretionary bonus plan. Eligible employees may have the opportunity to enroll in other benefits, including health, dental, vision, disability, life and accidental death & dismemberment insurance; a flexible spending account; a health savings account; a 401(k) retirement savings plan with a company match; Employee Assistance Program; Paid Time Off; certain paid holidays; paid parental and family care leave; tuition reimbursement; and a long-term incentive plan. The options available to an employee may vary depending on eligibility factors such as date of hire, employment type, and the applicability of collective bargaining agreements.\nJob Type: Full-time\nPay: $113,179.00 - $183,916.00 per year\nBenefits:\n401(k)\nDental insurance\nEmployee assistance program\nFlexible spending account\nHealth insurance\nHealth savings account\nPaid time off\nParental leave\nRelocation assistance\nRetirement plan\nTuition reimbursement\nVision insurance\nWork Location: In person"
  },
  {
    "title": "Full Stack Engineer (All Levels)",
    "company": "Virtue AI",
    "location": "San Francisco, CA",
    "salary": "Full-time",
    "url": "https://www.indeed.com/rc/clk?jk=5ebe6fabbc9c4ddc&bb=z8J32LtRmvoH46VceviI_lT8zU1q0CCgaVWh7JNLmbRO20FRd-3AOjPzIGJWe79Ad5O5Xdb0er9UkWCAXvAgLSgJ3zYU-r3VlQPiOitf9Uhmr2_UEmempHYSlXmQtd5JIhu7nCkKFFHKpSpf5RRglQ%3D%3D&xkcb=SoAQ67M3sjC8xDR7gx0IbzkdCdPP&fccid=dd616958bd9ddc12&vjs=3",
    "description": "Location: San Francisco, CA (Onsite | Remote)\n\nAbout VirtueAI\nVirtue AI is at the forefront of AI security. As enterprises increasingly adopt Large Language Models, the need for robust, trustworthy, and safe AI has never been greater. Our mission is to build the essential guardrails and red-teaming tools that enable organizations to deploy multi-modal AI applications confidently and responsibly.\nWe are a well-funded, early-stage startup founded by industry veterans, and we're looking for passionate builders to join our core team.\nAre you a high-performing, motivated engineer ready to make a significant impact in the AI security space? Virtue AI is seeking talented AI Platform Engineer to join us. We are a fast-paced, customer-focused company with cutting-edge technology, strong early customer traction, and market dominance. If you thrive in an environment that values hard work, collaboration, and technical curiosity, we want to hear from you.\nThe Role\nAs a Full Stack Engineer at Virtue AI, you will take ownership of end-to-end product features — designing backend APIs, building intuitive UIs, and ensuring secure, performant, and enterprise-ready delivery. You’ll work closely with ML engineers and designers to create customer-facing dashboards, evaluation interfaces, and developer tools that make our AI safety technology accessible and actionable.\nThis is a high-impact role for an engineer who loves working across the stack and delivering polished experiences without sacrificing technical depth.\nKey Responsibilities\nOwn full-stack feature development, from backend APIs to frontend UI.\nDesign and build developer-friendly dashboards and evaluation tools for guardrails and red-teaming.\nCollaborate with backend engineers on scalable service APIs and data pipelines.\nImplement modern, performant, and accessible UIs using React (and related libraries).\nEnsure secure, multi-tenant, enterprise-ready delivery across SaaS and on-prem deployments.\nContribute to CI/CD pipelines, testing frameworks, and automated quality checks.\nWork closely with product and design to translate customer needs into reliable, intuitive software.\nQualifications\nStrong programming experience in Python (backend) and TypeScript/React (frontend).\nExperience building APIs and services with frameworks like FastAPI, Flask, or Django.\nFamiliarity with SQL and relational databases (e.g., Postgres).\nStrong understanding of frontend engineering practices (state management, testing, accessibility).\nHands-on experience with containerized deployments (Docker, Kubernetes).\nComfort in fast-moving startup environments with a bias toward impact and collaboration.\nBonus:\nExperience with enterprise SaaS delivery (RBAC, multi-tenancy, SSO/OIDC).\nFamiliarity with ML or data visualization frameworks (e.g., Recharts, D3, Plotly).\nExposure to security-sensitive or compliance-heavy environments."
  },
  {
    "title": "Junior Software Engineer (Java)",
    "company": "Ecco Select",
    "location": "Leawood, KS 66211",
    "salary": "$70,000 - $77,000 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0DRfFzM7uMv8wS8zMNw-xbUYsw4uujLTahDhCJEHO4KcLN8rEFXkXA0yk_xBh_km5JQtHnLXQCcE_T0VLfC4zz4ens4r77mZTHJc6-tdaYRj-wKClFhO11J0k0O0VLraQ4ExaCbEaE80-jtJQJIn82ZzOe3FhDWCQaeYBtFk6qQ8U7OomYkg9u-R3DYMicwsA297sHd-IaKHAeRujgFpnqw6-NyTLE_KyAdExYoKWuFDJPYWq1x4XlBXnRGVh5DGJi1f_D9Whrptkty8KqWiOvXFLUZjqPJ4lr8iw8ewYHe9foLujzf9-EIIuuf609SQsp0hslE1Awoo8V3hgVdxq4QLZiIDX0bawEq6aHyOKKTvSKGppqvkAhDrTl_GE-lLA3dfKi08bD0VxZkC6lyK7Ap5ftqyq8MZCJCLrdN3LitvWaq-9uYPQiPwTlD367tWwNpgM7pfE3INXjg6Ug5LkETUxRdK0rYKlC0nbLgQNIrs-B79Wzs1nkuBCr1ohoQItXnP3Dyc0Lizruvof5fslGBr6ra-GsW2ItYprhtUyHARXf5EV5nN5yQIPv4D_3rvMQexhRrGpPZGxJsnBBTLCMIrRETMOknqMiLZpTOsgQQqG1Ag6C1NgoFYqgF4F1tg2CRgWdrjxl02Gp8ClSpzyuQ6ALjwyZ32xS-owCsbBKZ9w==&xkcb=SoB56_M3sjC8xDR7gx0LbzkdCdPP&camk=ethIe0s0heeofADOYJH7ZQ==&p=0&fvj=0&vjs=3",
    "description": "ECCO Select is a talent acquisition and consulting company specializing in people, process and technology solutions. We provide the talent behind the technology enabling our clients to achieve their goals. For more information about ECCO Select, visit us at www.eccoselect.com.\nPosition Title:Software Engineer (Java) - Junior Level\nLocation Information: Leawood, KS (hybrid) or Alexandria, VA (mostly remote)\nPosition Responsibilities:\nDevelop and maintain Java-based backend services using frameworks such as Spring Boot or Micronaut\nDocument technical decisions, API specifications, and deployment guides using tools such as Confluence.\nLearn and use version control (GitHub) and contribute to CI/CD pipelines.\nInteract with SQL and NoSQL databases (e.g., PostgreSQL, MongoDB, Elasticsearch) for data access and storage.\nParticipate in code reviews, agile team ceremonies, and collaborative problem-solving sessions.\nEssential Skills, Experience\nThe ideal candidate for this role should possess the following qualifications:\nB.S. degree in Computer Science, Technology, Engineering, or a relevant field.\n1–2 years of experience in software development, including academic or internship work.\nProficiency in Java and familiarity with an object-oriented programming mindset.\nExposure to backend frameworks like Spring or Micronaut.\nUnderstanding of HTTP APIs, RESTful services, and common data formats like JSON.\nFamiliarity with at least one cloud platform (AWS, GCP, Azure) or willingness to learn.\nExperience with databases (SQL or NoSQL) and basic querying.\nComfort using Git for version control and an interest in learning modern development practices (CI/CD, DevOps).\nInterest in pursuing a career in the defense industry and/or intelligence community.\nWillingness to learn new skills and concepts and collaborate closely with senior team leads.\nAwareness of ethical considerations and responsible AI practices.\nExcellent problem-solving skills, attention to detail, and ability to thrive in a fast-paced, collaborative environment.\nExposure to NiFi, Kafka, or Airflow in academic or lab settings (not required, nice to have).\nInterest in cloud-native development, microservices, or scalable infrastructure (not required, nice to have).\nECCO Select is committed to hiring and retaining a diverse workforce. Our policy is to provide equal opportunity to all people without regard to race, color, religion, national origin, ancestry, marital status, veteran status, age, disability, pregnancy, genetic information, citizenship status, sex, sexual orientation, gender identity or any other legally protected category. Veterans of our United States Uniformed Services are specifically encouraged to apply for ECCO Select opportunities.\nEqual Employment Opportunity is The Law\nThis Organization Participates in E-Verify\nJob Type: Full-time\nPay: $70,000.00 - $77,000.00 per year\nBenefits:\n401(k)\n401(k) matching\nDental insurance\nHealth insurance\nLife insurance\nPaid time off\nVision insurance\nApplication Question(s):\nDo you have an active Top Secret Clearance?\nExperience:\nsoftware development: 2 years (Preferred)\nJava: 1 year (Preferred)\nAbility to Commute:\nLeawood, KS 66211 (Preferred)\nWork Location: In person"
  },
  {
    "title": "Sr. Delivery Consultant - DevOps, WWPS ProServe",
    "company": "Amazon Web Services, Inc.",
    "location": "Jessup, MD 20794",
    "salary": "$138,200 - $239,000 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0DiR_L9Yk1BWFWbfTFdXbTUvRWK-3b4thi9OwmTROImgBAlqgNkce7w6q6giteYv11ArX18p5uY769QSlkaMkobIpHOedKGPStTkHV9TAoaVa4UzLLWJifKUdGrpiGe6UdoKdffojqMWLi9jhZ2BmYcea0YhpWSy_K7kQSlb1dFVzK26bGJZLSejqMTBtUMZlhrmR1gvgl2w2DYRlP3zu3F_opjIFZKd1npKKem7JjTZRVRAkDJfjvB9ro5V_2WLckAsJWUigAa6ReqDdIyINWdoa-kpkHpXdGClIfxC6_z6MOc2SFKyvM2nRDRK11VMCpPyCNMeTJSMp8kDqnYBYMBdgB6LJcCkT9VijF7AVziPmuL5XGhilgx1HnVNXYzD3Yw-mX9FHgYGpMEIX0XcY1s0rxVU5Vj9NXSj2aMQbA2KOBrWBv70eE7OUxH6DOc3i82DL8FszzCp0nGJm6FWupJRi9XKMBf4THF2Yl-6kzOFZw_4B33qxzHxmNa6m8EO879yrq_XUc-WOsLtg8nk-akB6JEVTq-v59mA4Wbwkf5p3oXFCQG9AKT7mTqgkz_5h6K3EyA1Bft9dBfmFyY4S_-7vO5ljIsT2cva-PLnzpCES3laS7uvqudsNo784Zb2XvqSbP9HduvdGA-_ZUU8iLQe_PSXDO7ZtWcUyC2cOHS5dYc6ckW9Pqvjyck8LEKe7g=&xkcb=SoAN6_M3sjC8xDR7gx0HbzkdCdPP&camk=UoKtGZLa3XLAHMGZ75MOag==&p=12&fvj=0&vjs=3",
    "description": "The Amazon Web Services Professional Services (ProServe) team is seeking a skilled Delivery Consultant to join our team at Amazon Web Services (AWS). In this role, you'll work closely with customers to design, implement, and manage AWS solutions that meet their technical requirements and business objectives. You'll be a key player in driving customer success through their cloud journey, providing technical expertise and best practices throughout the project lifecycle. Possessing a deep understanding of AWS products and services, as a Delivery Consultant you will be proficient in architecting complex, scalable, and secure solutions tailored to meet the specific needs of each customer. You’ll work closely with stakeholders to gather requirements, assess current infrastructure, and propose effective migration strategies to AWS. As trusted advisors to our customers, providing guidance on industry trends, emerging technologies, and innovative solutions, you will be responsible for leading the implementation process, ensuring adherence to best practices, optimizing performance, and managing risks throughout the project.\n\nThe AWS Professional Services organization is a global team of experts that help customers realize their desired business outcomes when using the AWS Cloud. We work together with customer teams and the AWS Partner Network (APN) to execute enterprise cloud computing initiatives. Our team provides assistance through a collection of offerings which help customers achieve specific outcomes related to enterprise cloud adoption. We also deliver focused guidance through our global specialty practices, which cover a variety of solutions, technologies, and industries.\n\nThis position requires that the candidate selected must currently possess and maintain an active TS/SCI security clearance with polygraph. The position further requires the candidate to opt into a commensurate clearance for each government agency for which they perform AWS work.\n10040\n\nKey job responsibilities\nAs an experienced technology professional, you will be responsible for:\nDesigning and implementing complex, scalable, and secure AWS solutions tailored to customer needs\nProviding technical guidance and troubleshooting support throughout project delivery\nCollaborating with stakeholders to gather requirements and propose effective migration strategies\nActing as a trusted advisor to customers on industry trends and emerging technologies\nSharing knowledge within the organization through mentoring, training, and creating reusable artifacts\n\nAbout the team\nAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\n\nWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\n\nInclusive Team Culture Here at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon conferences, inspire us to never stop embracing our uniqueness.\n\nMentorship & Career Growth We’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\n\nWork/Life Balance We value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\nBASIC QUALIFICATIONS\nBachelor's degree in Computer Science, Engineering, related field, or equivalent experience\n5+ years of experience in cloud architecture and implementation\n5+ years of leading and/or participating in teams that design/implement/consult distributed applications or equivalent education experience\n5+ years of software development tools and methodologies\nCurrent, active US Government Security Clearance of TS/SCI with Polygraph\nPREFERRED QUALIFICATIONS\nAWS experience preferred, with proficiency in a wide range of AWS services (e.g., EC2, S3, RDS, Lambda, IAM, VPC, CloudFormation)\nAWS Professional level certifications (e.g., Solutions Architect Professional, DevOps Engineer Professional) preferred\nExperience with automation and scripting (e.g., Terraform, Python)\nKnowledge of security and compliance standards (e.g., HIPAA, GDPR)\nStrong communication skills with the ability to explain technical concepts to both technical and non-technical audiences\nExperience leading a team(s) of developers, architects or administrators that deliver technical capabilities to US Government customer(s).\n\nAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\n\nOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $138,200/year in our lowest geographic market up to $239,000/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site."
  },
  {
    "title": "Software Engineer",
    "company": "OptiTrack",
    "location": "Corvallis, OR",
    "salary": "Full-time",
    "url": "https://www.indeed.com/rc/clk?jk=45e4a168638ccc64&bb=z8J32LtRmvoH46VceviI_soMonlptKewXfl3Wz8mDB-P9vmujSgq_ZKcDY-po6EpkyOkXTbSoxzMqvD3vKkwI8bVV2Q24SbgKvLdZgZTZU68upsz5S_pufpuUfaCzRJv63SIHraEYeNBopNc3URTiw%3D%3D&xkcb=SoAD67M3sjC8xDR7gx0MbzkdCdPP&fccid=1e065055d945dd04&vjs=3",
    "description": "About OptiTrack\nOptiTrack is a global leader in 3D motion tracking solutions, delivering high-performance motion capture systems for a wide range of applications including virtual production, biomechanics, robotics, and game development. Our technology powers innovation at some of the world’s leading research institutions, studios, and companies.\nWe are looking for a talented and motivated Associate Software Engineer to join our development team in Corvallis, Oregon. This is an opportunity to work at the cutting edge of motion tracking, contributing to real-time systems used around the world.\nWhat You’ll Do\nDesign, develop, and maintain C++ desktop applications that interact with motion capture systems.\nWork collaboratively with software, hardware, and QA engineers to build high-performance, real-time applications.\nContribute to internal tools and pipelines using C++, Python, and possibly other similar languages.\nParticipate in code reviews, testing, and documentation as part of the software development lifecycle.\nRequirements\nRequired Qualifications\nBachelor’s degree in Computer Science, Software Engineering, Mathematics, or a related field.\nHands-on experience developing desktop applications in C++.\nWorking knowledge of Python.\nStrong problem-solving and debugging skills.\nGood verbal and written communication skills for documentation and internal collaboration.\nWillingness to work on-site in Corvallis, OR (hybrid schedules may be considered).\nExperience with motion capture systems or 3D tracking technologies.\nKnowledge of machine learning or artificial intelligence.\nFamiliarity with game engines such as Unreal Engine, Unity, or others.\nExperience working on real-time or high-performance system\nBenefits\nAll benefits start on first day of employment!\n75% employer-paid medical for employee. Family coverage also included.\n100% employer paid dental, and vision for employee and dependents\n100% employer paid long-term, short-term disability, and life insurance policy\n401k Match, if you’re contributing 5% we match 4%. 100% vested immediately.\n10 paid holidays\nStarting at 15 days paid PTO (inclusive of sick and vacation time) annually\nEmployee Assistance Program (EAP)\nFlexible Spending Account (FSA)\nEEOC Statement:\nOptiTrack is an equal opportunity employer, we believe in fostering a culture of equality, diversity, and inclusivity. Our commitment to this goal is clearly expressed in our zero-tolerance policy for discrimination and harassment of any kind, including on the basis of race, color, sex, age, religion, sexual orientation, national origin, disability, genetic information, pregnancy, protected veteran status or any other characteristic protected by applicable federal, state, or local laws. Our hiring practices ensure that decisions are based solely on qualifications, merit, and current business needs, while extending to all aspects of our operations - from recruitment and promotion to layoff and recall, to leave of absence, compensation, benefits, and training. We are committed to remaining a drug free workplace"
  },
  {
    "title": "Software Engineer (MERN Stack)",
    "company": "M1NERAL",
    "location": "Hybrid work in Texas",
    "salary": "$65,000 - $75,000 a year",
    "url": "https://www.indeed.com/rc/clk?jk=c1683911767d8b61&bb=z8J32LtRmvoH46VceviI_s37_0fjNiBaJMGd5sUilDWxAzlUAjm1kYCvkC2kpJPsAGIqNAf-W26u6u9vNgEnRrTQ-nL1Yrwg7osmEYS0aabaNQo9lgq8APqwBFK5MQF9ZzFYGxD0nbNW27_pj7RU1A%3D%3D&xkcb=SoCe67M3sjC8xDR7gx0PbzkdCdPP&fccid=ceb0dd633259cc03&cmp=M1NERAL&ti=Software+Engineer&vjs=3",
    "description": "Opportunity Details\nSoftware Engineer (MERN Stack)\nLocation: Flexible (Houston, Dallas or Austin, TX preferred)\nAbout M1neral:\nM1neral is an early-stage software company reimagining how the energy industry manages assets, data, and deals. Our purpose-built platform empowers energy companies, asset managers, and acquisition teams to streamline complex workflows, centralize critical information, and operate with greater speed and clarity across the enterprise.\nWe’re not just building tools — we’re delivering the next evolution of energy technology. At M1neral, we believe that modern energy operations demand modern solutions, and we are proud to be at the forefront of digital transformation in one of the world’s most vital industries. With a focus on continuous innovation and customer success, we deliver intuitive, feature-rich software that drives smarter decision making throughout the organization.\nWho we are looking for:\nWe’re looking for a highly motivated, detail-oriented Software Engineer with MERN stack experience to join our growing team with a focus on support, QA, and release management. In this hybrid role, you will spend about 50% of your time coding in React - delivering minor features, fixing bugs, and shipping critical patches - and the remainder of time ensuring smooth releases by coordinating QA workflows, validating fixes, resolving technical issues, and supporting ongoing product operations.\nYou’ll play a key role in making sure code changes are properly tested, validated, and released with stability. Your day-to-day will include triaging support issues, managing and merging releases, validating fixes, and monitoring production health.\nYour primary responsibility will be to coordinate release workflows with our development team while contributing code in our MERN stack. You’ll serve as a hands-on problem solver—troubleshooting issues, fixing minor bugs and small features in React, and supporting our QA process by testing and validating new features before release.\nThis role is ideal for someone who wants to stay hands-on with code while also gaining experience in release engineering, DevOps, and technical leadership. You’ll thrive here if you’re passionate about modern software delivery practices, databases (SQL and MongoDB), cloud infrastructure, and emerging AI tools—and want to make a real impact in a fast-paced, high-growth environment.\nResponsibilities:\n- Implement small features and bug fixes in React and occasionally across the MERN stack.\n- Strong fluency with MongoDB, including querying, data modeling, and performance awareness\n- Triage and troubleshoot support issues, coordinating fixes with the development team when needed.\n- Manage release workflows, including reviewing pull requests, merging changes, and ensuring smooth deployments.\n- Support product releases by executing QA and regression testing and validating key fixes.\n- Monitor production stability, identify issues, and escalate or roll back as appropriate.\n- Collaborate with engineering to prioritize, test, and resolve technical issues efficiently.\n- Contribute to continuous improvement initiatives by suggesting enhancements to QA, release, and support processes.\n- Periodically provide after-hours or weekend support for urgent issues.\nRequirements & Qualifications:\n- Hands-on coding ability in React and JavaScript, with experience debugging and fixing minor issues.\n- Familiarity with Node.js and broader MERN stack fundamentals.\n- Understanding of QA workflows and testing practices (manual or automated).\n- Experience with Git workflows (branching, pull requests, code merges, CI/CD pipelines).\n- Strong debugging and problem-solving skills across both application and release workflows.\n- Detail-oriented, organized, and capable of managing multiple tasks in parallel.\n- Strong sense of ownership and accountability in ensuring stable, high-quality releases.\n- Previous experience in SaaS, enterprise software, or energy technology is a plus.\nCompensation & Perks:\n- Base salary of $65,000-$75,000 depending on experience\n- Potential for additional bonus compensation for high performers\n- Health, dental, vision, and 401(k)\n- Generous paid time off and company holidays\n- Flexible remote work policy\n- Direct access to leadership and real career growth opportunities\n- Opportunity to have a meaningful impact in a growing, mission-driven tech company\nAdditional Info:\n- Candidates must be authorized to work in the United States at the time of application, as we are unable to sponsor visas for this position. If applicable, it is the candidate’s responsibility to maintain valid work authorization throughout the duration of employment.\nJob Type: Full-time\nPay: $65,000.00 - $75,000.00 per year\nBenefits:\n401(k)\nDental insurance\nFlexible schedule\nHealth insurance\nPaid time off\nVision insurance\nWork Location: Remote"
  },
  {
    "title": "Senior Embedded Software Engineer - Verification Lead",
    "company": "Capgemini",
    "location": "Burlington, MA",
    "salary": "$86,900 - $192,460 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0AFPWGUWd9WogocUMPMJGIIN0itgsMWMAh4xI-EBuTuDzsu5mL8uwY3TRXBGWxqEgd0giyFDwjQuXZ05eBpuFne7glidcH-ajw4IFWs6u4zd2fa7b9Z0fRjhUnOqtFXTKQswlsxIcrIIN6Jeqs4N5SOuOHBHAayIQx6TaKCAKCvP1X4PlgNed5V1it1WzI95-kdCs8u8Jcv4D1BjQE9EODhAxIvXQxeZVDetPCor1DAw8ZzFJw6wYpBkH5lwH9qHapu82rEjds4QyXrpkoTAyq73KSwAoBeyasnk2w5nnH6TcD0mn9dglgOdg2dwiePybKKgnRjBGo3zzdnTMr4XwQgHbKDJCE18GJGKYBmdTy6-gUJodZhaBz9k7wJ2ljQPF0LrRbSKtgiAdAlC2Abuc3Pq5GKFQ8oO3MY_vgL5-zJgOu-zRL8nfAfEIndPNsmGe7CIEr6MqtKITWkZLICYVRoqx0SgYqjwnxqNeTOmKRuhbNB75aJL84u6tVvSXiYsBgHJgSTOSBnpvMqvSwTOJivUdALmON1xlWXST_PRxO1mjnPoaSqsj4XM6epm3iUYOLk6DRFQvHgoXBkAO-EZrZe6nMWKcKDCcPHPhLiukcD8Gx-5QI0KN6KeI2m9tihbytubJWtGi5Er82TZzsJ4wK-HHFJFiPSPsP2ghpD2neyh4yQBa-AMCWW-Xn_cdMqxe_oqa_Vo-GUvBnVAwrEXrohJyEewg7q2GcpKcZbm1MgF1eiDyJ5AUfu&xkcb=SoA36_M3sjC8xDR7gx0BbzkdCdPP&camk=nUmJqO2E8rhhUrEVVDYimQ==&p=10&fvj=0&vjs=3",
    "description": "About the job you’re considering\nWe are seeking an experienced Senior Verification Engineer to lead verification efforts for embedded and mobile systems in the MedTech industry. The ideal candidate will drive verification strategies, manage a team of engineers, and ensure compliance with medical device regulations.\nYour Role\nLead Verification Strategy: Develop and execute comprehensive verification plans for embedded and mobile systems used in MedTech applications.\nTeam Leadership: Manage and mentor a team of verification engineers, promoting a culture of quality, collaboration, and continuous improvement.\nTest Development: Design and implement both automated and manual test cases for embedded firmware, mobile applications (iOS/Android), and integrated systems.\nCompliance & Standards: Ensure all verification activities align with relevant medical device regulations such as ISO 13485, IEC 62304, and FDA guidelines.\nDefect Management: Lead root cause analysis and resolution of defects, ensuring proper traceability and documentation.\nCross-functional Collaboration: Work closely with software, hardware, and QA teams to synchronize verification efforts with development milestones.\nTooling & Infrastructure: Select, configure, and maintain verification tools, frameworks, and environments to support efficient testing workflows.\nReporting & Documentation: Generate detailed verification reports, metrics, and dashboards for internal teams and external stakeholders.\nYour Skills and Experience\nProven experience in MedTech product development and verification.\nStrong understanding of embedded systems and mobile platforms (Android/iOS).\nExperience with cloud-connected medical devices and mobile health applications.\nKnowledge of cybersecurity and data privacy in medical systems.\nFamiliarity with medical device standards and regulatory requirements.\nProficiency in scripting and test automation tools (e.g., Python, Jenkins, CI/CD pipelines).\nExcellent communication, documentation, and organizational skills.\nCertifications such as ISTQB, ASQ, or equivalent are a plus.\nBachelor’s or master’s degree in computer engineering, Electrical Engineering, Biomedical Engineering, or a related field.\nMinimum of 10 years of experience in software/hardware verification, with at least 3 years in a leadership role.\nLife at Capgemini\nCapgemini supports all aspects of your well-being throughout the changing stages of your life and career. For eligible employees, we offer:\nFlexible work\nHealthcare including dental, vision, mental health, and well-being programs\nFinancial well-being programs such as 401(k) and Employee Share Ownership Plan\nPaid time off and paid holidays\nPaid parental leave\nFamily building benefits like adoption assistance, surrogacy, and cryopreservation\nSocial well-being benefits like subsidized back-up child/elder care and tutoring\nMentoring, coaching and learning programs\nEmployee Resource Groups\nDisaster Relief\nAbout Capgemini Engineering\nWorld leader in engineering and R&D services, Capgemini Engineering combines its broad industry knowledge and cutting-edge technologies in digital and software to support the convergence of the physical and digital worlds. Coupled with the capabilities of the rest of the Group, it helps clients to accelerate their journey towards Intelligent Industry. Capgemini Engineering has 65,000 engineer and scientist team members in over 30 countries across sectors including Aeronautics, Space, Defense, Naval, Automotive, Rail, Infrastructure & Transportation, Energy, Utilities &\nChemicals, Life Sciences, Communications, Semiconductor & Electronics, Industrial & Consumer, Software & Internet.\nCapgemini Engineering is an integral part of the Capgemini Group, a global business and technology transformation partner, helping organizations to accelerate their dual transition to a digital and sustainable world, while creating tangible impact for enterprises and society. It is a responsible and diverse group of 340,000 team members in more than 50 countries. With its strong over 55-year heritage, Capgemini is trusted by its clients to unlock the value of technology to address the entire breadth of their business needs. It delivers end-to-end services and solutions leveraging strengths from strategy and design to engineering, all fueled by its market leading capabilities in AI, generative AI, cloud and data, combined with its deep industry expertise and partner ecosystem. The Group reported 2024 global revenues of €22.1 billion.\nGet the future you want | www.capgemini.com\nDisclaimer\nCapgemini is an Equal Opportunity Employer encouraging diversity in the workplace. All qualified applicants will receive consideration for employment without regard to race, national origin, gender identity/expression, age, religion, disability, sexual orientation, genetics, veteran status, marital status or any other characteristic protected by law.\nThis is a general description of the Duties, Responsibilities and Qualifications required for this position. Physical, mental, sensory or environmental demands may be referenced in an attempt to communicate the manner in which this position traditionally is performed. Whenever necessary to provide individuals with disabilities an equal employment opportunity, Capgemini will consider reasonable accommodations that might involve varying job requirements and/or changing the way this job is performed, provided that such accommodations do not pose an undue hardship.\nCapgemini is committed to providing reasonable accommodations during our recruitment process. If you need assistance or accommodation, please reach out to your recruiting contact.\nPlease be aware that Capgemini may capture your image (video or screenshot) during the interview process and that image may be used for verification, including during the hiring and onboarding process.\n\nApplicants for employment in the US must have valid work authorization that does not now and/or will not in the future require sponsorship of a visa for employment authorization in the US by Capgemini.\n\nCapgemini discloses salary range information in compliance with state and local pay transparency obligations. The disclosed range represents the lowest to highest salary we, in good faith, believe we would pay for this role at the time of this posting, although we may ultimately pay more or less than the disclosed range, and the range may be modified in the future. The disclosed range takes into account the wide range of factors that are considered in making compensation decisions including, but not limited to, geographic location, relevant education, qualifications, certifications, experience, skills, seniority, performance, sales or revenue-based metrics, and business or organizational needs. At Capgemini, it is not typical for an individual to be hired at or near the top of the range for their role. The base salary range for the tagged location is $86,900 - $192,460. This role may be eligible for other compensation including variable compensation, bonus, or commission. Full time regular employees are eligible for paid time off, medical/dental/vision insurance, 401(k), and any other benefits to eligible employees. Note: No amount of pay is considered to be wages or compensation until such amount is earned, vested, and determinable. The amount and availability of any bonus, commission, or any other form of compensation that are allocable to a particular employee remains in the Company's sole discretion unless and until paid and may be modified at the Company’s sole discretion, consistent with the law.\nJob Developer\nSchedule Full-time\nPrimary Location US-MA-Burlington\nOrganization ERD PPL US"
  },
  {
    "title": "Principal Software Engineer, Perception",
    "company": "Berkshire Grey",
    "location": "Bedford, MA 01730",
    "salary": "$136,000 - $221,000 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0BZ-6ifTI44FfgNmgxONT89MOOGS1ao-rWwGZIFnAIb3Uyoh4dkbIcmnyvZ8SddPk96o7itcr6iUOdQUGxvlIdhwUIp7QRPQASB1BnBHMpfhjMRPFRNMBvnTDVeNx0QQDIeZUh58CCwoknr_SaQ57IeahYVS14v8FudFVvp_0QwrQTxxKmEqgxnVCgS1TpqtKCrhHmzyD53E0G-Kg9xg8XtRw_Y9BpSMWMLwtnrKaRD6J22zETBRrh9MCCJFGtIlCndj9m599bmEYvr6yH1wam7VbjJShxOeerf0ht3t05QgIGrJ4mhCu0kxw8VAVtPNjtT6DC8i41b4YrtyqH9txLz-cjiQ9cEz1Laaepb50WDE4S-D08mrZdGkgzJzSFgOju6XubzOA91_xn4P5EK5powfsVoIEyxOZN82vpyYPGs44X-tET1OyO_2OM-TcKt5NfvrrJ4xfucQkXLh6FL1sTG1JcKMVkpGWu94dLmZIrifOQ6sOrbGJ1Rr3czwtxoxefKJMcPXe_ewD-BXf9w4NreM62ZfVQhjbyt6xovt9GfSSwiZEtxujEvL8JgjVxt8MojNnbv7ukUjE9bmWbGBbs0GwIcfbhL9NHHLpqRSrxX4xPqGmzhkcYS&xkcb=SoAe6_M3sjC8xDR7gx0DbzkdCdPP&camk=nUmJqO2E8rhugpEtlYO2mA==&p=8&fvj=0&vjs=3",
    "description": "About The Job\nBerkshire Grey is a leader in the field of AI and robotics, providing innovative solutions for e-commerce, retail replenishment, and logistics. Our technology automates complex pick, pack, and sort operations.\nIn the role of Principal Software Engineer, Perception, you will develop, optimize, and own perception software deployed on real-world robots, allowing them to understand and interact with their environment in unprecedented ways. Your work will directly contribute to enhancing the capabilities of our robotic solutions. This position offers a unique opportunity to deploy the latest perception technologies, pushing the boundaries of robotic perception applied to real-world challenges.\n\nResponsibilities:\nDevelop and apply advanced perception algorithms for robotic applications.\nProvide technical leadership and mentorship to a small team of software engineers.\nDesign and architect robust software solutions for real-world robotic systems deployed around the world.\nEvaluate and integrate perception libraries and machine learning models into our solutions.\nCollaborate with cross-functional teams to ensure seamless integration of perception software with other software, hardware and controls teams.\nCommunicate technical priorities and status.\nStay abreast of the latest advancements in perception and robotics, evaluating applicability to our challenges.\n\n\nMinimum Qualifications:\nMaster’s degree in Computer Vision, Machine Learning, Robotics, Computer Science or a closely related field.\n8+ years of experience in software development with a focus on computer vision and/or robotics.\nProficiency in Python and C++.\nA strong knowledge of computer science algorithms and data structures.\nKnowledge of 3D point cloud processing algorithms and libraries (PCL, Open3D).\nKnowledge of 2D image processing algorithms and libraries (OpenCV).\nKnowledge of machine vision sensors (RGB and grayscale 2D cameras, 3D sensors).\nDemonstrated ability to:\nApply perception algorithms to real-world problems.\nProvide technical leadership on key projects.\nManage execution of technical efforts across a small team.\nMentor junior engineers.\nOperate autonomously.\nDevelop on and debug real robotic systems.\nDetermine and communicate justification of technical priorities.\nKnowledge of software design principles and patterns.\nExperience with team software development (agile project management, task planning, and tracking).\nExperience with refactoring and maintenance of the existing codebase.\n\nPreferred Qualifications:\nPhD in Computer Vision, Machine Learning, Robotics, Computer Science or a closely related field.\nPractical experience with the application of machine learning for computer vision.\nWork experience in the material handling industry.\nExperience with unit test frameworks for C++ and Python.\nExperience with designing multithreaded and asynchronous applications.\nExperience with ROS1 or ROS2.\n\n\n\n6110-2414YW"
  },
  {
    "title": "SOFTWARE & CONTROLS ENGINEER",
    "company": "Sodexo Technical Services (Roth)",
    "location": "Hybrid work in Youngstown, OH 44515",
    "salary": "Full-time",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0CDdIP7bXewi643-sP5ZSAjRMIPN5VF8UxYXmNc5zE6DZPQrn6SZZWQPjQ2teeauu_jDb3Fvf_AgTdGxvKv02gFpcVGnumNDK-LG1PlJnSJrTAfAPwxUjXpv_mvkcWI_ATMG9FZDm-Ew4d8HlONGqg9VI5qZx2bXXkQFEpzEF6Lgri_oXnzyVc5Qgg-b8r8UxvoTbShZOeiD_DzN1d4yMlHDBEGKO4VPEdI9Uld28GfCcIffrkZCij9XExE7dqQKW3yNlItpdihDz1GrG6zArsXoRC3muw8qZKDBUVm50HqZQzIieCxJNKBqHkOHjhdKFuH9iF5EgCIN8-YT6k5LTLuByC7_cfdNvf08KzOT21T1pFW0IT7udaZWx0t0UvdaOrKY3jSrZhjWn1VT16_8F9mHeT61T3_SFDYEwDNvgiGDSwdNCuYxcDRLrNbeP00NT-VhteosK8S8_uYI-AYLbZa3vZbYGgX_BrEupOSM97u2OQKbb5t85556BWdPOSWqFCcuqTPjLt1FMVq2pLFUwkLbCeZTPkutyJEWRyH72d9bAA7vpw6gpaDsu73jcD-mqwO_zl4znJmElNZN4L-RTbW9Krf94JwgcBrYXkUfCY4-F5toyH7mhiVKF7v1pKgAlQ8K9IkrCnthIE3ZD2Eq22huG8VelashFU=&xkcb=SoC56_M3sjC8xDR7gx0GbzkdCdPP&camk=UoKtGZLa3XLPpdKMHfPXEg==&p=13&fvj=0&vjs=3",
    "description": "Company Overview\nSodexo | Roth couples 100 years of experience and service with an elite level of customer satisfaction and result-driven track record. Sodexo | Roth's deliverables are enhanced by self-servicing HVAC, HVAC Construction, Roofing, Facility Automation, and Command Center needs in the national marketplace.\nJob Summary:\nThe Software & Controls Engineer designs, implements, and supports building automation, energy management, and security systems that meet client scope, budget, and schedule. This mid-level role combines controls engineering, software development, and project delivery. The engineer develops controller and workstation software, integrates third‑party systems, creates operator graphics, and supports commissioning and training. The position collaborates closely with project managers, sales, and field teams to ensure reliable, efficient, and customer‑accepted systems across our Facilities Automation portfolio.\nKEY RESPONSIBILITIES\nSystem Design & Software Development\nDevelop, load, and validate controller software, databases, and configuration for BAS/EMS/security systems.\nDesign and configure system architectures and networks for workstations, servers, and field devices.\nCreate intuitive graphical user interfaces (operator graphics/HMI) and dashboards for end users.\nDevelop sequences of operation and implement energy‑saving control strategies.\nIntegrate third‑party systems (e.g., HVAC, lighting, power monitoring, access control) using open protocols.\nProject Engineering & Delivery\nProduce quotes, drawings, submittals, I/O summaries, operations manuals, and closeout/as‑built documentation.\nPlan and track scope, schedule, budget, materials, and subcontractors; proactively manage risks/issues.\nCoordinate with internal disciplines and external partners (GCs, MEP trades, vendors) to align deliverables.\nSupport installation, start‑up, programming, and commissioning activities based on project complexity.\nMaintain compliance with federal, state, and local codes; uphold company safety and quality standards.\nStakeholder Engagement & Support\nProvide technical support before, during, and after installation; resolve field issues and change requests.\nDeliver onsite and remote training for customers and internal teams; develop procedures and training materials.\nCommunicate status, decisions, and trade‑offs to project stakeholders; contribute to proposals and solution design.\nContinuous Improvement & Standards\nApply value engineering and process improvements to enhance reliability, performance, and cost.\nStandardize templates, libraries, and best practices to improve repeatability and delivery speed.\nRole Impact\nThis role improves client satisfaction, system reliability, and energy performance across facilities by delivering well‑engineered, maintainable automation solutions. Effective execution accelerates project timelines, reduces rework, and drives retention and growth through service excellence and consultative partnership.\nQUALIFICATIONS\nEducation\nBachelor’s degree in Mechanical, Electrical, Controls, Computer Science, or related field preferred (or equivalent experience).\nProfessional Experience\n4–7 years of experience in building automation/controls or related MEP projects, including hands‑on programming, integration, and delivery.\nTechnical Skills\nProficiency with BAS/EMS programming, controller configuration, and workstation/server setup.\nExperience integrating HVAC/lighting/power/access systems via open protocols (e.g., BACnet, Modbus, Lon).\nAbility to read and interpret mechanical, electrical, and life‑safety drawings/specifications; develop sequences of operation.\nKnowledge of HVAC equipment (e.g., VAV/fan coils, AHUs, boilers, chillers, RTUs, VFDs) and power/energy management.\nCompetence in network configuration, cybersecurity basics for OT, and troubleshooting tools.\nProject Management\nDemonstrated ability to plan and sequence work, manage material procurement, coordinate vendors/subcontractors, and report status on scope, schedule, cost, risks, and quality.\nCommunication & Collaboration\nStrong written and verbal communication; customer‑focused with the ability to translate technical concepts for diverse audiences; effective cross‑functional collaborator.\nCertifications (Nice to Have)\nLEED AP, PMP, PE, CEM, or manufacturer‑specific controls certifications.\nWork Environment & Travel\nAbility to work on active construction sites and in mechanical/electrical spaces; use hand tools; climb ladders; and travel as needed for project and client support.\nCompliance & Ethics\nCommitment to safety, data integrity, and regulatory compliance; adherence to company policies and ethical standards.\nIf you are ready to make an impact and contribute to a sustainable future with us, we invite you to apply today!\nSodexo is an EEO/AA/Minority/Female/Disability/Veteran employer.\nSodexo | Roth is committed to creating a safe workplace free from drugs and alcohol. The Company will comply with all applicable state and federal laws. Accordingly, the Company's policy includes a prohibition on the use/possession or being under the influence of marijuana at all of its locations in the United States.\nJob Type: Full-time\nBenefits:\n401(k) 6% Match\nAD&D insurance\nBereavement leave\nDental insurance\nDisability insurance\nEmployee assistance program\nFlexible spending account\nHealth insurance\nLife insurance\nPaid holidays\nPaid sick time\nPaid time off\nPrescription drug insurance\nVision insurance\nWork Location: Hybrid remote in Youngstown, OH 44515"
  },
  {
    "title": "Software Engineer",
    "company": "Cook'd",
    "location": "Brooklyn, NY 11239 \n(East Brooklyn area)",
    "salary": "From $140,000 a year",
    "url": "https://www.indeed.com/rc/clk?jk=ad4f98e961b322c8&bb=z8J32LtRmvoH46VceviI_m1-lrDEs348oua-sOakNGX7cBtq76iCYA-E3B2XbuMgBE7ml7EG2jI0jK06e_acyA1k5jU0UF7HuMV4hVI9nkTYCLLqoXy1YvE4CYDBVW-u3MerXCvCDK9Zagxw1ag5ng%3D%3D&xkcb=SoCk67M3sjC8xDR7gx0JbzkdCdPP&fccid=ec05b508e582941c&cmp=Cook%2527d&ti=Software+Engineer&vjs=3",
    "description": "Job Summary\nWe are seeking a skilled Software Engineer to join our dynamic team. The ideal candidate will have a strong background in software development and web development, with experience in various programming languages and frameworks. You will be responsible for designing, developing, and maintaining software applications while collaborating with cross-functional teams to deliver high-quality solutions.\nResponsibilities\nDesign, develop, and implement software applications using Ruby on Rails, JavaScript, and Python.\nCollaborate with product managers and UX/UI designers to create user-friendly interfaces and enhance user experience.\nDevelop RESTful APIs for seamless integration between front-end and back-end systems.\nParticipate in Agile development processes, including sprint planning, daily stand-ups, and retrospectives.\nMaintain version control using GitHub and SVN for efficient code management.\nConduct code reviews to ensure code quality and adherence to best practices.\nTroubleshoot and debug applications to optimize performance and resolve issues.\nWork with cloud services such as AWS and Azure for application deployment and infrastructure management.\nImplement database solutions using MySQL or SQL Server for data storage and retrieval.\nStay updated with emerging technologies and industry trends to continuously improve skills and knowledge.\nExperience\nProficiency in programming languages such as Java, C#, C++, Ruby, Python, or VBA.\nStrong understanding of IT infrastructure principles and application development methodologies.\nExperience with front-end development frameworks like React or Express is a plus.\nFamiliarity with Linux operating systems for application deployment is desirable.\nKnowledge of Quantum engineering concepts is a bonus but not required.\nUnderstanding of Role-Based Access Control (RBAC) principles is advantageous. If you are passionate about software engineering and eager to contribute to innovative projects in a collaborative environment, we encourage you to apply!\nvery nice\nJob Type: Full-time\nPay: From $140,000.00 per year\nBenefits:\nDental insurance\nHealth insurance\nWork Location: In person"
  },
  {
    "title": "Software Test Engineer",
    "company": "Miller",
    "location": "Appleton, WI 54914",
    "salary": "Full-time",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0B1rcCWmdO79QKYSSPWxYUue9qS1ZbaQnM6sBqMyE0IEwsESMXdQ6yHe8mAD23BfcgF7_i5dt8F6FQUq3sntlIP28NTpaWkgCfjuuwibrX7AGU1JyQguptNS8fmi0E6rIaoVAa7c52y6OhDsZ51ouft3Z94c4diks0zo-Y5P9dGIh6aEwWoivPOa50-JpxElAfhWz7KGucQAeXfnavGxJd0vWamhUZ56ovZgFZWcZXgLTHstfYFF5RjZWoWhU_0sxBlKCDOlKqxPlDtUg62W0GbCO4tK_OFl166MsP5YfzjSJTS4sdDIAkAmzXyqmY4lJ1urwJSnaISKGCdP39JrvhObNb1LWdjcMdZiijqD2HB0i44O-VGrbL8yyuDTn1f21BZvXHayIXj_yYSKd_nlJtd7BwNRblimhVXaGCCMIFEX2rcBoYBX-6cG4k-GLLgkBu589rq10dD6hIXmGDgkxvgqCQB8YBXMdfAck-L3KfUrEDk6OTCHjMEcen3hz-MrN20NzBSn60yoS8ToPsPDzytD_4Cs8sci8CgRhyyjPLBz-BFcm9lqV-yRCatVWodSpLOWf02n6F8cvwD0ADepPK2V7f7zDoJCEDlO8BsWif7cVYO7MAvZWWTl1b8_4NIOkLir-eqfb_1NqEO88jDf8fzHWmyumlFTgwFgkG7d7Gqm-kRE2QgWdDKikuJjRmuM00s5COvcayLsX2Gj1y499UnFrCfmDkBQxHFnIBbp-btQOUQCNjfHfG4CCAHglefoh6NSoALaeU1ag==&xkcb=SoAk6_M3sjC8xDR7gx0FbzkdCdPP&camk=UoKtGZLa3XItSa2ryKnj0Q==&p=14&fvj=0&vjs=3",
    "description": "Job Description:\nITW Welding continues to build its capabilities in software development as a core competency in digitally controlled welding equipment, processes, and systems. To support this effort, we are seeking an experienced and detail-oriented Software Test Engineer to be a key driver in ensuring the quality and reliability of our software through robust automated testing. This role is critical for developing and implementing automated test strategies for new and existing product development efforts, ultimately providing increased customer satisfaction.\nThis position will require a highly motivated individual with strong analytical, problem-solving, and communication skills to work collaboratively with software development engineers, electrical engineers, software test associates, marketing, and product management. The right candidate will bring a strong foundation in software testing, test automation development, and a passion for ensuring product excellence.\n\nESSENTIAL FUNCTIONS:\nFoster system-level embedded software quality excellence through the creation, maintenance, and use of software test solutions.\nProvide software and hardware design for test input to development team members to expect product testability.\nDevelop and maintain comprehensive test plans, test cases, and test documentation.\nLead development teams in isolating, reporting, and tracking software defects through resolution.\nStay updated with emerging technologies, industry trends, and best practices in software testing and test automation.\nContribute to embedded software development tasks as workload requires or between testing projects.\nMINIMUM QUALIFICATIONS:\nThe candidate must be able to perform essential job functions using technology and skills described below:\nA bachelor’s degree in Computer Engineering, Computer Science, or Software Engineering, with a minimum of 2-3 years of industry experience in software testing or software development with a significant focus on test automation.\nFamiliarity with embedded system analog, digital, and communication interfaces\nFamiliarity in interfacing with test equipment\nExperience with unit test frameworks\nStrong programming skills in C/C++\nKnowledge of software development lifecycles, testing methodologies, and best practices, including version control and defect tracking.\nProficiency in using debugging tools, and a foundational understanding of tools like oscilloscopes or logic analyzers for troubleshooting.\nStrong analytical and problem-solving skills with the ability to troubleshoot complex issues in integrated hardware/software systems.\nExcellent verbal and written communication skills to effectively convey technical concepts and collaborate with diverse teams.\n\nIDEAL QUALIFICATIONS:\nAn ideal candidate would possess some more specific skills:\nFamiliarity with languages commonly used in test automation (C#, Python, or related)\nExperience with specific DAQ hardware/software (DAQ USB-1208HS-4AO, or related)\nIn-depth knowledge of testing communication interfaces.\nA good understanding of basic electrical engineering concepts and the ability to read and interpret schematics.\nExperience with real-time operating systems (RTOS).\nProficient with Azure DevOps continuous integration/continuous deployment (CI/CD) pipelines.\nExperience working in an Agile or Scrum software development environment.\nITW Welding is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, or protected Veteran status, age, or any other characteristic protected by law.\n\nITW is an equal opportunity employer. We value our colleagues’ unique perspectives, experiences and ideas and create workplaces where everyone can develop their careers and perform to their full potential.\n\nAs an equal employment opportunity employer, ITW is committed to equal employment opportunity and fair treatment for employees, beginning with the hiring process and continuing through all aspects of the employment relationship.\n\nAll qualified applicants will receive consideration for employment without regard to race, color, sex, gender identity, sexual orientation, religion, national origin, age, disability, protected Veteran status or any other characteristic protected by applicable federal, state, or local laws."
  },
  {
    "title": "",
    "company": "",
    "location": "",
    "salary": "",
    "url": "https://www.indeed.com/viewjob?jk=890abcdef0123456",
    "description": "None"
  }
]