[
  {
    "title": "Staff ML Engineer - Offboard Embodied AI",
    "company": "General Motors",
    "location": "Mountain View, CA",
    "salary": "$180,000 - $280,000 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0BqJjBsvJkVIRVupdyx-l7jJlkPL5nU6SVET5Mq4mDejegpz4R4z9X6QNcQ1GgqKr4pp5hVCKtTWZzxAc_xo96pQtQ4jQmVVl4NduidcepK_pY2rzjR5Rxje1Q4PWf1Oux_DIfG0CAv9LL3xUloHWzl3fEVho2vg3DsLOTXvYu2OnRLWnzGiSxle4-cwI__pt7tfvpBfKPC4r4bZaiuUg3eGhIrq6uBI1nxsBJZoNPUdRIU9GIKDqQJdOMjmeSUSWxkzgR2R7tmS95KvOp4EOUYG_MnB8XjjnA26wwCsuDrtlhNIn7EHuDnikFcy4hnbAqvBWM7GcbvGZFQWRlZpyRRDyIyn-ikaem1U3IDbpIRzLOZbYDDaRY8yLEjOBfHvYY7Aeuy4-TeqicP5OZlFc86C_qY8NPF1OXYqgs-DryxnloqZr9zwQykVK5igoruRDpUtmiur6pzVq5aKkUXV7GKsqsHiYrb11NQfQtvTlLyHj-H90g1CIuluMibwLzlhPn7AYsC50v4zNTjQeGXsOFb4XbEslJQnD86ku_QvLIB0ax8r-HqXJGM2HHl9H6Inx1Uz9L8CPjLdT2XJIav53w_1OFK3z8aUOlyN3tDQdUnPbBAvLkgdnAXpE2Rlb9CviZTvg_ygnlMnwJ0C4doX2dlghaXNoZKDp5XaoFBgWZs3cnyJ27O5fiu45i8tuiswCTSYnmnaUB2NAzxgPRkSxTxJdpKCqsUbZkUiI-2XbmMrYNl-MbtwVB7eqdqQ_s3zWgHwI5PSZlLzf8rQtADXJFin5pl4n_OOYHh9xrys27JL328DIZVijNFBZdU0oPnVEw=&xkcb=SoAh6_M3sYoylsSMbJ0KbzkdCdPP&camk=nUmJqO2E8rh8JLMt8M-EVQ==&p=1&fvj=0&vjs=3",
    "description": "Job Description\nRole: In t his role, you will be at the forefront of developing and deploying large-scale Foundation Models (FMs) that enhance our automotive technologies at General Motors focused on Autonomous Driving & Robotics. You will work closely with a dynamic team of AI and ML researchers, data scientists and engineers who are passionate about leveraging advanced AI techniques to drive innovation for L2, L3 and L4 applications . Your contributions will directly impact our ability to deliver cutting-edge solutions that meet the needs of our customers.\nWhat You'll Do:\nDesign and implement large-scale Foundation Models for various applications, leveraging recent advancements in AI and robotics .\nCollaborate with cross-functional teams to integrate & built distillation recipes of Robotics foundation models for onboard driving models .\nAnalyze and optimize model performance, ensuring efficient training and deployment.\nConduct research and stay updated on the latest advancements in AI frameworks and libraries.\nLead projects from ideation to deployment, documenting learnings and best practices along the way.\nMentor junior team members and contribute to a culture of knowledge sharing and continuous improvement.\nYour Skills & Abilities:\nBachelor’s , Master’s or PhD degree in Computer Science with a focus in Robotics and or Machine Learning , or a related field.\nProven experience working with large-scale Foundation Models, including LLMs , VLAs and vision-focused models.\nProficiency in frameworks such as PyTorch and TensorFlow, with experience in libraries like HuggingFace and OpenAI GPT.\nStrong data processing skills using tools like Numpy , Pandas, and Apache Spark.\nExcellent communication skills to effectively collaborate with diverse teams and stakeholders.\nExperience deploying foundation models into production environments and understanding the end-to-end process.\nPrevious experience in Robotics or Autonomous Driving .\nCompensation : The compensation information is a good faith estimate only. It is based on what a successful applicant might be paid in accordance with applicable state laws. The compensation may not be representative for positions located outside of New York, Colorado, California, or Washington.\nThe salary range for this role is $180,000 to $280,000 . The actual base salary a successful candidate will be offered within this range will vary based on factors relevant to the position.\nBonus Potential: An incentive pay program offers payouts based on company performance, job level, and individual performance.\nHybrid: This role is categorized as hybrid. This means the successful candidate is expected to report to the Mountain View Technical Center in the Bay Area three times per week, at minimum.\nRelocation: This job may be eligible for relocation benefits.\n#LI-MH2\n&#xa;&#xa;\nAbout GM\nOur vision is a world with Zero Crashes, Zero Emissions and Zero Congestion and we embrace the responsibility to lead the change that will make our world better, safer and more equitable for all.\nWhy Join Us\nWe believe we all must make a choice every day – individually and collectively – to drive meaningful change through our words, our deeds and our culture. Every day, we want every employee to feel they belong to one General Motors team.\nBenefits Overview\nFrom day one, we're looking out for your well-being–at work and at home–so you can focus on realizing your ambitions. Learn how GM supports a rewarding career that rewards you personally by visiting Total Rewards resources .\nNon-Discrimination and Equal Employment Opportunities (U.S.)\nGeneral Motors is committed to being a workplace that is not only free of unlawful discrimination, but one that genuinely fosters inclusion and belonging. We strongly believe that providing an inclusive workplace creates an environment in which our employees can thrive and develop better products for our customers.\nAll employment decisions are made on a non-discriminatory basis without regard to sex, race, color, national origin, citizenship status, religion, age, disability, pregnancy or maternity status, sexual orientation, gender identity, status as a veteran or protected veteran, or any other similarly protected status in accordance with federal, state and local laws.\nWe encourage interested candidates to review the key responsibilities and qualifications for each role and apply for any positions that match their skills and capabilities. Applicants in the recruitment process may be required, where applicable, to successfully complete a role-related assessment(s) and/or a pre-employment screening prior to beginning employment. To learn more, visit How we Hire .\nAccommodations\nGeneral Motors offers opportunities to all job seekers including individuals with disabilities. If you need a reasonable accommodation to assist with your job search or application for employment, email us or call us at 800-865-7580. In your email, please include a description of the specific accommodation you are requesting as well as the job title and requisition number of the position for which you are applying."
  },
  {
    "title": "Applied Scientist II, RBKS AI",
    "company": "Amazon.com Services LLC",
    "location": "Sunnyvale, CA 94087",
    "salary": "$136,000 - $223,400 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0D0COgrZ5esAGQHfIlSu4u-zPl1EQBp6dPaYF7joqiLmjI1-o6Xyr_2RpQvIgycas1d5HxbebOm70Ok7bRBhP5DMBoExXQc7wD5bMZipmStxMgPf8vl9tNgS3lmo5XuWK63lxGWNtA71TLJdzkyAH6_iQqU8hZPj8plJzvgrqKbcTSZh45S-iNDHjAHxauuOcCECJ0k3JaBN2tDeVrw2oOoaf5noYcx9E6F-QPlCcE73WWQ8VFEiNpmExzdTKb2tXsu-coTUAiW4skEGQ7BsK-RDXHdYcCBOmGEn5EEXUZMQ3-_iDsPb7A_zngQ_899cqzPsMzTIy2Uo6oUTShVfISd_w8Q9NBdHou0Rpef-XSz45p11tLnRKHIv5KGofvuGGyvvLPeZcRb9moQSBasPCmqm_ZpQ28eE8ebAGfktpgsWB1fKLH3TVxkel3L0-2aPE0zAD3JTSErnY42LmL_Epy5JufIzAyjDBMtA0AmouR-qx_NeKmazS3iD3xeXePQjbvBy8RYu3uDKq4dMso6EQtzlDXMk0VngEluc57_JpYBmHDMz3kmd9pdtb--g2zi7q0GQwrVF2pX_qydQW0C4pEhWEqOHIylIHXJ0t1-26ZMnw6HBr4NL4d6BAKtJXbcPxIXKpV0iPsrj3sfOET1XMHRswPHLrU6raGLswpLzyX3egATVwewLMc9CpRqY6urejwYkNaoVSezAw==&xkcb=SoCG6_M3sYoylsSMbJ0PbzkdCdPP&camk=UoKtGZLa3XIeeOlIhfOYPg==&p=4&fvj=0&vjs=3",
    "description": "Are you fueled by a passion for computer vision, machine learning and AI, and are eager to leverage your skills to enrich the lives of millions across the globe? Join us at Ring AI team, where we're not just offering a job, but an opportunity to revolutionize safety and convenience in our neighborhoods through innovation.\n\nYou will be part of a dynamic team dedicated to pushing the boundaries of computer vision, machine learning and AI to deliver an unparalleled user experience for our neighbors. This position presents an exceptional opportunity for you to pioneer and innovate in AI, making a profound impact on millions of customers worldwide. You will partner with world-class AI scientists, engineers, product managers and other experts to develop industry-leading AI algorithms and systems for a diverse array of Ring and Blink products, enhancing the lives of millions of customers globally. Join us in shaping the future of AI innovation at Ring and Blink, where exciting challenges await!\n\nKey job responsibilities\nResearch and implement the state-of-the-art computer vision and machine learning methods to deliver high-quality artifacts that meets product specifications.\nEstablish scalable, efficient, automated processes for large-scale data analysis, machine-learning model development, model validation and gap analysis.\nProvide technical leadership and research new machine learning approaches to drive continued scientific innovation.\nWork in a collaborative environment with other scientists, engineers, product managers and cross-functional teams.\nMentor and develop junior scientists on the team\nBASIC QUALIFICATIONS\n3+ years of building models for business application experience\nPhD, or Master's degree and 4+ years of CS, CE, ML or related field experience\nExperience in patents or publications at top-tier peer-reviewed conferences or journals\nExperience programming in Java, C++, Python or related language\nExperience in any of the following areas: algorithms and data structures, parsing, numerical optimization, data mining, parallel and distributed computing, high-performance computing\nPREFERRED QUALIFICATIONS\nExperience using Unix/Linux\nExperience in professional software development\n\nAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\n\nLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\n\nOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $136,000/year in our lowest geographic market up to $223,400/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site."
  },
  {
    "title": "AI/ML Engineer",
    "company": "General Motors",
    "location": "Hybrid work in San Francisco, CA",
    "salary": "$118,000 - $188,400 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0BqJjBsvJkVIRVupdyx-l7jJlkPL5nU6SVET5Mq4mDejegpz4R4z9X6QNcQ1GgqKr52FoFZAej3CEuCsw3--cnmn9yQP4-jK0Jyhs1a-lYOWKIFYtUOf_NpTp3XEpnLezfugqZX1TPdIKGvbcAa0FN8Y9tapjzTjROeLqxi2q6MbRN4xkQzjKLLQ5qbXq81Hr8CO44lOLUJBk79ayuaI2pXlF51rsF7Rgl1xHILpwvzo_nMBYVGDJxZc-bh4zmdfFQdcZLoFfMFUIWhssc1-vp2CrABXrUEDBTW8xki9tVNyKNvIPOlNJzvsEnaiAANUG_WrJtfb6gAVZZf8ztemwO6mwv4MPLbCPixbvF3zJ31uHC7iU6nODeJDv4W1Altl8AcPJlnv8MSfq7ukbaELrtl9D-5wx_nwROxLL6NmVp0nrSpaeYDQFHhVxumipZgmk-L9qRIjOw6fgzZ2lFtr8xXNGGhEUXPfnT3un8Zxp1KqBos2rDYXc4CyQGVw--1zhURM4tHlRRecTe-UucojoEYDtL0BlpbTXFgB-P79B_GPDdRvygavBDe7Lw4FlYBHJbKlJmQEr9qfBZzdKeeqtpeGvASBgV3iiwYI0f7URKBBRM6PHaW_ds0Ib0UC1PSwublpTZPCnyQlNWIcvaKtAwPxqaZ-1c8xgMwiMSUOH7_7tJH69A3Mb_AEYteE9grRnoW0RKMDtfS8y9BTzZ3JZVihg317bwBmkMh1bvCNI-wy-esoDpAxZmNzRNoEHRWWAr3A6SscKUNM3RLL02PDdsE1YN5-aZePDpTNAxiAXUNaf3f5YbqnKxNs8qyVOcu_MyXN8LPY2TiiJDnqZfETrOYHRxxUbrDdpo=&xkcb=SoAy6_M3sYoylsSMbJ0ObzkdCdPP&camk=nUmJqO2E8rh8JLMt8M-EVQ==&p=5&fvj=0&vjs=3",
    "description": "Job Description\nRole: As a n AI/ML Engineer on the Metrics Frameworks team, part of the Sim ulation, Evaluation, and Data organization, you will be an individual contributor focused on developing and optimizing infrastructure to accelerate autonomous vehicle development, testing, and deployment by creating specialized ana lytics frameworks and tools. We are seeking experienced software engineers to build ana lytical frameworks and tools that empower internal users to construct quantitative ana lysis pipelines and develop metrics. These metrics will support and accelerate feature design, prioritization, and development, as well as evaluate the impact of recently released features. Our ana lytics framework equally supports road event monitoring, data mining and training, and sim ulation metrics.\nAbout the Organization: The Simulation, Evaluation, and Data organization is dedicated to advancing the development of autonomous vehicles through cutting-edge simulation technologies. The Metrics Frameworks team within this organization focuses on creating, maintaining , and evolving the analytics framework that supports GM's goal of safe, high-performing, and scalable driverless technology. The team delivers robust and scalable tools that facilitate data-driven decision-making throughout the AV feature development lifecycle. We collaborate closely with Simulation Evaluation, Embodied AI, and System and Test Engineering teams to enhance productivity across the organization by developing automation tools and shared libraries for all engineering teams. We are accountable for the performance, reliability, and scalability OKRs of the analytics framework. This includes, but is not limited to, developing customized analytics workflows, improving operational telemetry and dashboards to track relevant KPIs for prioritization, and identifying, designing, and implementing solutions to achieve key results.\nWhat You’ll Do:\nCreate tooling that can receive signals from various sources ( Sim ulation, Road, etc ) and allow users to easily build quantitative ana lysis pipelines to extract usable insights.\nAccelerate team’s effectiveness and efficiency by designing and implementing scalable automation tools for test creation, data collection and ana lysis, debugging, and performance monitoring.\nDesign and implement extensible and well-tested shared libraries that will be used by many engineers across the organization.\nCollaborate with other frameworks and data i nfra teams to build and deploy tools to improve productivity.\nWork closely with autonomous vehicle engineering to enable rapid development and model feedback.\nMaintain a high technical standard for code quality on the team, through architectural design and code reviews.\nYour Skills & Abilities:\nExperience developing scalable software solutions that will be used by many developers\nExperience writing Python and C++ in a production environment (unit testing, code review, algorithm performance and tradeoffs, etc.)\nExperience developing automation scripts (Python and Bash scripts)\nBS in Computer Science, Electrical Engineering, Mechanical Engineering, or Aerospace Engineering\n5+ years of industry experience\nStrong organizational and communication skills\nWhat Will Give You A Competitive Edge:\nExperience with SQL and related tools/tech (Big Query, DuckDB , etc )\nExperience with time-series data ana lysis and online performance monitoring tools\nExperience building high performance framework / infrastructure and performance optimization in C++/Python\nFamiliarity with ROS, Pandas, Python bindings for C++, and plotting/visualization libraries\nFamiliarity with Data orchestration and transformation tools like AirTable, AirFlow , DBT, etc\nCompensation : The salary range for this role is ($118,000 and $188,400). The actual base salary a successful candidate will be offered within this range will vary based on factors relevant to the position.\nHybrid: This role is categorized as hybrid. This means the successful candidate is expected to report to the Mountain View, San Francisco, Warren or Milford Technical Center three times per week, at minimum.\n&#xa;&#xa;\nAbout GM\nOur vision is a world with Zero Crashes, Zero Emissions and Zero Congestion and we embrace the responsibility to lead the change that will make our world better, safer and more equitable for all.\nWhy Join Us\nWe believe we all must make a choice every day – individually and collectively – to drive meaningful change through our words, our deeds and our culture. Every day, we want every employee to feel they belong to one General Motors team.\nBenefits Overview\nFrom day one, we're looking out for your well-being–at work and at home–so you can focus on realizing your ambitions. Learn how GM supports a rewarding career that rewards you personally by visiting Total Rewards resources .\nNon-Discrimination and Equal Employment Opportunities (U.S.)\nGeneral Motors is committed to being a workplace that is not only free of unlawful discrimination, but one that genuinely fosters inclusion and belonging. We strongly believe that providing an inclusive workplace creates an environment in which our employees can thrive and develop better products for our customers.\nAll employment decisions are made on a non-discriminatory basis without regard to sex, race, color, national origin, citizenship status, religion, age, disability, pregnancy or maternity status, sexual orientation, gender identity, status as a veteran or protected veteran, or any other similarly protected status in accordance with federal, state and local laws.\nWe encourage interested candidates to review the key responsibilities and qualifications for each role and apply for any positions that match their skills and capabilities. Applicants in the recruitment process may be required, where applicable, to successfully complete a role-related assessment(s) and/or a pre-employment screening prior to beginning employment. To learn more, visit How we Hire .\nAccommodations\nGeneral Motors offers opportunities to all job seekers including individuals with disabilities. If you need a reasonable accommodation to assist with your job search or application for employment, email us or call us at 800-865-7580. In your email, please include a description of the specific accommodation you are requesting as well as the job title and requisition number of the position for which you are applying."
  },
  {
    "title": "Staff ML Engineer, ML Compute Platform",
    "company": "General Motors",
    "location": "Mountain View, CA",
    "salary": "$195,000 - $298,000 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0BqJjBsvJkVIRVupdyx-l7jJlkPL5nU6SVET5Mq4mDejegpz4R4z9X6QNcQ1GgqKr7EuADWGqYvBURgIRoRj0G0JsN4aUudNZHKTev4Wn_U5IetS3E9vgWQEpOUtZUfPqbOj1c0i_WwLHIyWblWwHGEms2VrfENDGktfDdqgjwuVTK7EHQiSMNQVpCz99p9v3u7Ma4WJivOMKVQIs53gyE4d3tP23DvcUtecwx4m3EWXM_NTNnPqHdGVTOlp6n0Dkr7oxTmhYGh6XVt6oJR06nYbU7WQdxUXuyKuES13YDUo3BXZ6SEaF9cnOQOhlQeMCgXcrww_bbXroCpHAyB9C8yfpkYeOfv3KZCjWfa-7KpLntGaQN27Q1UXQd1hGVyb2evGH-F0Lu5Ja-kUq09d2_KJ0of8PFwd0RMXubSb56WqP2gFgClLNoubOPgarRbfM4dLJi8bVjqD5VKlj_4ldYsAIVWOCvOGb231CXBHoh9RgL6b8XfS4XM7FaGSC0n693QfVTX_Y7wemr47yGBwYTOzRgdDL5Gfju4f_dFnyvNKXYmfrum7gez9Zas0bv73ga3G-w1rY86gv1oCs6Uf2GGaeNeAYIiWca7uqFTzWvcgyVY-yhVsjXA6D42zyp9p_Id2tpMSZ-sEjyS457ovdWtuaNrVuck6lqllh-tsVrVB5lNPtwlx00TIACNh0MdA1SeAlE1c-zbVClJfc9hMJJRHQuAdLwzvo4oouQ09U7ejIzX5JlWP5Yd6FSJWtLGH-hbQPbh81J1JYy_9V7PlIJWknQbM043Rd4L8pLOsWHfgGlAwOvczx1n&xkcb=SoDb6_M3sYoylsSMbJ0BbzkdCdPP&camk=nUmJqO2E8rh8JLMt8M-EVQ==&p=10&fvj=0&vjs=3",
    "description": "Job Description\nHybrid This role is categorized as hybrid. This means the successful candidate is expected to report to the GM Global Technical Center - Cole Engineering Center Podium or Mountain View Technical Center , CA at least three times per week, at minimum or other frequency dictated by the business. This job is eligible for relocation assistance.\nAbout the Team:\nThe ML Compute Platform is part of the AI Compute Platform organization within Infrastructure Platforms. Our team owns the cloud-agnostic, reliable, and cost-efficient compute backend that powers GM AI. We’re proud to serve as the AI infrastructure platform for teams developing autonomous vehicles (L3/L4/L5), as well as other groups building AI-driven products for GM and its customers. We enable rapid innovation and feature development by optimizing for high-priority, ML-centric use cases. Our platform supports the training and deployment of state-of-the-art (SOTA) machine learning models with a focus on performance, availability, concurrency, and scalability. We’re committed to maximizing GPU utilization across platforms (B200, H100, A100, and more) while maintaining reliability and cost efficiency.\nAbout the Role:\nWe are seeking a Staff ML Engineer to help build and scale robust compute platforms for ML workflows. In this role, you’ll work closely with ML engineers and researchers to ensure efficient model training and seamless deployment into production. This is a high-impact opportunity to influence the future of AI infrastructure at GM.\nYou will play a key role in shaping the user-facing experience of the platform, ensuring that ML practitioners can discover, schedule, and debug jobs with ease. The ideal candidate brings experience in designing distributed systems for ML, strong problem-solving skills, and a product mindset focused on platform usability and reliability.\nWhat you’ll be doing:\nDesign and implement core platform backend software components\nExperience cloud platforms like GCP, Azure or on-prem\nCollaborate with ML engineers and researchers to understand platform pain points and improve developer experience\nThrive in a dynamic, multi-tasking environment with ever-evolving priorities. Interface with other teams to incorporate their innovations and vice versa\nAnalyze and improve efficiency, scalability, and stability of various system resources\nLead large-scale technical initiatives across GM’s ML ecosystem\nHelp raise the engineering bar through technical leadership and best practices\nContribute to and potentially lead open source projects; represent GM in relevant communities\nRequirements\n8+ years of industry experience\nExpertise in either Go, C++, Python or other relevant coding languages\nStrong background with kubernetes at scale\nRelevant experience building large-scale with distributed systems\nExperience leading and driving large scale initiatives\nExperience working with Google Cloud Platform, Microsoft Azure, or Amazon Web Services\nPreferred Qualifications\nHands-on experience building ML infrastructure platforms with strong developer/user experience\nExperience working with or designing job orchestration interfaces, CLI tools, or web UIs for ML workflows\nFamiliarity with observability, telemetry, and user feedback loops to inform product improvements\nExperience with GPU/TPU optimizations\nExperience with training frameworks like PyTorch, TorchX\nExperience with Ray framework\nLeadership/active participation in the open source community\nExperience infrastructure applications or similar experience\nWhy Join Us?\nIf you’re excited to tackle some of today’s most complex engineering challenges, see the impact of your work in real-world AV applications, and help shape the future of AI infrastructure at GM—this is the team for you.\nCompensation: The compensation information is a good faith estimate only. It is based on what a successful applicant might be paid in accordance with applicable state laws. The compensation may not be representative for positions located outside of New York, Colorado, California, or Washington\nCompensation: The expected base compensation for this role is : $195,000 - $298,000 Actual base compensation within the identified range will vary based on factors relevant to the position.\nBonus Potential: An incentive pay program offers payouts based on company performance, job level, and individual performance.\nBenefits: GM offers a variety of health and wellbeing benefit programs. Benefit options include medical, dental, vision, Health Savings Account, Flexible Spending Accounts, retirement savings plan, sickness and accident benefits, life insurance, paid vacation & holidays.\n#LI-EL1\n\n&#xa;&#xa;\nAbout GM\nOur vision is a world with Zero Crashes, Zero Emissions and Zero Congestion and we embrace the responsibility to lead the change that will make our world better, safer and more equitable for all.\nWhy Join Us\nWe believe we all must make a choice every day – individually and collectively – to drive meaningful change through our words, our deeds and our culture. Every day, we want every employee to feel they belong to one General Motors team.\nBenefits Overview\nFrom day one, we're looking out for your well-being–at work and at home–so you can focus on realizing your ambitions. Learn how GM supports a rewarding career that rewards you personally by visiting Total Rewards resources .\nNon-Discrimination and Equal Employment Opportunities (U.S.)\nGeneral Motors is committed to being a workplace that is not only free of unlawful discrimination, but one that genuinely fosters inclusion and belonging. We strongly believe that providing an inclusive workplace creates an environment in which our employees can thrive and develop better products for our customers.\nAll employment decisions are made on a non-discriminatory basis without regard to sex, race, color, national origin, citizenship status, religion, age, disability, pregnancy or maternity status, sexual orientation, gender identity, status as a veteran or protected veteran, or any other similarly protected status in accordance with federal, state and local laws.\nWe encourage interested candidates to review the key responsibilities and qualifications for each role and apply for any positions that match their skills and capabilities. Applicants in the recruitment process may be required, where applicable, to successfully complete a role-related assessment(s) and/or a pre-employment screening prior to beginning employment. To learn more, visit How we Hire .\nAccommodations\nGeneral Motors offers opportunities to all job seekers including individuals with disabilities. If you need a reasonable accommodation to assist with your job search or application for employment, email us or call us at 800-865-7580. In your email, please include a description of the specific accommodation you are requesting as well as the job title and requisition number of the position for which you are applying."
  },
  {
    "title": "Staff ML Engineer, Inference Platform",
    "company": "General Motors",
    "location": "Mountain View, CA",
    "salary": "$195,000 - $298,000 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0BqJjBsvJkVIRVupdyx-l7jJlkPL5nU6SVET5Mq4mDejegpz4R4z9X6QNcQ1GgqKr7EuADWGqYvBRzq43NhkCFXdNCv-kXJg0ZhgwFFZH1zM1NzECbM85HGWU8RWR0DVT2haaB2al-guEY2Pfpc_G7KU4AN0rCz3lvqsbxG6I2OrzJawhx1ZiSKTSxXXmrzOCKSznzPaTS1p197tVRyNvc8SJ3h2eJYeRWCF37iNPS6cbUp80pcFtV1W-o_IBCPUIpdLGOM5_GCPYREyxY5N20tv8mNPozG4QEhHSgrb8vJuTXjnQJ5Kl9QSUbTvIksxuAImIwpqSRd-kONzZsuBortvVsKHy_4brNdniTaHhu27FWgETH5xa_6dE5sfcGpFyZtzHZBtgbwMFgpDCvwsudNuKRJCTVCnrxal4EQtGBLMnEXUAhaUyuLpYAx9T7F-lSWa9BmBwdwaLCxnFbJuyV9hwUNpn7VXv9JVELTYbKxqag_dThmG2nQzKGU-wkKb2l_J31UabjzUKzqmzgCRb6a5SF9dn2GQ32HzXTpKidG5OJEGyJp2C7z8Pe1MMkSdiHdYvCHcR6yGCpxdNt8L1upzvmKYWZENFB3ebBn8A03KV_uUfQZsvnmvaT9YLOKX74EDnpKhOJ8vdvN03rPX5LoeMU4JGattn8g4C79vclyM4k_kgJw-uRaL64esPUAX7WyTOh9SUPew26gBx-zk3syof1-NLmTDJXyEJvDQ7diKmaS77wOiwh9cvC8UtMh7ObOTroLEeYJ3X2KZyFkW1SRNATrXhzz8Ds9V7vGHm-tys-nV9WVDQ57&xkcb=SoCv6_M3sYoylsSMbJ0NbzkdCdPP&camk=nUmJqO2E8rh8JLMt8M-EVQ==&p=6&fvj=0&vjs=3",
    "description": "Job Description\nHybrid This role is categorized as hybrid. This means the successful candidate is expected to report to the GM Global Technical Center - Cole Engineering Center Podium , MI or Mountain View Technical Center , CA at least three times per week, at minimum or other frequency dictated by the business. This job is eligible for relocation assistance.\nAbout the Team:\nThe ML Inference Platform is part of the AI Compute Platforms organization within Infrastructure Platforms. Our team owns the cloud-agnostic, reliable, and cost-efficient platform that powers GM’s AI efforts. We’re proud to serve as the AI infrastructure platform for teams developing autonomous vehicles (L3/L4/L5), as well as other groups building AI-driven products for GM and its customers. We enable rapid innovation and feature development by optimizing for high-priority, ML-centric use cases. Our platform supports the serving of state-of-the-art (SOTA) machine learning models for experimental and bulk inference, with a focus on performance, availability, concurrency, and scalability. We’re committed to maximizing GPU utilization across platforms (B200, H100, A100, and more) while maintaining reliability and cost efficiency.\nAbout the Role:\nWe are seeking a Staff ML Infrastructure engineer to help build and scale robust Compute platforms for ML workflows. In this role, you’ll work closely with ML engineers and researchers to ensure efficient model serving and inference in production, for their workflows such as data mining, labeling, model distillation, simulations and more. This is a high-impact opportunity to influence the future of AI infrastructure at GM. You will play a key role in shaping the architecture, roadmap and user-experience of a robust ML inference service supporting real-time, batch, and experimental inference needs. The ideal candidate brings experience in designing distributed systems for ML, strong problem-solving skills, and a product mindset focused on platform usability and reliability.\nWhat you’ll be doing:\nDesign and implement core platform backend software components.\nCollaborate with ML engineers and researchers to understand critical workflows, parse them to platform requirements, and deliver incremental value.\nLead technical decision-making on model serving strategies, orchestration, caching, model versioning, and auto-scaling mechanisms.\nDrive the development of monitoring, observability, and metrics to ensure reliability, performance, and resource optimization of inference services.\nProactively research and integrate state-of-the-art model serving frameworks, hardware accelerators, and distributed computing techniques.\nLead large-scale technical initiatives across GM’s ML ecosystem.\nRaise the engineering bar through technical leadership, establishing best practices.\nContribute to open source projects; represent GM in relevant communities.\nMinimum Requirements\n8+ years of industry experience, with focus on machine learning systems or high performance backend services.\nExpertise in either Go, Python, C++ or other relevant coding languages.\nExpertise in ML inference, model serving frameworks (triton, rayserve, vLLM etc).\nStrong communication skills and a proven ability to drive cross-functional initiatives.\nExperience working with cloud platforms such as GCP, Azure, or AWS.\nAbility to thrive in a dynamic, multi-tasking environment with ever-evolving priorities.\nPreferred Qualifications\nHands-on experience building ML infrastructure platforms for model serving/inference.\nExperience working with or designing interfaces, apis and clients for ML workflows.\nExperience with Ray framework, and/or vLLM.\nExperience with distributed systems, and handling large-scale data processing.\nFamiliarity with telemetry, and other feedback loops to inform product improvements.\nFamiliarity with hardware acceleration (GPUs) and optimizations for inference workloads.\nContributions to open-source ML serving frameworks.\nWhy Join Us?\nIf you’re excited to tackle some of today’s most complex engineering challenges, see the impact of your work in real-world AV applications, and help shape the future of AI infrastructure at GM—this is the team for you.\nCompensation: The compensation information is a good faith estimate only. It is based on what a successful applicant might be paid in accordance with applicable state laws. The compensation may not be representative for positions located outside of New York, Colorado, California, or Washington\nCompensation: The expected base compensation for this role is : $195,000 - $298,000 Actual base compensation within the identified range will vary based on factors relevant to the position.\nBonus Potential: An incentive pay program offers payouts based on company performance, job level, and individual performance.\n&#xa;&#xa;&#xa;&#xa;\nAbout GM\nOur vision is a world with Zero Crashes, Zero Emissions and Zero Congestion and we embrace the responsibility to lead the change that will make our world better, safer and more equitable for all.\nWhy Join Us\nWe believe we all must make a choice every day – individually and collectively – to drive meaningful change through our words, our deeds and our culture. Every day, we want every employee to feel they belong to one General Motors team.\nBenefits Overview\nFrom day one, we're looking out for your well-being–at work and at home–so you can focus on realizing your ambitions. Learn how GM supports a rewarding career that rewards you personally by visiting Total Rewards resources .\nNon-Discrimination and Equal Employment Opportunities (U.S.)\nGeneral Motors is committed to being a workplace that is not only free of unlawful discrimination, but one that genuinely fosters inclusion and belonging. We strongly believe that providing an inclusive workplace creates an environment in which our employees can thrive and develop better products for our customers.\nAll employment decisions are made on a non-discriminatory basis without regard to sex, race, color, national origin, citizenship status, religion, age, disability, pregnancy or maternity status, sexual orientation, gender identity, status as a veteran or protected veteran, or any other similarly protected status in accordance with federal, state and local laws.\nWe encourage interested candidates to review the key responsibilities and qualifications for each role and apply for any positions that match their skills and capabilities. Applicants in the recruitment process may be required, where applicable, to successfully complete a role-related assessment(s) and/or a pre-employment screening prior to beginning employment. To learn more, visit How we Hire .\nAccommodations\nGeneral Motors offers opportunities to all job seekers including individuals with disabilities. If you need a reasonable accommodation to assist with your job search or application for employment, email us or call us at 800-865-7580. In your email, please include a description of the specific accommodation you are requesting as well as the job title and requisition number of the position for which you are applying."
  },
  {
    "title": "Principal Machine Learning Engineer - AI Research",
    "company": "General Motors",
    "location": "Mountain View, CA",
    "salary": "$259,000 - $320,000 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0BqJjBsvJkVIRVupdyx-l7jJlkPL5nU6SVET5Mq4mDejegpz4R4z9X6QNcQ1GgqKr6Ds8UdfjSzrFL4g6bQENP9TPldSNhjWUcS97c9IhlJHKJr9QKTTR9zEgf8fjIVbcnsSDHwGeVa6HwmQ1IL4pJoCbR-3WB0pxOqztU3JqdSvqKqeYdPo1vU2hnB5TXLIe64cMlimI9ADg8ZMuKq5rtN93ZJG4PbPNkJj9xvSUpIHMb222MSj33RNdocwzdQJXCmX7kCH4PavvAckI6miU5SdoF6YKydEw4K3G5FnhnfoWEwlZaiJ1ORvZpIX7aPG7e5gMS6PUy5Ho-lqhm2hrHnEsOrBN0NTd0Kq1dekqfvPkuDcl4-BDYrWMrToIeUotfd3x0v2Wb6ll97OvAyYWyWeEH8hqTjsojYKXciHkoRgSFd7TWc-wzbslLZ1A59GIXcDWbXQr_1fvDI6qBr45LgZnTtB3KHKw_t4RTaYW5PdFphzAUL1o1H-Br-xL-oDimrT4mx2vDejsUoBavgxJYKPi3QwRF9Q_TZJzsPEKpO962OJAsCVtF-plDm_huQAiyXEQizew7P0lMioE4IcPFdM_AOmCiqWVUSuFqgr3zXN8eVhSd1DPfYu6hFxYS9V_TX6Rbywgkt_G9lTC69rDYSC8KpPa5oDC87AAsj2i2_zVs9-mJaOU8CacVCrXcEUpVYQN4UrmIyZmLB-XjLGOd795E0ATztmLBiLh5kvR3fof7y6TmJCBkQLkhTIByT3m_9iB7gvAhaGRFXpkMU3zvZBzYKvQxoSI1aduDpZgfVJFR1cAgPx_7XWhZaDTtI_ct4DwCmth_s-w==&xkcb=SoCV6_M3sYoylsSMbJ0LbzkdCdPP&camk=nUmJqO2E8rh8JLMt8M-EVQ==&p=0&fvj=0&vjs=3",
    "description": "Job Description\nOur AI Research team, reporting directly to the Chief AI Officer, is pioneering how cutting-edge machine learning can transform the way vehicles are designed, manufactured, and experienced. We are building the next generation of intelligent systems—integrating multimodal foundation models, generative AI, and robotics into real-world automotive innovation at global scale.\nAs a Principal Machine Learning Engineer – AI Research, you will serve as a senior technical leader guiding GM’s most ambitious AI initiatives. You will lead the design, prototyping, and deployment of state-of-the-art AI models with direct application to vehicle design, manufacturing operations, robotics, and simulation of physical systems. Beyond technical execution, you will shape GM’s AI research agenda, mentor a world-class team of scientists and engineers, and represent GM in the global AI community.\nWhat You’ll Do\nYou will participate in a unique work environment which combines leading edge AI/ML research with immediate applications to exciting opportunities to make safer, more efficient cars. We have close working connections to world class engineers in the automotive design space to jointly develop novel applications of AI tools in this space.\nEvaluate, prototype and implement impactful AI solutions to design and manufacturing operations at GM. Potential applications include the use of foundation models to large scale design tasks, using generative AI technologies for defining robotics tasks and the application of generative AI to interface with , and develop new technologies for the design and modeling p hysical systems.\nDevelop plans and execute projects to integrate AI into GM’s manufacturing, vehicle design, software development, customer support and other products and processes\nBe on the forefront of AI models and architecture, making informed decisions on technology adoption and investment\nAssist with hiring and mentoring a team of gifted AI scientists and engineers .\nLead the research, design, and prototyping of advanced AI models (foundation models, generative AI, multimodal architectures) applied to automotive and robotics domains.\nTranslate breakthrough AI research into scalable, production-ready systems across design, manufacturing, software, and customer experience.\nDefine GM’s technical strategy for adopting and investing in AI technologies under the Chief AI Officer.\nMentor and grow a high-performing team of machine learning researchers and engineers.\nCollaborate with product, design, and engineering leaders to identify high-impact AI opportunities.\nRepresent GM externally through publications, open-source contributions, patents, and participation in leading AI conferences.\nYour Skills & Abilities (Required Qualifications)\nPhD or equivalent in CS/EE\n8+ years of experience in AI/ML research and applied development.\nDeep expertise in modern ML architectures (transformers, generative AI, multimodal systems).\nProven track record of leading AI projects from research to production at scale.\nStrong programming skills in Python and proficiency in one or more systems languages (C++/Go/Java).\nExperience deploying AI systems on cloud-based GPUs/TPUs (AWS, Azure, GCP).\nRecognized thought leader in the AI/ML community with demonstrated impact (research breakthroughs, patents, or widely adopted technologies).\nExceptional ability to mentor, influence, and collaborate across technical and business teams.\nW hat Will Give You A Competitive Edge (Preferred Qualifications)\nDemonstra ted expertise in developing and training multimodal foundation models\nDemo nstrated res earch impact in AI/ML technologies either through important publications in first tier conferences or demonstrated contribution to industry leading systems.\nThis role is categorized as hybrid . This means the successful candidate is expected to report to the MTV office three times per week or any other frequency dictated by the business.\nCompensation: The compensation information is a good faith estimate only. It is based on what a successful applicant might be paid in accordance with applicable state laws. The compensation may not be representative for positions located outside of New York, Colorado, California, or Washington.\nThe salary range for this role is 259,000 to 320,000. The actual base salary a successful candidate will be offered within this range will vary based on factors relevant to the position.\nBonus Potential: An incentive pay program offers payouts based on company performance, job level, and individual performance.\nBenefits: GM offers a variety of health and wellbeing benefit programs. Benefit options include medical, dental, vision, Health Savings Account, Flexible Spending Accounts, retirement savings plan, sickness and accident benefits, life insurance, paid vacation & holidays, tuition assistance programs, employee assistance program, GM vehicle discounts and more.\nCompany Vehicle : Upon successful completion of a motor vehicle report review, you will be eligible to participate in a company vehicle evaluation program, through which you will be assigned a General Motors vehicle to drive and evaluate.\nNote: program participants are required to purchase/lease a qualifying GM vehicle every four years unless one of a limited number of exceptions applies.\nRelocation: This job may be eligible for relocation benefits.\n#LI-CX1\n&#xa;&#xa;&#xa;&#xa;\nAbout GM\nOur vision is a world with Zero Crashes, Zero Emissions and Zero Congestion and we embrace the responsibility to lead the change that will make our world better, safer and more equitable for all.\nWhy Join Us\nWe believe we all must make a choice every day – individually and collectively – to drive meaningful change through our words, our deeds and our culture. Every day, we want every employee to feel they belong to one General Motors team.\nBenefits Overview\nFrom day one, we're looking out for your well-being–at work and at home–so you can focus on realizing your ambitions. Learn how GM supports a rewarding career that rewards you personally by visiting Total Rewards resources .\nNon-Discrimination and Equal Employment Opportunities (U.S.)\nGeneral Motors is committed to being a workplace that is not only free of unlawful discrimination, but one that genuinely fosters inclusion and belonging. We strongly believe that providing an inclusive workplace creates an environment in which our employees can thrive and develop better products for our customers.\nAll employment decisions are made on a non-discriminatory basis without regard to sex, race, color, national origin, citizenship status, religion, age, disability, pregnancy or maternity status, sexual orientation, gender identity, status as a veteran or protected veteran, or any other similarly protected status in accordance with federal, state and local laws.\nWe encourage interested candidates to review the key responsibilities and qualifications for each role and apply for any positions that match their skills and capabilities. Applicants in the recruitment process may be required, where applicable, to successfully complete a role-related assessment(s) and/or a pre-employment screening prior to beginning employment. To learn more, visit How we Hire .\nAccommodations\nGeneral Motors offers opportunities to all job seekers including individuals with disabilities. If you need a reasonable accommodation to assist with your job search or application for employment, email us or call us at 800-865-7580. In your email, please include a description of the specific accommodation you are requesting as well as the job title and requisition number of the position for which you are applying."
  },
  {
    "title": "Staff ML Engineer, ML Orchestration",
    "company": "General Motors",
    "location": "Mountain View, CA",
    "salary": "$195,000 - $298,000 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0BqJjBsvJkVIRVupdyx-l7jJlkPL5nU6SVET5Mq4mDejegpz4R4z9X6QNcQ1GgqKr7EuADWGqYvBXLMOlZ81tiJGQVZAhPLZNctfN_FK2OPlAjpRy2nScnTIwAcLoXjs8KGNlWmqnLAldqr3fDpraQjQgwuI4dysqH_iT58tZo5aJ5jazAkhYYs3oxQc1qhIFh4WWKn-uQYNfjUt3MgW_AXlau4Ny-TlEcw51Y6SDabcILUk77c-WncbttNGCNtyBOnkuBeZPVH5t-lXP0zm5cJ-Fx22R9D6QIaejyEVP73dTBfJAY1-EZRVZfzgEjqhs1tLIvZj5ljRtJOEeVeji1Z96UWQezaE7hSEAVfSuC-dl3OvblkklN4hkrWGaOENlunHPyupp3rc6y580VYT0A2651Uj3dRtkUjKp4o8BXMmdITaQAcnJycag_G75wATLCD3ljCNqIUJ5jxPPAzNjB6Djt2YE0uxD5KYOz8TjWqPB_tzMX0iCEDgh8eMs1bTb5xCh85RLKWycigV-8z6Tje3wK9IbK4S4-k0scsu0IP7-sisfra82wpgckmWYNHUWvkRBipT6xUHSAxdo20sPZDpnAMJeyztzbRyZ3FFmsnmxSbDxLfFIXizQB6AWa82cPRq_95lfs2pfIcXr6j_bEY_5bDs9cveZcJcTOtXGAQfiVTZoIGvakcpqcgMwV3YwCNlsRyDN8VnSMrCo02Y_NJ6Nbm8RMIwkfkDs2z5gSTbLzTJ8tcq4Uj4pKDBEE54cNTqZzul9XvhCPgwBR8Q5TeOsbqrQQ5Rmd0C9dkd1Lv-JaZHOF_TXEueVfrDtYQMuw=&xkcb=SoBv6_M3sYoylsSMbJ0AbzkdCdPP&camk=nUmJqO2E8rh8JLMt8M-EVQ==&p=11&fvj=0&vjs=3",
    "description": "Job Description\nJob Description\nHybrid This role is categorized as hybrid. This means the successful candidate is expected to report to the GM Global Technical Center - Cole Engineering Center Podium or Mountain View Technical Center , CA at least three times per week, at minimum or other frequency dictated by the business. This job is eligible for relocation assistance.\nAbout the Team:\nThe ML Orchestration team at GM builds and maintains the foundational infrastructure that powers ML workflows across the company. Our core responsibility is the development and evolution of Roboflow , GM’s in-house semantic orchestration platform designed to streamline and scale complex ML pipelines, from experimentation to production. A key pillar of our work is AI Lineage —our capability to track, visualize, and understand the entire lifecycle of ML artifacts. This includes tracing the origin of data, model training runs, hyperparameters, code versions, and evaluation metrics. AI Lineage provides transparency, auditability, and reproducibility across our ML systems, which is essential for debugging, model governance, regulatory compliance, and improving long-term model quality. Together, Roboflow and AI Lineage help our engineers move faster with higher confidence, enabling GM to iterate quickly while maintaining the safety and performance standards required for autonomous vehicle development.\nPosition Overview:\nWe are seeking an experienced Staff Machine Learning Engineer to drive key initiatives within our ML Orchestration team. In this role, you will be instrumental in scaling our internal ML platform, building automation and self-service tools, and ensuring the reliability and efficiency of large-scale ML pipelines across GM. A major focus area for this role is the development and evolution of AI Lineage —our system for capturing, querying, and visualizing the full lifecycle of machine learning artifacts. You will help design lineage tracking for data transformations, model training, evaluation runs, and pipeline dependencies. This functionality is critical for enabling transparency, reproducibility, debugging, and regulatory compliance across our ML ecosystem.\nPlease note : This is an ML infrastructure engineering role. It does not involve training or applying machine learning models to specific business problems. Instead, your impact will come from building core infrastructure products that empower hundreds of ML and data science practitioners at GM to experiment, deploy, and manage ML workflows at scale.\nWhat You’ll Be Doing\nDesign & Implementation : Architect, implement, and test scalable, cloud-native distributed systems using modern cloud platforms such as Google Cloud Platform (GCP) or Microsoft Azure. Build robust infrastructure to support large-scale ML workflows and data processing at GM.\nProject Ownership: Lead technical projects end-to-end—from early design through production deployment. Shape the product roadmap and drive key architectural decisions, balancing performance, reliability, and long-term maintainability.\nCross-Team Collaboration : Actively participate in design reviews, team planning, and code reviews. Collaborate across multiple engineering teams to deliver cohesive platform solutions. Anticipate integration points and proactively manage dependencies and trade-offs.\nMentorship & Recruiting: Foster a culture of technical excellence and growth. Interview candidates using calibrated evaluation criteria, onboard new hires, and mentor engineers and interns to help them grow technically and professionally.\nMinimum Qualifications\n8+ years of industry experience, with a strong focus on large-scale distributed systems or cloud infrastructure.\n3+ years of experience leading and delivering complex technical initiatives across teams.\nStrong programming skills in Python, C++, Go, or similar languages, with demonstrated experience building production-grade systems.\nHands-on experience working with relational and NoSQL databases.\nProven ability to design, build, and maintain highly scalable systems in production environments.\nBachelor’s, Master’s, or Ph.D. in Computer Science, Electrical Engineering, Mathematics, Physics, or a related field—or equivalent practical experience.\nDeep attention to detail, strong problem-solving skills, and a track record of building high-quality systems.\nPassion for autonomous vehicles, infrastructure engineering, and advancing the state of ML platforms.\nAdaptability and a startup mindset—comfortable working in ambiguity and stepping outside your core responsibilities when needed.\nPreferred Qualifications\nExperience with GCP, Azure, or AWS cloud platforms.\nFamiliarity with open-source ML orchestration tools such as Kubeflow, Flyte, Airflow, or similar platforms.\nExperience with Kubernetes and container orchestration at scale.\nUnderstanding of ML pipelines, data lineage, model lifecycle management, and reproducibility challenges in machine learning systems.\nStrong proficiency in one or more of Python, C++, or Golang.\nContributions to open-source projects or relevant technical publications.\nWhy Join Us?\nIf you’re excited to tackle some of today’s most complex ML Infra engineering challenges, see the impact of your work in real-world AV applications, and help shape the future of AI infrastructure at GM—this is the team for you.\nCompensation: The compensation information is a good faith estimate only. It is based on what a successful applicant might be paid in accordance with applicable state laws. The compensation may not be representative for positions located outside of New York, Colorado, California, or Washington\nCompensation: The expected base compensation for this role is : $195,000 - $298,000 Actual base compensation within the identified range will vary based on factors relevant to the position.\nBonus Potential: An incentive pay program offers payouts based on company performance, job level, and individual performance.\nBenefits: GM offers a variety of health and wellbeing benefit programs. Benefit options include medical, dental, vision, Health Savings Account, Flexible Spending Accounts, retirement savings plan, sickness and accident benefits, life insurance, paid vacation & holidays.\n#LI-EL1\n&#xa;&#xa;&#xa;&#xa;\nAbout GM\nOur vision is a world with Zero Crashes, Zero Emissions and Zero Congestion and we embrace the responsibility to lead the change that will make our world better, safer and more equitable for all.\nWhy Join Us\nWe believe we all must make a choice every day – individually and collectively – to drive meaningful change through our words, our deeds and our culture. Every day, we want every employee to feel they belong to one General Motors team.\nBenefits Overview\nFrom day one, we're looking out for your well-being–at work and at home–so you can focus on realizing your ambitions. Learn how GM supports a rewarding career that rewards you personally by visiting Total Rewards resources .\nNon-Discrimination and Equal Employment Opportunities (U.S.)\nGeneral Motors is committed to being a workplace that is not only free of unlawful discrimination, but one that genuinely fosters inclusion and belonging. We strongly believe that providing an inclusive workplace creates an environment in which our employees can thrive and develop better products for our customers.\nAll employment decisions are made on a non-discriminatory basis without regard to sex, race, color, national origin, citizenship status, religion, age, disability, pregnancy or maternity status, sexual orientation, gender identity, status as a veteran or protected veteran, or any other similarly protected status in accordance with federal, state and local laws.\nWe encourage interested candidates to review the key responsibilities and qualifications for each role and apply for any positions that match their skills and capabilities. Applicants in the recruitment process may be required, where applicable, to successfully complete a role-related assessment(s) and/or a pre-employment screening prior to beginning employment. To learn more, visit How we Hire .\nAccommodations\nGeneral Motors offers opportunities to all job seekers including individuals with disabilities. If you need a reasonable accommodation to assist with your job search or application for employment, email us or call us at 800-865-7580. In your email, please include a description of the specific accommodation you are requesting as well as the job title and requisition number of the position for which you are applying."
  },
  {
    "title": "Staff Machine Learning Engineer – AI Research",
    "company": "General Motors",
    "location": "Mountain View, CA",
    "salary": "$198,000 - $250,000 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0BqJjBsvJkVIRVupdyx-l7jJlkPL5nU6SVET5Mq4mDejegpz4R4z9X6QNcQ1GgqKr74LPBySs5qAr0qs2kOEWlO9sJKmOU1I0o1a1STh75sAUxkjhWYTjSG0Xz4mxO6oLG0C_TDCB9Z5yI05KcHH3h65__q7SZkHfJ69HavBV-PA-T9_AP5O0-rm4vIwUTxVLGg0iSvXwiNj3W7YnP5FK9O1094t1f62A85xfRPMT8UPin5Q2PEek-IxtjuSzkyBMxJS0T5TFMViqx4gwEDdGKAPRpYs0VDn0-PHcdgWAm6hFcm0Z9t9jYXH-88JntBd_ZvAwjUnpKauqCwDiX6YXpjycgXlzJtwUo7sAKv1GENN7OqcKFxuHQmo4ecz1WxLJFXfKScujlKWjzWSFmsUah1tQ3Ln6chbLJjOE_NiyjMzj57E_4h3fdXbEqaF4iPlAb5LRSrZIp_QloGI9oDJO7XJAC7mRi-qUH5AVWkOjZxjnEczAF7QGDAF422KLlB2M47yCWqIvr24ofwz1dFzc9-XxJXApCIHvhhf9HmYBI_phQ7So5LPeGyttn4-8x-QfzUOBvi0qIin8ggHwG6SNhwZL2QNM2RWNomcMgtea4N5RWKXaJtENTdo4S5fqoGCNnWjkfMJOGyJ0u7Kl8Z69FE8f2kSbAB-2BzrI-8ewLgFW3T2EebzLp0lMdlnZrhK4J9whKUEgjdvTnZDdDqs4YevFTmZDs69QK0Dg9JfE7ZGfTY_Aino7rGXO9NX1rpnnYcA_328Ev7dyYfSGHAJw1f_svgTjRViqcdzwOyDDgNjlOxculIUW2m_Ni4fGw529k=&xkcb=SoC86_M3sYoylsSMbJ0JbzkdCdPP&camk=nUmJqO2E8rh8JLMt8M-EVQ==&p=2&fvj=0&vjs=3",
    "description": "Job Description\nOur AI Research team, reporting directly to the Chief AI Officer, is pioneering how cutting-edge machine learning can transform the way vehicles are designed, manufactured, and experienced. We are building the next generation of intelligent systems—integrating multimodal foundation models, generative AI, and robotics into real-world automotive innovation at global scale.\nAs a Staff Machine Learning Engineer on the AI Research team, you will serve as a founding member guiding GM’s most ambitious AI initiatives. You will participate in the design, prototyping, and deployment of state-of-the-art AI models with direct application to vehicle design, manufacturing operations, robotics, and simulation of physical systems. Beyond technical execution, you will shape and implement GM’s AI research agenda, join a world-class team of scientists and engineers, and represent GM in the global AI community.\nWhat You’ll Do\nYou will participate in a unique work environment which combines leading edge AI/ML research with immediate applications to exciting opportunities to make safer, more efficient cars. We have close working connections to world class engineers in the automotive design space to jointly develop novel applications of AI tools in this space.\nEvaluate, prototype and implement impactful AI solutions to design and manufacturing operations at GM. Potential applications include the use of foundation models to large scale design tasks, using generative AI technologies for defining robotics tasks and the application of generative AI to interface with , and develop new technologies for the design and modeling p hysical systems.\nDevelop plans and execute projects to integrate AI into GM’s manufacturing, vehicle design, software development, customer support and other products and processes\nBe on the forefront of AI models and architecture, making informed decisions on technology adoption and investment\nParticipating in the research, design, and prototyping of advanced AI models (foundation models, generative AI, multimodal architectures) applied to automotive and robotics domains.\nTranslate breakthrough AI research into scalable, production-ready systems across design, manufacturing, software, and customer experience.\nJoin a high-performing team of machine learning researchers and engineers.\nCollaborate with product, design, and engineering leaders to identify high-impact AI opportunities.\nRepresent GM externally through publications, open-source contributions, patents, and participation in leading AI conferences.\nYour Skills & Abilities (Required Qualifications)\nPhD or equivalent in CS/EE\n5+ years of experience in AI/ML research and applied development.\nDeep expertise in modern ML architectures (transformers, generative AI, multimodal systems).\nProven track record of leading AI projects from research to production at scale.\nStrong programming skills in Python and proficiency in one or more systems languages (C++/Go/Java).\nExperience deploying AI systems on cloud-based GPUs/TPUs (AWS, Azure, GCP).\nRecognized thought leader in the AI/ML community with demonstrated impact (research breakthroughs, patents, or widely adopted technologies).\nExceptional ability to mentor, influence, and collaborate across technical and business teams.\nW hat Will Give You A Competitive Edge (Preferred Qualifications)\nDemonstra ted expertise in developing and training multimodal foundation models\nDemo nstrated res earch impact in AI/ML technologies either through important publications in first tier conferences or demonstrated contribution to industry leading systems.\nThis role is categorized as hybrid. This means the successful candidate is expected to report to the MTV office three times per week or any other frequency dictated by the business.\nCompensation: The compensation information is a good faith estimate only. It is based on what a successful applicant might be paid in accordance with applicable state laws. The compensation may not be representative for positions located outside of New York, Colorado, California, or Washington.\nThe salary range for this role is 198,000 to 250,000. The actual base salary a successful candidate will be offered within this range will vary based on factors relevant to the position.\nBonus Potential: An incentive pay program offers payouts based on company performance, job level, and individual performance.\nBenefits: GM offers a variety of health and wellbeing benefit programs. Benefit options include medical, dental, vision, Health Savings Account, Flexible Spending Accounts, retirement savings plan, sickness and accident benefits, life insurance, paid vacation & holidays, tuition assistance programs, employee assistance program, GM vehicle discounts and more.\nCompany Vehicle : Upon successful completion of a motor vehicle report review, you will be eligible to participate in a company vehicle evaluation program, through which you will be assigned a General Motors vehicle to drive and evaluate.\nNote: program participants are required to purchase/lease a qualifying GM vehicle every four years unless one of a limited number of exceptions applies.\nRelocation: This job may be eligible for relocation benefits.\n#LI-CX1\n&#xa;&#xa;\nAbout GM\nOur vision is a world with Zero Crashes, Zero Emissions and Zero Congestion and we embrace the responsibility to lead the change that will make our world better, safer and more equitable for all.\nWhy Join Us\nWe believe we all must make a choice every day – individually and collectively – to drive meaningful change through our words, our deeds and our culture. Every day, we want every employee to feel they belong to one General Motors team.\nBenefits Overview\nFrom day one, we're looking out for your well-being–at work and at home–so you can focus on realizing your ambitions. Learn how GM supports a rewarding career that rewards you personally by visiting Total Rewards resources .\nNon-Discrimination and Equal Employment Opportunities (U.S.)\nGeneral Motors is committed to being a workplace that is not only free of unlawful discrimination, but one that genuinely fosters inclusion and belonging. We strongly believe that providing an inclusive workplace creates an environment in which our employees can thrive and develop better products for our customers.\nAll employment decisions are made on a non-discriminatory basis without regard to sex, race, color, national origin, citizenship status, religion, age, disability, pregnancy or maternity status, sexual orientation, gender identity, status as a veteran or protected veteran, or any other similarly protected status in accordance with federal, state and local laws.\nWe encourage interested candidates to review the key responsibilities and qualifications for each role and apply for any positions that match their skills and capabilities. Applicants in the recruitment process may be required, where applicable, to successfully complete a role-related assessment(s) and/or a pre-employment screening prior to beginning employment. To learn more, visit How we Hire .\nAccommodations\nGeneral Motors offers opportunities to all job seekers including individuals with disabilities. If you need a reasonable accommodation to assist with your job search or application for employment, email us or call us at 800-865-7580. In your email, please include a description of the specific accommodation you are requesting as well as the job title and requisition number of the position for which you are applying."
  },
  {
    "title": "Principal ML Engineer - Embodied AI",
    "company": "General Motors",
    "location": "Remote in Mountain View, CA",
    "salary": "$259,000 - $396,300 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0BqJjBsvJkVIRVupdyx-l7jJlkPL5nU6SVET5Mq4mDejegpz4R4z9X6QNcQ1GgqKr5GUJlKIdpNk0n_kMPdM0meoDQzaS1-Zgpy2dsZfk4bWE-bw852aFgNu4jJEvb7T_l1jUStF2NhimxJD1259EPEixPQa39TN4ZJKgtUUMizo9n_nKXt67eDrwH0DZn3xBxQlb4ZUvirp1cBmS_q6ttmBVDUn_xyBy7SXjyccPWe6Dhjxz2BDEhMgfHU7-zBSqj8Xo4Ta5WLx9g95gJDms7fs76qVcjcO-A_lfKNmZ4m9XAb0-lXC1I_nbOeg26Dw5tWcz8S_J_sOV-YNC31oFWeFdIYYmU3layrHtrd7H2bKXimQzRJk2qLCi9p3M6bf7CUR-dia9z_Dpnkt-aMBzOhCL4l03Q4uwlIcVqrzkcTloaGGjQTrjKxMxQ6va_GiicthCQsbj6zzgULQx1Q9FBo5cV08DN0rZSzs2WcZ2tdx6wMzvD4lKKaMsQQvCQwnfCrl7wVahqfXCQ01rdaRi_qbGKFIOAQL3OTqlgjpeTfAb2FJ3BtGX5Tcc2yzPDmZiQ9hrvPt-cUiYwtyiJPujeq9WqluZlrTLAH7qAY564Pcphv1kfmL-dt2Z--bwGmoOXeZWOX5jyo5AqkNOrrautflWx6QUp4iESA3zcWi97e2hNyzd5cgwJhKur2wiKqgIxcOL6Nxk8Pwhtep95Zu3VsvSLh1pqqa9tvu4fgQkyUGJUT3WLTmTzF7t1Od8JGUMO8eCfG4GnID2jbW2QA54n-66nFGFu5wsLNhPWnVS1I4iJ0VmplnyZ2r6dlatotJ3c=&xkcb=SoBG6_M3sYoylsSMbJ0CbzkdCdPP&camk=nUmJqO2E8rh8JLMt8M-EVQ==&p=9&fvj=0&vjs=3",
    "description": "Job Description\nRole: In t his role, you will be at the forefront of developing and deploying large-scale Foundation Models (FMs) that enhance our automotive technologies at General Motors focused on Autonomous Driving & Robotics. You will work closely with a dynamic team of AI and ML researchers, data scientists and engineers who are passionate about leveraging advanced AI techniques to drive innovation for L2, L3 and L4 applications . Your contributions will directly impact our ability to deliver cutting-edge solutions that meet the needs of our customers.\nWhat You'll Do:\nDesign and implement technologies t hat will deliver scaling laws for o ur Foundation Models for various applications .\nS cal e up foundation model pre-training with data to its maximum capacity – into billions+ of examples - across different sources , delivering the maximum value to the model through every additional example .\nDirectly work on or collaborate closely with teams that scale up training and eval infrastructure to handle multi-billion examples across distributed machines and GPUs , while providing efficient time to model checkpoint.\nCollaborate with cross-functional teams to integrate & built distillation recipes of Robotics foundation models for onboard driving models.\nConduct research and stay updated on the latest advancements in AI scaling frameworks and libraries .\nLead projects from ideation to deployment, documenting learnings and best practices along the way.\nMentor junior team members and contribute to a culture of knowledge sharing and continuous improvement.\nYour Skills & Abilities:\nBachelor’s, Master’s or PhD degree in Computer Science with a focus in Robotics and or Machine Learning, or a related field.\nProven experience working with large-scale Foundation Models, including LLMs, VLAs and vision-focused models .\nProven experience in solving data scaling challenges, ranging from data diversity, data quality and building best practices to incorporate multiple data sources in large models.\nProficiency in frameworks such as PyTorch , with experience in libraries like HuggingFace and OpenAI GPT\nProven experience in building and scaling large model training pipelines that are performant and enable quick iteration by distributed teams.\nStrong data processing skills using tools like Numpy , Pandas, and Apache Spark.\nExcellent communication skills to effectively collaborate with diverse teams and stakeholders.\nExperience deploying foundation models into production environments and understanding the end-to-end process.\nPrevious experience in Robotics or Autonomous Driving.\nCompensation : The compensation information is a good faith estimate only. It is based on what a successful applicant might be paid in accordance with applicable state laws. The compensation may not be representative for positions located outside of New York, Colorado, California, or Washington.\nThe salary range for this role is $259,000 to $396,300. The actual base salary a successful candidate will be offered within this range will vary based on factors relevant to the position.\nBonus Potential: An incentive pay program offers payouts based on company performance, job level, and individual performance.\nHybrid: This role is categorized as hybrid. This means the successful candidate is expected to report to the Mountain View Technical Center in the Bay Area three times per week, at minimum.\nRelocation: This job may be eligible for relocation benefits.\n&#xa;&#xa;\nAbout GM\nOur vision is a world with Zero Crashes, Zero Emissions and Zero Congestion and we embrace the responsibility to lead the change that will make our world better, safer and more equitable for all.\n&#xa;&#xa;\nWhy Join Us\nWe believe we all must make a choice every day – individually and collectively – to drive meaningful change through our words, our deeds and our culture. Every day, we want every employee to feel they belong to one General Motors team.\n&#xa;&#xa;\nBenefits Overview\nFrom day one, we're looking out for your well-being–at work and at home–so you can focus on realizing your ambitions. Learn how GM supports a rewarding career that rewards you personally by visiting Total Rewards Resources .\n&#xa;&#xa;\nNon-Discrimination and Equal Employment Opportunities (U.S.)\nGeneral Motors is committed to being a workplace that is not only free of unlawful discrimination, but one that genuinely fosters inclusion and belonging. We strongly believe that providing an inclusive workplace creates an environment in which our employees can thrive and develop better products for our customers.\nAll employment decisions are made on a non-discriminatory basis without regard to sex, race, color, national origin, citizenship status, religion, age, disability, pregnancy or maternity status, sexual orientation, gender identity, status as a veteran or protected veteran, or any other similarly protected status in accordance with federal, state and local laws.\nWe encourage interested candidates to review the key responsibilities and qualifications for each role and apply for any positions that match their skills and capabilities. Applicants in the recruitment process may be required, where applicable, to successfully complete a role-related assessment(s) and/or a pre-employment screening prior to beginning employment. To learn more, visit How we Hire .\n&#xa;&#xa;\nAccommodations\nGeneral Motors offers opportunities to all job seekers including individuals with disabilities. If you need a reasonable accommodation to assist with your job search or application for employment, email us or call us at 800-865-7580. In your email, please include a description of the specific accommodation you are requesting as well as the job title and requisition number of the position for which you are applying."
  },
  {
    "title": "Data Analytics Engineer (7432)",
    "company": "Advantest",
    "location": "San Jose, CA 95134 \n(North San Jose area)",
    "salary": "$129,650 - $200,400 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0C8jiqKEGoWO2id1L3-1Z5Xfd3JhYJqsYyt2bS0RrhsFk-6qUIg4sA3Wt489qx7QU1AH36nmkuLztwpg5eKaY1Z_cia5QVV6FabrHjNClaqdo96Ip3pQ59fpFsGjyPGAFYhAnc4MpHywsgg2wF14UCk-wtMJtuPdT4OwK3ZL5YTtRv-TeovTgscIRXpl6Xo5eXbRTrTm3BYu8aRebdUOQHw4ysff4CnMS6POTiLjHhsXtbqGI2Ind9bN6koK0Yw7NS6z5gmFFFTbbW5J4EWUehz1B7ahmeHNrKY1X-zyWVp0HxXc2HqB4BKUQAhyMncEyzyVgXwna6WCKHx0JE7sXjoUGjMu4fFmtQvaI1hklynL2IbazcY8J1AQ5cd38cRZAFpWizg8qO_I4boZ9_SZkE_sgpLlwciILhwjlkmVWjAqopxbmyqBNY-68hcXp-oZRKdDLFyM0_Li3aPu14o0p-v3OIaW8y5qFhNfRNklhYkgNdjYBEXwa4-5LiLL25qMBTMZR1hYcxnCc3odusGcbM7x9Wgb68QgRLTUhbiortvAEkf2jrNzWFO43Cq0thL9_UO7IFAlK28Wktq7DJ65u_WtMODcfLCrEGAouOHCE9kyQ98sQNzQYEJ6ttf4ExCoKw-Mjt-Vi_JPb1Cast5bCSgqP8h61RCwf618O7E-itkNIFloCufn5KiII0HKJVoPNo=&xkcb=SoBV6_M3sYoylsSMbJ0GbzkdCdPP&camk=4HOcmqOLYrCblNfdxE0f7Q==&p=13&fvj=0&vjs=3",
    "description": "Job Description\nAdvantest is seeking a versatile Senior Data Analytics Engineer to design, develop, and deploy data solutions that bridge infrastructure, analytics, and machine learning. In this individual contributor role, you will own the full lifecycle of data projects—from building scalable pipelines to developing predictive models—that empower semiconductor R&D, test, and operations teams. Due to the cross-functional nature of our team, you’ll collaborate closely with engineers, data scientists, and business stakeholders to deliver end-to-end solutions, leveraging both data engineering and ML/AI expertise.\nThis role is ideal for a hands-on engineer who thrives in a fast-paced environment and is comfortable wearing multiple hats, from architecting data workflows to modeling complex datasets and integrating ML models into production.\nKey Responsibilities\nData Infrastructure & Pipeline Development\n· Design and optimize ETL/ELT pipelines to process large-scale, high-velocity semiconductor data (e.g., fab telemetry, test results).\n· Build and maintain scalable data platforms using modern tools across cloud and on-prem environments.\n· Ensure data quality, security, and accessibility for downstream analytics and ML use cases.\nML & Advanced Analytics Integration\n· Partner with data scientists to operationalize predictive models (e.g., reliability prediction, anomaly detection, classification) into production pipelines.\n· Develop and maintain ML infrastructure (MLOps) for model monitoring, retraining, and versioning.\n· Perform feature engineering, statistical analysis, and domain-specific modeling (e.g., time-series analysis for semiconductor manufacturing).\nCross-Functional Problem-Solving\n· Collaborate with semiconductor engineers to translate domain challenges into data-driven solutions.\n· Experiment with emerging tools (e.g., LLMs, causal inference) to innovate on analytics capabilities while balancing business impact.\n· Communicate technical findings to non-technical stakeholders through dashboards or strategic recommendations.\nRequirements\n· Education: M.S./Ph. D in Computer Science, Data Science, Engineering, or a quantitative field.\n· Experience: 5+ years of hands-on experience in at least two of the following areas:\no Data engineering (ETL/ELT, pipeline development, cloud platforms).\no ML engineering (MLOps, model deployment, production ML systems).\no Advanced analytics (predictive modeling, statistical analysis, domain-specific problem-solving).\n· Technical Skills:\no Must-have:\nPython, ML frameworks (e.g., PyTorch, TensorFlow, Scikit-learn), Pandas/Dask/Polars, and NumPy.\nAPI Development (FastAPI).\nExperience with ML deployment (e.g., Docker, Kubernetes, etc.), and Linux.\nDashboarding tools (e.g., Grafana, Power BI, Dash, Tableau).\nDevOps tools (e.g., git, GitHub, Jenkins).\no Preferred:\nKnowledge of semiconductor manufacturing and testing processes.\nExperience with LLM-based tools and agentic solutions (e.g., prompt engineering, workflow automation, decision support systems).\nExperience with causal inference techniques (e.g., identifying root causes of manufacturing defects, optimizing process parameters).\nCloud platforms (AWS/Azure/Google Cloud) and cloud orchestration tools (e.g., Terraform).\nJob Type: Full-time\nPay: $129,650.00 - $200,400.00 per year\nBenefits:\n401(k)\n401(k) matching\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\nApplication Question(s):\nWill you now or in the future require sponsorship for employment visa status?\nWork Location: In person"
  },
  {
    "title": "Senior Software Engineer",
    "company": "General Motors",
    "location": "Mountain View, CA",
    "salary": "$134,000 - $241,900 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0BqJjBsvJkVIRVupdyx-l7jJlkPL5nU6SVET5Mq4mDejegpz4R4z9X6QNcQ1GgqKr4Qdiyr0NtENnrVQ1gfbWhc7-oKfN4fZGzsu1MjS3Dy8SW8ULbcUWKbYg8KWHg-qgfF97hVwrqsnk7_jwbrrpYwH0NQKJdaXFo61NU0JJSTvVW8tSHy499vnsqLep1NG3mhWxwXtaYIrsriV4APV4DnxmnwGZUq7QmnP4FfK8v2fv545ujmeUPamyz_sqaIxNBwDForJ1cuzPjGV7_Jn_Sbn1pe5TFgQvGrhsvKkuWJwrgsLpOU66NOzszLkTlFRwL1Z3-roMDpYcqhSIa86XRATTIZTpbyZQfVp4VeV3Z0tEqTXhIzX_IeG3OlUJCe7yOUmzPLsk6E1JjnYt7m_UIYt6y5cbMAELDK18hD5HRIZyGvuxHC64Cup6Ty7iPrESw5lReS_hBgHrPSKtM4SJDTfLPy1aXTK_PST1JoLJcuPrXYLonv4Lzyc_B9aOSkS09EkN_4xiWKs53HmSQfvyqKNA2g9sJ2oS7YxLfRud2OHWvWMEU0PyvJIebmykacP1Pj-kCCrOC1pQtVST-gO6dmKeOtWPnnliLGnfDsOFhj7Sc7uMzelgZwGZKEYtAJA-LHinlNsmxntoJ_WFaFfYUBxRfxjp-G6HAhuzCQfY2rWfEgPVgnK1RP2mbLl41rIzSA0k1gS-BRb2QxAvosY6-kQ6MaKjdR1_0zP4sTOTa2fX6TGX3lGGfQINFXxRfp0T-VFLXxC1WwdpMZE9L0yGcYw_C8ggnrTtFASZxxCP4HUQ==&xkcb=SoDh6_M3sYoylsSMbJ0HbzkdCdPP&camk=nUmJqO2E8rh8JLMt8M-EVQ==&p=12&fvj=0&vjs=3",
    "description": "Job Description\nThis role is categorized as hybrid. This means the successful candidate is expected to report to offices in Austin, TX, Mountain View, CA or the Greater Seattle Area three times per week, at minimum [or other frequency dictated by the business if more than 3 days].\nThe Role\nAs an engineer in the Autonomous Vehicle Data Platforms (AVDP) Data Engineering team, you will architect & automate end-2-end data processing and data management lifecycle on Cloud Platforms (GCP/Azure). You will collaborate with cross functional partners (Product Managers, Data Scientists, Machine Learning Engineers, Operations etc.,) to capture requirements and build a robust data platform. You will perform data analysis, build data pipelines and build canonical datasets and domain data models to empower users to make data driven business decisions.\nWhat You’ll Do\nOwn technical projects from start to finish, contribute to the team’s product roadmap, and be responsible for major technical decisions and tradeoffs. Effectively participate in team planning, code reviews and design discussions . Specifically, you will contribute towards :\nBuilding Data Pipelines: The team constructs and manages data pipelines that perform aggregations, enrichments, and feature engineering on raw data, making it easier for analysts and data scientists to work with.\nTopline Metrics : O wn the data pipelines that calculate the company’s topline KPIs, collaborating closely with AV PMs and Operations teams.\nData Governance: Ensuring data governance and stewardship, including data quality monitoring and building a data catalog for AV Datasets .\nSupport for Data Science Teams: Assisting data science teams with delivering their projects by building feature sets and optimizing production code\nUse the latest cloud technologies to own, design, implement, and test scalable distributed data systems in the cloud. Champion engineering excellence by continuously improving systems and processes\nConsider the effects of projects across multiple teams and proactively manage conflicts. Work together with partner teams and orgs to achieve cross-organizational goals and satisfy broad requirements\nConduct technical interviews with well-calibrated standards and play an essential role in recruiting activities. Effectively onboard and mentor junior engineers and/or interns\nYour Skills & Abilities (Required Qualifications)\nExperience building PB scale data management systems ( datalake , data warehouse) from the ground up.\nExperience building and optimizing data pipelines and associated infrastructure for cost efficiency , scale and performance\n10+ years working with big data , python, ETL/ELT, data modeling, SQL, data warehousing, data lake, dat a lakehou se\nStrong proficiency in writing SQL for analytic purposes\nBS, MS or Ph.D. in Computer Science, Electrical Engineering, Mathematics, Physics, or another relevant field; or equivalent real-world experience\nPassionate about self-driving technology and its potential impact on the world\nAttention to detail and a passion for seeking truth\nA track record of efficiently solving complex problems\nStartup mentality - openness to dealing with unknown and wearing many hats\nThis job may be eligible for relocation benefits.\nCompensation:\nThe expected base compensation for this role is: $134,000 - $241,900. Actual base compensation within the identified range will vary based on factors relevant to the position.\nBonus Potential: An incentive pay program offers payouts based on company performance, job level, and individual performance.\nBenefits : GM offers a variety of health and wellbeing benefit programs. Benefit options include medical, dental, vision, Health Savings Account, Flexible Spending Accounts, retirement savings plan, sickness and accident benefits, life insurance, paid vacation & holidays, tuition assistance programs, employee assistance program, GM vehicle discounts and more.\n#LI-CC1\n&#xa;&#xa;\nAbout GM\nOur vision is a world with Zero Crashes, Zero Emissions and Zero Congestion and we embrace the responsibility to lead the change that will make our world better, safer and more equitable for all.\n&#xa;&#xa;\nWhy Join Us\nWe believe we all must make a choice every day – individually and collectively – to drive meaningful change through our words, our deeds and our culture. Every day, we want every employee to feel they belong to one General Motors team.\n&#xa;&#xa;\nBenefits Overview\nFrom day one, we're looking out for your well-being–at work and at home–so you can focus on realizing your ambitions. Learn how GM supports a rewarding career that rewards you personally by visiting Total Rewards Resources .\n&#xa;&#xa;\nNon-Discrimination and Equal Employment Opportunities (U.S.)\nGeneral Motors is committed to being a workplace that is not only free of unlawful discrimination, but one that genuinely fosters inclusion and belonging. We strongly believe that providing an inclusive workplace creates an environment in which our employees can thrive and develop better products for our customers.\nAll employment decisions are made on a non-discriminatory basis without regard to sex, race, color, national origin, citizenship status, religion, age, disability, pregnancy or maternity status, sexual orientation, gender identity, status as a veteran or protected veteran, or any other similarly protected status in accordance with federal, state and local laws.\nWe encourage interested candidates to review the key responsibilities and qualifications for each role and apply for any positions that match their skills and capabilities. Applicants in the recruitment process may be required, where applicable, to successfully complete a role-related assessment(s) and/or a pre-employment screening prior to beginning employment. To learn more, visit How we Hire .\n&#xa;&#xa;\nAccommodations\nGeneral Motors offers opportunities to all job seekers including individuals with disabilities. If you need a reasonable accommodation to assist with your job search or application for employment, email us or call us at 800-865-7580. In your email, please include a description of the specific accommodation you are requesting as well as the job title and requisition number of the position for which you are applying."
  },
  {
    "title": "Senior Machine Learning Engineer",
    "company": "embedUR systems",
    "location": "Hybrid work in San Ramon, CA 94583",
    "salary": "From $150,000 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0CpwUEmQrjgWbodcqjLZtLnKswrPBIr5JFNUFcS-V-NyqORYVXLODqGF0fwtsM2_Ce5fgEoy8ML_U0rh7mHuQTuxb07lXy8zhwpfxoVFxtCP3HcbvoWwec_TM6SkVRk_Ib9uKaFam-fUHYHpCTEAGDlJ6DjKUV8JDaJE5LVVWbYCFxWz2Dk2Akv92iDV734ibw57uGHEdRn2U453GzJ211pyatc8S4Mk1yPc-Qbr0J_K1UIMqwNEMpr7j10v766Sl20-JeqAIqlYAHpmNzJEXv2fXiWuv9vi0l35i8yo0qHjWv9_6T8bN3kJzyV5NuUHKGtTG2PrIYu0xMJ5o4CeTBAcud21MhenewzA6QILSLNSeIpJW161eptxA8q5JtaEd0b4Csv3nS9ddiK0TBHqXSWfhX6E_If2_csy4Xefvq6KsKVfzVpfF1xPt2vcHrxMzq0HOvgWOYXf5qUb_DrvHPlqTsl0Uq0umcd3ijRf-APFCL5WWs2BTNh2ud7ZCH7XShpVyRcjTm3mRm9sPXJOnjDbJbMQjgXHbswj3sOAMkSZnBs3ZV0V6LNAeZw3rSwaRJ4YNEX_p-e6Q9OI8b1Op-51wtF651eL9Tm0RIgconW-2xsO0UeIEjHJ2q08ywKlRHLvGGAkEoUA5zy7Ino0AH4BjV-BSk-Tb7TQoO5CpCEGs8pFMBN4bQuiBz18CgNTXEMioz-aM0o7GDKSdWWs4a4X6e_KHwCpu8=&xkcb=SoAb6_M3sYoylsSMbJ0MbzkdCdPP&camk=UoKtGZLa3XJLEOqJ2Qsveg==&p=7&fvj=0&vjs=3",
    "description": "Applicants must be authorized to work in the U.S.\nRole Summary\nWe’re seeking a Senior Machine Learning Engineer with deep expertise in building and deploying ML models optimized for edge devices. This role is ideal for someone passionate about pushing the boundaries of AI on resource-constrained hardware, across domains such as computer vision, audio analytics, and sensor-based signal processing.\nKey Responsibilities\nDesign, train, and optimize deep learning models for edge AI use cases:\nComputer vision (e.g., object detection, image classification, segmentation)\nAudio/speech processing (e.g., wake word detection, denoising)\nSignal processing across multimodal sensor data\nDevelop scalable and efficient model training and evaluation pipelines.\nQuantize, prune, and compress models for real-time inference on NPUs, DSPs, and microcontrollers.\nConduct applied research and benchmark new model architectures or techniques for edge deployment.\nPrepare and curate training/validation datasets using best practices for data quality and balance.\nCollaborate with embedded software engineers to integrate models into edge production environments.\nMonitor model performance, perform error analysis, and iterate for continuous improvement.\nDocument model architectures, assumptions, and deployment requirements for stakeholders.\nQualifications\nMaster’s degree (or equivalent experience) in Computer Science, Machine Learning, or a related discipline.\n5+ years of hands-on experience in developing, optimizing, and deploying ML models in production.\nStrong proficiency in Python and ML frameworks such as TensorFlow, PyTorch, ONNX, and tools like OpenCV, Ultralytics, or equivalent.\nDemonstrated experience with edge inference optimization:\nModel quantization and compression\nDeployment on NPUs, DSPs, or microcontrollers\nFamiliarity with ARM Ethos-U/Vela, TensorRT, TFLite, or similar edge AI compilers is a strong plus.\nSolid understanding of signal processing for image, audio, and other sensor modalities.\nExperience with cloud-based training pipelines (AWS, GCP, or Azure) is a plus.\nStrong analytical and problem-solving skills, with a track record of innovation.\nExcellent communication and documentation skills.\nJob Type: Full-time\nPay: From $150,000.00 per year\nBenefits:\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\nWork Location: Hybrid remote in San Ramon, CA 94583"
  },
  {
    "title": "Staff ML Engineer, ML Orchestration",
    "company": "General Motors",
    "location": "Mountain View, CA",
    "salary": "$195,000 - $298,000 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0BqJjBsvJkVIRVupdyx-l7jJlkPL5nU6SVET5Mq4mDejegpz4R4z9X6QNcQ1GgqKr7EuADWGqYvBTbBbH4hgDccsL9jWq1FE5XhCERbGAqruT7FAz7GrHd-XXnk7Gh_MeOicIPiigJEI8vH2MG1XGEqSrdg2QOZVjWP_UiX9EXA6n05ap-0ms2bOeT1RNbnYDhV1alEyMM3N8x5qpBznQo0MJfKEqgEnqCw5TVCWbXH4htLC6RrRvv8Su-dItvRoCDIYazFgDtoSlK4YAHXqNu4f8afRCjFDH8voFiq1pUSfL8l0X_WVQPBIrsL6dkqwDQRY8OVrXxfTJS3wDcwsBHtWBsgOQX2CEwkk4KGhRLFicD_nJBkCXPtFRCQJTAj8kBnVolLOGdtXBhr0O0MqYa2Dv_8MRWrUH2yBKoV6RkTrLQQzbQMeu7LekMp7yujsUIbcd0oywmAT0CAjruKDLDWLiWf_QPKJIad95l_-a4ySzvHyDacfUw021ZVA5dXzYR5MZPcXh8Cxd2dmfHT9Ajk9G7DcWyMv5w4_Sp6nd3V7rEUDvFNDbt1esdDNdSf5uyihjKmsYuJ9D68TnU_K6e6B6FRMBKlla00nczCYN1lt0_Q_Mg1ccOHgyddVZ8ZvbscR8NTHXQW4ISvk6hlGMA3AgBdP2vDhXTE8HMoOiawJV0aUAUgGiwgLN7tMEzjzOheogp1WZGATZx84yOXZGKSGGVGaUAbU9-HFahuCB8Jrss4kLkStp0t_KROmvOpzlRJl1cwQKCqMlV8KJScBFnqSvMwsowBX2PqHRYJfsoqEGUkeDmi2CYr&xkcb=SoAI6_M3sYoylsSMbJ0IbzkdCdPP&camk=nUmJqO2E8rh8JLMt8M-EVQ==&p=3&fvj=0&vjs=3",
    "description": "Job Description\nJob Description\nHybrid This role is categorized as hybrid. This means the successful candidate is expected to report to the GM Global Technical Center - Cole Engineering Center Podium , MI or Mountain View Technical Center , CA at least three times per week, at minimum or other frequency dictated by the business. This job is eligible for relocation assistance.\nAbout the Team:\nThe ML Orchestration team at GM builds and maintains the foundational infrastructure that powers ML workflows across the company. Our core responsibility is the development and evolution of Roboflow , GM’s in-house semantic orchestration platform designed to streamline and scale complex ML pipelines, from experimentation to production.\nA key pillar of our work is AI Lineage —our capability to track, visualize, and understand the entire lifecycle of ML artifacts. This includes tracing the origin of data, model training runs, hyperparameters, code versions, and evaluation metrics. AI Lineage provides transparency, auditability, and reproducibility across our ML systems, which is essential for debugging, model governance, regulatory compliance, and improving long-term model quality. Together, Roboflow and AI Lineage help our engineers move faster with higher confidence, enabling GM to iterate quickly while maintaining the safety and performance standards required for autonomous vehicle development.\nPosition Overview:\nWe are seeking an experienced Staff Machine Learning Engineer to drive key initiatives within our ML Orchestration team. In this role, you will be instrumental in scaling our internal ML platform, building automation and self-service tools, and ensuring the reliability and efficiency of large-scale ML pipelines across GM. A major focus area for this role is the development and evolution of AI Lineage —our system for capturing, querying, and visualizing the full lifecycle of machine learning artifacts. You will help design lineage tracking for data transformations, model training, evaluation runs, and pipeline dependencies. This functionality is critical for enabling transparency, reproducibility, debugging, and regulatory compliance across our ML ecosystem.\nPlease note : This is an ML infrastructure engineering role. It does not involve training or applying machine learning models to specific business problems. Instead, your impact will come from building core infrastructure products that empower hundreds of ML and data science practitioners at GM to experiment, deploy, and manage ML workflows at scale.\nWhat You’ll Be Doing\nDesign & Implementation : Architect, implement, and test scalable, cloud-native distributed systems using modern cloud platforms such as Google Cloud Platform (GCP) or Microsoft Azure. Build robust infrastructure to support large-scale ML workflows and data processing at GM.\nProject Ownership: Lead technical projects end-to-end—from early design through production deployment. Shape the product roadmap and drive key architectural decisions, balancing performance, reliability, and long-term maintainability.\nCross-Team Collaboration: Actively participate in design reviews, team planning, and code reviews. Collaborate across multiple engineering teams to deliver cohesive platform solutions. Anticipate integration points and proactively manage dependencies and trade-offs.\nMentorship & Recruiting: Foster a culture of technical excellence and growth. Interview candidates using calibrated evaluation criteria, onboard new hires, and mentor engineers and interns to help them grow technically and professionally.\nMinimum Qualifications\n8+ years of industry experience, with a strong focus on large-scale distributed systems or cloud infrastructure.\n3+ years of experience leading and delivering complex technical initiatives across teams.\nStrong programming skills in Python, C++, Go, or similar languages, with demonstrated experience building production-grade systems.\nHands-on experience working with relational and NoSQL databases.\nProven ability to design, build, and maintain highly scalable systems in production environments.\nBachelor’s, Master’s, or Ph.D. in Computer Science, Electrical Engineering, Mathematics, Physics, or a related field—or equivalent practical experience.\nDeep attention to detail, strong problem-solving skills, and a track record of building high-quality systems.\nPassion for autonomous vehicles, infrastructure engineering, and advancing the state of ML platforms.\nAdaptability and a startup mindset—comfortable working in ambiguity and stepping outside your core responsibilities when needed.\nPreferred Qualifications\nExperience with GCP, Azure, or AWS cloud platforms.\nFamiliarity with open-source ML orchestration tools such as Kubeflow, Flyte, Airflow, or similar platforms.\nExperience with Kubernetes and container orchestration at scale.\nUnderstanding of ML pipelines, data lineage, model lifecycle management, and reproducibility challenges in machine learning systems.\nStrong proficiency in one or more of Python, C++, or Golang.\nContributions to open-source projects or relevant technical publications.\nWhy Join Us?\nIf you’re excited to tackle some of today’s most complex ML Infra engineering challenges, see the impact of your work in real-world AV applications, and help shape the future of AI infrastructure at GM—this is the team for you.\nCompensation: The compensation information is a good faith estimate only. It is based on what a successful applicant might be paid in accordance with applicable state laws. The compensation may not be representative for positions located outside of New York, Colorado, California, or Washington\nCompensation: The expected base compensation for this role is : $195,000 - $298,000 Actual base compensation within the identified range will vary based on factors relevant to the position.\nBonus Potential: An incentive pay program offers payouts based on company performance, job level, and individual performance.\nBenefits: GM offers a variety of health and wellbeing benefit programs. Benefit options include medical, dental, vision, Health Savings Account, Flexible Spending Accounts, retirement savings plan, sickness and accident benefits, life insurance, paid vacation & holidays.\n#LI-EL1\n&#xa;&#xa;&#xa;&#xa;\nAbout GM\nOur vision is a world with Zero Crashes, Zero Emissions and Zero Congestion and we embrace the responsibility to lead the change that will make our world better, safer and more equitable for all.\nWhy Join Us\nWe believe we all must make a choice every day – individually and collectively – to drive meaningful change through our words, our deeds and our culture. Every day, we want every employee to feel they belong to one General Motors team.\nBenefits Overview\nFrom day one, we're looking out for your well-being–at work and at home–so you can focus on realizing your ambitions. Learn how GM supports a rewarding career that rewards you personally by visiting Total Rewards resources .\nNon-Discrimination and Equal Employment Opportunities (U.S.)\nGeneral Motors is committed to being a workplace that is not only free of unlawful discrimination, but one that genuinely fosters inclusion and belonging. We strongly believe that providing an inclusive workplace creates an environment in which our employees can thrive and develop better products for our customers.\nAll employment decisions are made on a non-discriminatory basis without regard to sex, race, color, national origin, citizenship status, religion, age, disability, pregnancy or maternity status, sexual orientation, gender identity, status as a veteran or protected veteran, or any other similarly protected status in accordance with federal, state and local laws.\nWe encourage interested candidates to review the key responsibilities and qualifications for each role and apply for any positions that match their skills and capabilities. Applicants in the recruitment process may be required, where applicable, to successfully complete a role-related assessment(s) and/or a pre-employment screening prior to beginning employment. To learn more, visit How we Hire .\nAccommodations\nGeneral Motors offers opportunities to all job seekers including individuals with disabilities. If you need a reasonable accommodation to assist with your job search or application for employment, email us or call us at 800-865-7580. In your email, please include a description of the specific accommodation you are requesting as well as the job title and requisition number of the position for which you are applying."
  },
  {
    "title": "Applied Scientist II, Prime Video - Personalization and Discovery Science",
    "company": "Amazon.com Services LLC",
    "location": "Sunnyvale, CA",
    "salary": "$136,000 - $223,400 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0C2svMuzE9n6q0Xo3QnQAm3u19FFO5aJ8ndlGbDv5msKCaTOErDQL3tox9QQGL4a-mBq_uXLcmgUqWUb7J0ks-g3WpXoTrw6i0DZNDtY9yDgX5BnStYWBIY7uqSo5wRtr1ODtH69j-MC29ybnXjzB-HdBjfaZxnY3ePO_IzHIiyfxZYc1T0qCzdLnqbQxza67x9RUnxuiQ91VeJp_2k92yFwJ6xBw3CCH7EhyXudRkC9Y9QeBeOCuLJ2IWh_j6_yuc1ejqM19rINJ75koSLq08aB8gP6H03w5ntOtV8oRgPmxJOnPd71nQBfK1m3neGOD1tR8VQRqR2g99_x-XT4f9spSH-R7rCrmhbPTAH0rJN0u6pcA16NxMTAeUc4QGlchVNh8Yx4ZGISSyocfVX1tQ3s7YKz8jwmwoqcVciEd0lY95RRrgzfvzoI5vjx8rg-c5B-76OP6Kc6YPRboKzt46WT3ABZkdPI_K4KTmCl53wDig30dTCwlRs9urK3r8nu7dteH_RseRGTWy-YPxiW5jxifD15qoMEHxt1zNJq4ChRJMlNyrzS80P8hmaSVR3rGmURNVuW7oML0k0_Kp9XHQ1UK_vLFOc60ZUgkfyGuOLGwzvwrB_M-i2X8s2iLgA07PdgU-ktTMLHDD8gJLNIZ8d68GnMCn5UxIrzoS0BPZeq_Tsmk88dqievuFG1-nMeFOHoNxainF_dgZpziuGMD85hHqmtbb1fxqh9mSWeeeJ3wmkvW76IDcu25wG6wnzE5Svuamcbh08Rdn6lrmvjUcd7CxdHIdIWuAaMkatZCXgL7PMkio1tiEfDr6CPz82GJISr6dsH-cU6a5ysEm1Fo7LruBuq-9e9XLxYchLu_5QuQ==&xkcb=SoDI6_M3sYoylsSMbJ0FbzkdCdPP&camk=UoKtGZLa3XIdNzMOGgybSA==&p=14&fvj=0&vjs=3",
    "description": "DESCRIPTION\nPrime Video is a first-stop entertainment destination offering customers a vast collection of premium programming in one app available across thousands of devices. Prime members can customize their viewing experience and find their favorite movies, series, documentaries, and live sports – including Amazon MGM Studios-produced series and movies; licensed fan favorites; and programming from Prime Video add-on subscriptions such as Apple TV+, Max, Crunchyroll and MGM+. All customers, regardless of whether they have a Prime membership or not, can rent or buy titles via the Prime Video Store, and can enjoy even more content for free with ads.\n\nAre you interested in shaping the future of entertainment? Prime Video's technology teams are creating best-in-class digital video experience.\n\nAs a Prime Video technologist, you’ll have end-to-end ownership of the product, user experience, design, and technology required to deliver state-of-the-art experiences for our customers. You’ll get to work on projects that are fast-paced, challenging, and varied. You’ll also be able to experiment with new possibilities, take risks, and collaborate with remarkable people.\n\nWe’ll look for you to bring your diverse perspectives, ideas, and skill-sets to make Prime Video even better for our customers. With global opportunities for talented technologists, you can decide where a career Prime Video Tech takes you!\n\n\n\nKey job responsibilities\nDevelop ML models for various recommendation & search systems using deep learning, online learning, and optimization methods\nWork closely with other scientists, engineers and product managers to expand the depth of our product insights with data, create a variety of experiments to determine the high impact projects to include in planning roadmaps\nStay up-to-date with advancements and the latest modeling techniques in the field\nPublish your research findings in top conferences and journals\n\nA day in the life\nWe're using advanced approaches such as foundation models to connect information about our videos and customers from a variety of information sources, acquiring and processing data sets on a scale that only a few companies in the world can match. This will enable us to recommend titles effectively, even when we don't have a large behavioral signal (to tackle the cold-start title problem). It will also allow us to find our customer's niche interests, helping them discover groups of titles that they didn't even know existed. We are looking for creative & customer obsessed machine learning scientists who can apply the latest research, state of the art algorithms and ML to build highly scalable page personalization solutions. You'll be a research leader in the space and a hands-on ML practitioner, guiding and collaborating with talented teams of engineers and scientists and senior leaders in the Prime Video organization. You will also have the opportunity to publish your research at internal and external conferences.\nBASIC QUALIFICATIONS\n3+ years of building models for business application experience\nPhD, or Master's degree and 4+ years of CS, CE, ML or related field experience\nExperience programming in Java, C++, Python or related language\nExperience in any of the following areas: algorithms and data structures, parsing, numerical optimization, data mining, parallel and distributed computing, high-performance computing\nPREFERRED QUALIFICATIONS\nExperience using Unix/Linux\nExperience in professional software development\n\nAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\n\nLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\n\nOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $136,000/year in our lowest geographic market up to $223,400/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site."
  },
  {
    "title": "Principal AI/ML Engineer - Onboard Embodied AI",
    "company": "General Motors",
    "location": "Mountain View, CA",
    "salary": "$259,000 - $396,700 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0BqJjBsvJkVIRVupdyx-l7jJlkPL5nU6SVET5Mq4mDejegpz4R4z9X6QNcQ1GgqKr5LJWCtKe0SRLHc6YI0dOJ_BkmaDsPHccyGQ0KNyfW4Lp6VDrZbpfGaKnz_TEsQNVncKLTDM32fcmU7kd2haAAeoe9aY_o6rwxAAAXY63HuXFJSnAeXf8Z0ypi_X8z8MXQWZFBuTs8chFAY3YKyo4ytg-CJGWzaETyOxplyTMRjdRgKECD1sS1vpWVmsRo_P9_dHk1xyYPD-NpfKDt1GK6VVgMbEFdbw-yKpz6pyBHLl0hHbwcuz6U_VHjA-Kv8tt2qYY5hxshyWvk3sLdIe1sWw2y2iEj5HEiZZ3VIsGQsY4nc1hNPfdIEEESppsL2oSQJQDkmlmNcAoloeHBqyNosPr_5LZSpP9-QGsWpACtBMUOv6ta2DVEUx8YLmPEZ07RslyykCTE914wAMoxIChDnKDnTBkQ2czMBimh7zHAgc-muZcGNnIHdZ2fqL7uPtvHDvqeSvvFFAu8Sagy4M7jkRuZkyc6zN0VPuuRwcSFYYBkffCF9Lp_KtCdjJeMaYXkg3L5NhqnQUh8x7bU7X7pUiVy72UagAsL3G_vRbOHLa-_y2B9w2qt4-5TO7B-GskjkDKOTesVyixWtTvZsVW2j4sHQ6m-oejhrWJW3Y51Z7oEZPtcmvY8BgKbentUui_gPmeA-d2twfRaSTrEqifn9NmNMwk7NQzGgU2aNMDZFsDpVnZzDGQv03uhros_3RyGh9f06BJzjYNvWTtxyvKQZfBdpunZELArxiZifPhQjQYveILdBOV5Qm7plsIkqJ8emsNjbpJnukg==&xkcb=SoDy6_M3sYoylsSMbJ0DbzkdCdPP&camk=nUmJqO2E8rh8JLMt8M-EVQ==&p=8&fvj=0&vjs=3",
    "description": "Job Description\nRole:\nAs a Technical Lead in Machine Learning within the Onboard Embodied AI organization, you will be a senior individual contributor driving cutting-edge end-to-end machine learning solutions directly impacting autonomous driving performance. Your role is pivotal in designing, architecting, and deploying advanced ML models that translate raw sensor data into actionable driving behaviors, enabling vehicles to robustly navigate diverse real-world scenarios and conditions. You'll lead critical technical initiatives, collaborate closely with cross-functional teams, mentor ML engineers, and significantly shape the future of onboard ML capabilities.\nThe Onboard Embodied AI team is at the forefront of developing groundbreaking onboard ML systems powering fully autonomous vehicles. We leverage modern end-to-end machine learning approaches with sophisticated neural networks trained from large-scale driving data and using state - of - the - art alignment approaches . Our solutions enable vehicles to understand complex, dynamic driving environments, handle uncertainty gracefully, and adapt seamlessly to changing conditions. Join a collaborative and innovative team redefining autonomy through state-of-the-art machine learning, delivering solutions that move beyond current technological boundaries.\nKey Responsibilities:\nDrive the design, development, and deployment of advanced onboard ML models, delivering end-to-end solutions capable of real-time inference and robust autonomous driving performance.\nLead and architect complex machine learning projects, from conception through validation to onboard implementation, emphasizing scalability, robustness, and safety-critical operation.\nChampion innovation in neural network architectures, training methodologies, and inference optimization strategies suited for real-time onboard deployment.\nProvide technical mentorship and thought leadership, elevating engineering practices, and fostering ML innovation across teams.\nCollaborate closely with multidisciplinary engineering groups, ensuring seamless integration of ML capabilities into autonomous vehicle systems.\nInfluence technical roadmaps, shaping strategic ML priorities aligned with company objectives and product milestones.\nYour Skills & Abilities:\nMaster's or Ph.D. in Machine Learning, Robotics, Computer Science, Electrical Engineering, or a related technical field.\n5 + years of modern machine learning techniques\nExtensive experience developing and deploying advanced ML systems, particularly in end-to-end real-time onboard applications.\nProven track record as a technical leader and expert in developing robust deep learning models that directly map sensor data to actionable outputs within safety-critical systems.\nDeep expertise in state- of- the-art computer vision techniques, neural architectures, representation learning, real-time inference, model optimization, and robustness under uncertainty.\nStrong software engineering proficiency , particularly Python and C++, alongside extensive hands-on experience with modern ML frameworks ( PyTorch , TensorFlow, JAX).\nExcellent communication, collaboration, and mentoring abilities, comfortable influencing technical strategy and guiding ML engineering excellence across the organization.\nBonus: AV/ADAS experience is a big plus\nCompensation : The compensation information is a good faith estimate only. It is based on what a successful applicant might be paid in accordance with applicable state laws. The compensation may not be representative for positions located outside of New York, Colorado, California, or Washington.\nThe salary range for this role is $259,000 to $396,700. The actual base salary a successful candidate will be offered within this range will vary based on factors relevant to the position.\nBonus Potential: An incentive pay program offers payouts based on company performance, job level, and individual performance.\nHybrid: This role is categorized as hybrid. This means the successful candidate is expected to report to the Mountain View Technical Center in the Bay Area three times per week, at minimum.\nRelocation: This job may be eligible for relocation benefits.\n#LI-MH2\n&#xa;&#xa;\nAbout GM\nOur vision is a world with Zero Crashes, Zero Emissions and Zero Congestion and we embrace the responsibility to lead the change that will make our world better, safer and more equitable for all.\n&#xa;&#xa;\nWhy Join Us\nWe believe we all must make a choice every day – individually and collectively – to drive meaningful change through our words, our deeds and our culture. Every day, we want every employee to feel they belong to one General Motors team.\n&#xa;&#xa;\nBenefits Overview\nFrom day one, we're looking out for your well-being–at work and at home–so you can focus on realizing your ambitions. Learn how GM supports a rewarding career that rewards you personally by visiting Total Rewards Resources .\n&#xa;&#xa;\nNon-Discrimination and Equal Employment Opportunities (U.S.)\nGeneral Motors is committed to being a workplace that is not only free of unlawful discrimination, but one that genuinely fosters inclusion and belonging. We strongly believe that providing an inclusive workplace creates an environment in which our employees can thrive and develop better products for our customers.\nAll employment decisions are made on a non-discriminatory basis without regard to sex, race, color, national origin, citizenship status, religion, age, disability, pregnancy or maternity status, sexual orientation, gender identity, status as a veteran or protected veteran, or any other similarly protected status in accordance with federal, state and local laws.\nWe encourage interested candidates to review the key responsibilities and qualifications for each role and apply for any positions that match their skills and capabilities. Applicants in the recruitment process may be required, where applicable, to successfully complete a role-related assessment(s) and/or a pre-employment screening prior to beginning employment. To learn more, visit How we Hire .\n&#xa;&#xa;\nAccommodations\nGeneral Motors offers opportunities to all job seekers including individuals with disabilities. If you need a reasonable accommodation to assist with your job search or application for employment, email us or call us at 800-865-7580. In your email, please include a description of the specific accommodation you are requesting as well as the job title and requisition number of the position for which you are applying."
  },
  {
    "title": "",
    "company": "",
    "location": "",
    "salary": "",
    "url": "https://www.indeed.com/viewjob?jk=abcdef0123456789",
    "description": "None"
  },
  {
    "title": "Principal ML Engineer - Embodied AI",
    "company": "General Motors",
    "location": "Remote in Mountain View, CA",
    "salary": "$259,000 - $396,300 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0BqJjBsvJkVIRVupdyx-l7jJlkPL5nU6SVET5Mq4mDejegpz4R4z9X6QNcQ1GgqKr5GUJlKIdpNk0n_kMPdM0meoDQzaS1-Zgpy2dsZfk4bWE-bw852aFgNu4jJEvb7T_l1jUStF2NhimxJD1259EPEixPQa39TN4Zgf-MeWNVq1j-DWZZlL7n_8YDsoZ1BBtTtWfYGgiC8GMgF-KkWN5JEwYOOr4n3VkBP0FTXjGmISfG6KcqiJwhZWvfrQXnMEy7MZia36T4aHoY1HScTfqz4E8DWQmf_sb72TaunArdCT8TSU6Hmv8twcUkftP8qUL2yQE36Y6Qj5UOwftAawAa76ZD6pOcy7ans6P-MAHuz4ZYB1SyZt6pvpQmCaOuwSYNluXLmBXAGLUT4k75_oC9pJG7RHtnWunTEBh9i1ClkBHYByYvVa_lgp28_QaIgtDV0tARSwHdFlcYD8ggUDtLDKVsoYeKaVaMfQ_K8Eh0fFSoAdKsvl9Ff77CyqvIWF4s2eHvwgJ9PMfmHycdtj3ZZ0qGQc-KNP45MPe8S8twlrpxMilVXzZFh5R_K_3mDl9JLYJSHpkKXUZ36OFCyOFgn2fdjBWKB5t4SHgVPAiyg5BWFlf-ZqS_QCgYU3Hn0bGdsCQ3xl9zOK8XxScd74lqmAQiGLRH6wwbXuzcJStYb_pAyndd1mG_hcXxrAbep7X3peBfa3IcF5yxDgLfy5uqfYY7sB1qI-F3Fdocgjk18l9spYYMaT1quDO8xSN8lDIhBpftBPF7lJRC9sb2sHJVjt9y6LgN0LdoyYD2OG5RKd1dZTZZv_gaTHJJiv2ZWLBM=&xkcb=SoCV6_M3sYpPSCSMbp0JbzkdCdPP&camk=nUmJqO2E8rh8JLMt8M-EVQ==&p=2&fvj=0&vjs=3",
    "description": "Job Description\nRole: In t his role, you will be at the forefront of developing and deploying large-scale Foundation Models (FMs) that enhance our automotive technologies at General Motors focused on Autonomous Driving & Robotics. You will work closely with a dynamic team of AI and ML researchers, data scientists and engineers who are passionate about leveraging advanced AI techniques to drive innovation for L2, L3 and L4 applications . Your contributions will directly impact our ability to deliver cutting-edge solutions that meet the needs of our customers.\nWhat You'll Do:\nDesign and implement technologies t hat will deliver scaling laws for o ur Foundation Models for various applications .\nS cal e up foundation model pre-training with data to its maximum capacity – into billions+ of examples - across different sources , delivering the maximum value to the model through every additional example .\nDirectly work on or collaborate closely with teams that scale up training and eval infrastructure to handle multi-billion examples across distributed machines and GPUs , while providing efficient time to model checkpoint.\nCollaborate with cross-functional teams to integrate & built distillation recipes of Robotics foundation models for onboard driving models.\nConduct research and stay updated on the latest advancements in AI scaling frameworks and libraries .\nLead projects from ideation to deployment, documenting learnings and best practices along the way.\nMentor junior team members and contribute to a culture of knowledge sharing and continuous improvement.\nYour Skills & Abilities:\nBachelor’s, Master’s or PhD degree in Computer Science with a focus in Robotics and or Machine Learning, or a related field.\nProven experience working with large-scale Foundation Models, including LLMs, VLAs and vision-focused models .\nProven experience in solving data scaling challenges, ranging from data diversity, data quality and building best practices to incorporate multiple data sources in large models.\nProficiency in frameworks such as PyTorch , with experience in libraries like HuggingFace and OpenAI GPT\nProven experience in building and scaling large model training pipelines that are performant and enable quick iteration by distributed teams.\nStrong data processing skills using tools like Numpy , Pandas, and Apache Spark.\nExcellent communication skills to effectively collaborate with diverse teams and stakeholders.\nExperience deploying foundation models into production environments and understanding the end-to-end process.\nPrevious experience in Robotics or Autonomous Driving.\nCompensation : The compensation information is a good faith estimate only. It is based on what a successful applicant might be paid in accordance with applicable state laws. The compensation may not be representative for positions located outside of New York, Colorado, California, or Washington.\nThe salary range for this role is $259,000 to $396,300. The actual base salary a successful candidate will be offered within this range will vary based on factors relevant to the position.\nBonus Potential: An incentive pay program offers payouts based on company performance, job level, and individual performance.\nHybrid: This role is categorized as hybrid. This means the successful candidate is expected to report to the Mountain View Technical Center in the Bay Area three times per week, at minimum.\nRelocation: This job may be eligible for relocation benefits.\n&#xa;&#xa;\nAbout GM\nOur vision is a world with Zero Crashes, Zero Emissions and Zero Congestion and we embrace the responsibility to lead the change that will make our world better, safer and more equitable for all.\n&#xa;&#xa;\nWhy Join Us\nWe believe we all must make a choice every day – individually and collectively – to drive meaningful change through our words, our deeds and our culture. Every day, we want every employee to feel they belong to one General Motors team.\n&#xa;&#xa;\nBenefits Overview\nFrom day one, we're looking out for your well-being–at work and at home–so you can focus on realizing your ambitions. Learn how GM supports a rewarding career that rewards you personally by visiting Total Rewards Resources .\n&#xa;&#xa;\nNon-Discrimination and Equal Employment Opportunities (U.S.)\nGeneral Motors is committed to being a workplace that is not only free of unlawful discrimination, but one that genuinely fosters inclusion and belonging. We strongly believe that providing an inclusive workplace creates an environment in which our employees can thrive and develop better products for our customers.\nAll employment decisions are made on a non-discriminatory basis without regard to sex, race, color, national origin, citizenship status, religion, age, disability, pregnancy or maternity status, sexual orientation, gender identity, status as a veteran or protected veteran, or any other similarly protected status in accordance with federal, state and local laws.\nWe encourage interested candidates to review the key responsibilities and qualifications for each role and apply for any positions that match their skills and capabilities. Applicants in the recruitment process may be required, where applicable, to successfully complete a role-related assessment(s) and/or a pre-employment screening prior to beginning employment. To learn more, visit How we Hire .\n&#xa;&#xa;\nAccommodations\nGeneral Motors offers opportunities to all job seekers including individuals with disabilities. If you need a reasonable accommodation to assist with your job search or application for employment, email us or call us at 800-865-7580. In your email, please include a description of the specific accommodation you are requesting as well as the job title and requisition number of the position for which you are applying."
  },
  {
    "title": "Delivery Consultant- GenAI/ML & Data Science, Professional Services, AWS Industries",
    "company": "Amazon Web Services, Inc.",
    "location": "Santa Clara, CA 95050",
    "salary": "$138,200 - $239,000 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0DiR_L9Yk1BWFWbfTFdXbTUvRWK-3b4thi9OwmTROImgD83jGPuKhrYQiXmT26GQE95uBIm3-cT5kRCzb_AeOFRZuhHFra04x_aEr8wz3MVQlBrYJKKPMIfACjE2cKuBhy7nYhkJb6Gw2DHbnKSUNj9_d4sZJDiEGop88vXShdJobz5e6LnZhryb2CE2vOrNDljTvxg2jp507ovH99HxHf5DpyeuZhh0VpmXu_wiAZSFuFpFPRX3l_SerhbpA8YJryGtcPMCrfHcT8pRMc1QM9c-6cZl84AK_0bXWP_ysRSyhkuIgg3adOSIRvDGB_6yv-aPyFFGARbgwNtt9njPwy24qCwFkepsXWguF7aVpzRjXL0cT218u1CFaWhL6CCJd9AxC4DGhSjeCTgGkJjPoiwvggpeL15cEHxvlCmv90ZQxyEACxADPyrD5c8gzNbmQPr-SPtx-l4XvW1RlM-MMzP6B5j1S2p_Wib12C-B6xrS1vaLGvKyoLe5ysSALkPkVY-HmtES-82GMM2xpajpmBQi2f5OQnSDQjQESOgeIEXtCEtdHjkdd7TYNBNY6eWN-a3tZ0MJepgy2haVXlV-4ZLKSsDpTmerN50Tia-_dSo76HZyYY4hAzlh0ioRru4rvzc9vIISezvMQaSCkhxCqlVTzNv0AYxu7y9ouA1wkmzp5sAw6Ra_z0i2yXa8k4ngXqZgAMNV7SDVA==&xkcb=SoAh6_M3sYpPSCSMbp0IbzkdCdPP&camk=UoKtGZLa3XL1LAZLFyWaZQ==&p=3&fvj=0&vjs=3",
    "description": "The Amazon Web Services Professional Services (ProServe) team is seeking a skilled Delivery Consultant to join our team at Amazon Web Services (AWS). In this role, you'll work closely with customers to design, implement, and manage AWS solutions that meet their technical requirements and business objectives. You'll be a key player in driving customer success through their cloud journey, providing technical expertise and best practices throughout the project lifecycle.\n\nPossessing a deep understanding of AWS products and services, as a Delivery Consultant you will be proficient in architecting complex, scalable, and secure solutions tailored to meet the specific needs of each customer. You’ll work closely with stakeholders to gather requirements, assess current infrastructure, and propose effective migration strategies to AWS. As trusted advisors to our customers, providing guidance on industry trends, emerging technologies, and innovative solutions, you will be responsible for leading the implementation process, ensuring adherence to best practices, optimizing performance, and managing risks throughout the project.\n\nThe AWS Professional Services organization is a global team of experts that help customers realize their desired business outcomes when using the AWS Cloud. We work together with customer teams and the AWS Partner Network (APN) to execute enterprise cloud computing initiatives. Our team provides assistance through a collection of offerings which help customers achieve specific outcomes related to enterprise cloud adoption. We also deliver focused guidance through our global specialty practices, which cover a variety of solutions, technologies, and industries.\n\nKey job responsibilities\nAs an experienced technology professional, you will be responsible for:\nDesigning, implementing, and building complex, scalable, and secure GenAI and ML applications and models built on AWS tailored to customer needs\nProviding technical guidance and implementation support throughout project delivery, with a focus on using AWS AI/ML services\nCollaborating with customer stakeholders to gather requirements and propose effective model training, building, and deployment strategies\nActing as a trusted advisor to customers on industry trends and emerging technologies\nSharing knowledge within the organization through mentoring, training, and creating reusable artifacts\n\nAbout the team\nAbout AWS:\nDiverse Experiences: AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job below, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\n\nWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneeredcloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companiestrust our robust suite of products and services to power their businesses.\n\nInclusive Team Culture - Here at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (diversity) conferences, inspire us to never stop embracing our uniqueness.\n\nMentorship & Career Growth - We’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\n\nWork/Life Balance - We value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\nBASIC QUALIFICATIONS\n8+ years of cloud based solution (AWS or equivalent), system, network and operating system experience\n5+ years of experience hosting and deploying GenAI/ML solutions (e.g., for data pre-processing, training, deep learning, fine tuning, and inferences) or/and Data Science Experience\n8+ years of coding, data querying languages (e.g. SQL), scripting languages (e.g. Python)\nPREFERRED QUALIFICATIONS\nPhD or Masters of Science degree in Computer Science, or related technical, math, or scientific field (or equivalent experience)\nKnowledge of AWS platform and tools or equivalent cloud experience. Ideally, the candidate has AWS Experience with a proficiency in a wide range of AWS services (e.g. SageMaker, Bedrock, EMR, S3, OpenSearch Service, Step Functions, Lambda, and EC2)\nAWS Professional level certifications (e.g., Solutions Architect Professional, DevOps Engineer Professional, Machine Learning Specialty) preferred\nHands on experience with deep learning (e.g., CNN, RNN, LSTM, Transformer), machine learning, CV, GNN, or distributed training\nExperience with Data Analytics, Data Engineering, Coding, Automation and Scripting (e.g., Terraform, Python)\nStrong communication skills with the ability to explain technical concepts to both technical and non-technical audiences\n\nAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\n\nLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\n\nOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $138,200/year in our lowest geographic market up to $239,000/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site."
  },
  {
    "title": "AI Engineer",
    "company": "Loop",
    "location": "San Francisco, CA 94108 \n(Financial District/South Beach area)",
    "salary": "$130,000 - $200,000 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0A67EbyqQZ2m7633xFuWhEzGHB4JWu7JYf7ZqKJexKnq4fPyJifm1vGClGscZxFjnfFEP0YYbZ16Ak1jgVvbzBzdxtYaxivbm0QEA4oJUgvmq3OtyUzj1Wzv18pcngx-HhhRXF2nBnLJ6zmd85Bh-XWH-V6mwfzKOkwy2UKqkywlYoP8TKlslT_M8hKTBqOFgjAsSaNGV_LhMWS0vmbnRLQJvaEdXqUBzeeatNgiTf9g_p5RRkeeohkf7uWTL5wsj8K_hUuLkWoY6mHoNKrS0FBGJDFyDOcMYH75tafa95VWR88WU5X2eH12TjPkZqFyOURIWC920zA4aCtKAY9xzENd8_U5jHOdg5JBm5o7iXQHFELiR_Nm2DFpGHH3xqJo21YFuJ7z5aqRiPKUG8Tfu7_-thQBzFPhEnTtXI_eHGEHEKRgK56voRK0N41Y7HzXcMaFVTk5TWDf_eEkfceW936S_0Ptm6IxFjmM0dDYySa00oUYEcFHzYzrCSVXqAncoT5hiUkrBsINgS_1rtXeoSEBF0dpUwb-VCJOsDaFmRG3JSJDujrop1L2aov7GNnJDiJIW4Ts2mA_4l3d78Xn3Nsnj2y_W04pyLXPC9zyixCpS4zxMCbq2Llr-u_uRn4CbNzh0cU-KpQnWXLkKLO5_CFqd_RDq06qFK4wLeYCIg0TxrEC7Bttv8rzuMtCl1Qd0bqICy1GgasHKvspEOo_soMvowaTu4ppIpuPd91jOGMeQ==&xkcb=SoCv6_M3sYpPSCSMbp0PbzkdCdPP&camk=nUmJqO2E8rgRUivnvwg1RQ==&p=4&fvj=0&vjs=3",
    "description": "About Loop\n\nLoop is on a mission to unlock profits trapped in the supply chain (https://loop.com/article/unlock-profit-trapped-in-your-supply-chain) and lower costs for consumers. Bad data and inefficient workflows create friction that limits working capital and raises costs for every supply chain stakeholder.\n\nLoop’s modern audit and pay platform uses our domain-driven AI to harness the complexity of supply chain data and documentation. We improve transportation spend visibility so companies can control their costs and power profit. That is why industry leaders like J.P. Morgan Chase, Great Dane, Emerge, and Loadsmart work with Loop.\n\nOur investors include J.P. Morgan, Index Ventures, Founders Fund, 8VC, Susa Ventures, Flexport, and 50 industry-leading angel investors. Our team brings subject matter expertise from companies like Uber, Google, Flexport, Meta, Samsara, Intuit, Rakuten, and long-standing industry leaders like C.H. Robinson.\n\nAbout The Role\n\nLoop is growing its AI team and you’ll have the opportunity to build both AI models and features that directly impact Loop’s business. Loop is positioned to disrupt the incumbent freight audit and pay market, and is one of the companies leading the AI services wave, utilizing AI to automate complex back-office workflows and tasks. You will face and solve many complex technical challenges while you receive guidance and feedback from the team. The range of work here is broad, you can work on everything from training and deploying in-house multimodal LLMs, scaling our inference infrastructure, or building out and shipping AI agent workflows. In doing so, you’ll have the opportunity to define how the AI and broader Loop team will grow.\n\nWhat you will work on\n\nOur primary focus has been on document extraction and understanding, where we utilize multimodal LLMs, including our own in-house foundation model, to extract, normalize, and link data together into our domain model. As Loop’s customers rely on Loop to ingest and normalize highly accurate data, we hold ourselves to a high standard to build models with a very high level of accuracy. In tandem, Loop’s machine learning platform requires a high degree of reliability and scalability, and we expect our training and inference volume to scale several orders of magnitude in the coming year. Going forward, Loop will expand its AI capabilities, expanding into other areas such as workflow automation and audit, where we will utilize agents to tackle these problems.\n\nThis role spans multiple domains:\n\nML modeling – training, evaluating, and deploying models.\nAI engineering – utilizing and orchestrating API LLM models to solve business problems at Loop.\nBackend engineering – building out atomic tasks, general backend work in the servicing or automation domain.\n\nSome projects you might work on:\n\nBuilding the next generation of our foundation model to scale document extraction to multiple languages as Loop scales internationally.\nDeveloping agents to audit freight invoices and ingest long contracts.\n\nQualifications\n\n1+ years of hands-on experience in deep learning frameworks (e.g., PyTorch, Tensorflow, etc.)\nSolid understanding of fundamental ML algorithms, especially multimodal LLMs.\nExperience fine-tuning LLMs and deploying them to production or building out agentic systems.\nAbility to ship high-quality code to production.\nExperience in cloud environments (AWS, Google, Azure).\nStrong communication skills and willingness to collaborate in a cross-functional team environment with domain experts.\nKeep up to date with the latest AI research.\nAbility to work in a fast-paced environment.\n\nBonus Points\n\nPrior startup experience.\nEnd-to-end experience building out machine learning models and features.\n\nCompensation\n\nBase pay 130k - 200k\n\nBenefits & Perks\n\nPremium Medical, Dental, and Vision Insurance plans\nInsurance premiums covered 100% for you\nUnlimited PTO\nFireside chats with industry leading keynote speakers\nOff-sites in locales such as Napa and Tahoe\nGenerous professional development budget to feed your curiosity\nPhysical and Mental fitness subsidies for yoga, meditation, gym, or ski memberships"
  },
  {
    "title": "Sr. Machine Learning Engineer (Recommendation Systems)",
    "company": "Philo",
    "location": "San Francisco, CA",
    "salary": "$200,000 - $237,000 a year",
    "url": "https://www.indeed.com/rc/clk?jk=28080a680aa426d2&bb=HW25cW-A9mcHz-0_tn33BDbo-V_VVh_tK7u9-kTHVHsLFe1R9J7jVNG5prHK-uxC9lyjLMv4VKI5qO9F5VlGiT-E4GnFza8Pj2qFI1tG_ZquocwzOX6Wyul6wlv7e0ZEJ8gAE4wbsu7XrD48qB1HVQHYASyuvyik&xkcb=SoAv67M3sYpPSCSMbp0DbzkdCdPP&fccid=bd430b6c063c761c&vjs=3",
    "description": "At Philo, we're a group of technology and product people who set out to build the future of television, marrying the best in modern technology with the most compelling medium ever invented — in short, we're building the TV experience that we've always wanted for ourselves. In practice this means leveraging cloud delivery, modern tech stacks, machine learning, and hand-crafted native app experiences on all of our platforms. We aim to deliver a rock solid experience on the streaming basics, while cooking up next generation multi-screen and multi-user playback experiences.\nSenior Machine Learning Engineer (Recommendation Systems)\nPhilo's recommendation system improves user engagement and customer satisfaction by tailoring content discovery to individual preferences and viewing habits. We want users to be confident that Philo will have something they want to watch every time they open the app.\nWe are seeking a Senior Machine Learning Engineer to lead our content personalization efforts, shaping experiences that impact millions of users. In this role, you will research, design, and build advanced algorithms and large-scale systems that power Philo's recommendation engine.\nAs a senior member of a growing team, you will tackle complex machine learning challenges and collaborate with data science, product, infrastructure, and backend engineering teams to deliver innovative, data-driven personalization solutions. Your work will directly impact content discovery, deepen user engagement, and drive long-term retention.\nResponsibilities:\nLead development of recommendation systems: Design, build, and optimize advanced algorithms for SVOD, Live TV, and FAST personalization.\nDrive ML innovation at scale: Conduct deep dives into models and system components, ensuring performance, scalability, and robustness across regions and product areas.\nOwn the ML pipeline: Build and maintain reliable pipelines for data extraction, feature engineering, model training, testing, and deployment.\nCollaborate with Product, Data Science & Engineering: Translate product requirements into ML solutions, set clear expectations, and deliver measurable improvements in user engagement.\nAdvance deep learning in recommendations: Apply frameworks such as TensorFlow, PyTorch, or similar to develop state-of-the-art recommendation models.\nExperimentation: Conduct rigorous A/B testing and ML experiments to understand model performance and iterate rapidly based on feedback.\nML Vision and Roadmap: Contribute to the strategic planning of the recommendations roadmap, aligning engineering efforts with business objectives and user needs.\nExplore advanced architectures: Experience with frameworks like Two-Tower models and Deep Cross Networks (DCN) is a strong plus.\nQualifications:\n8+ years of experience in backend engineering and/or data science, including 4+ years focused on machine learning. Experience with recommendation systems is a big plus.\nStrong coding skills in Python, as well as proficiency in using ML frameworks like PyTorch or TensorFlow.\nExcellent analytical and problem-solving skills, with the ability to translate complex technical challenges into business solutions.\nProven track record of leading projects and delivering impactful machine learning solutions.\nStrong communication and documentation skills; capable of explaining complex, technical concepts to non-technical stakeholders and to diligently document your work to help the team as a whole learn and move quickly.\nExperience with Amazon SageMaker or similar MLOps platforms\nMore about Philo\nAt Philo, we're a company that puts people first—both our subscribers and our team. We empower our colleagues to do their best work while supporting one another in pursuing shared goals. We value pragmatism, pride in our work, and passion, with transparency and openness as fundamental parts of our culture.\nWe're committed to diversity, equity, inclusion, and accessibility as we grow the Philo team and shape the future of TV. We believe that a diverse range of voices and perspectives enables us to innovate faster and create the best experiences for our subscribers. Philo is proud to be an Equal Opportunity Employer. We're committed to supporting every candidate and employee. If you need an accommodation at any stage of the process, please email recruiting@philo.com and we'll work with you to meet your needs.\nPhilo offers 70+ top-rated networks, including AMC, BET, CMT, Comedy Central, Discovery Channel, Food Network, Hallmark Channel, HGTV, HISTORY, Investigation Discovery, Lifetime, MTV, Nickelodeon, OWN, VH1, We TV, and more. It also includes all the groundbreaking originals and blockbuster movies available with AMC+ and access to HBO Max Basic With Ads and discovery+. Our service also includes 100+ free channels and premium add-ons like STARZ and MGM+.\nOur extensive library boasts over 85,000 titles, and our unlimited DVR allows users to save their favorite shows and movies for up to a year, skipping ads for a seamless viewing experience. Stream on up to three devices simultaneously, whether on your phone, tablet, laptop, or TV using Roku, Apple TV, Fire TV, Samsung TV, Android TV, Vizio TV, or Chromecast.\nPhilo is headquartered in San Francisco, with offices in New York and Cambridge, MA. Our leadership team includes a Facebook co-founder and alums from Meraki and HBO, backed by NEA and industry partners like Discovery, Viacom, AMC, and A&E.\nJoin us at Philo and be part of a team that's shaping the future of TV!\nStatus: Full-time\nLocation: San Francisco, CA\nCompensation: Includes annual salary between $200K - $237K depending on experience and location, company stock options and health benefits.\nWe value a diverse and inclusive workplace and we welcome people of different backgrounds, experiences, skills, and perspectives. Philo is an equal opportunity employer. We believe that everyone does their best work when they are supported by each other and the company, and we offer a generous set of benefits to make sure the Philo team is happy and healthy. Here is a sampling of the benefits we offer our team:\nFull health, dental and vision coverage for you and your family\n401(k) plan with employer contributions (we match 100% of deferrals up to 3% of pay and 50% of the next 2% of pay)\nFlexible working hours\nUp to 20 weeks of fully paid parental leave\nUnlimited paid time off for vacation and sick leave\n$2,000 annual vacation bonus (we pay you to take a two week vacation)\n$5,250 annually for professional development and educational assistance\n$1,250 annual home office + TV stipend during first year of employment ($250 annually thereafter)\n$500/month ($6,000/year) bonus for employees who commit to working at least 3 days per week in our offices, plus generous commuter benefits ($315/month towards transit, rideshare, bike rental, or parking at our HQ office in San Francisco)\nFree Gympass subscription — an all-in-one corporate benefit that gives employees the largest selection of gyms, studios, classes, training and wellness apps\nDog-friendly office\nAnd much more!\nFor California Residents: Philo's CCPA Notice at Collection – Employees, Applicants, Owners, Directors, Officers and Contractors\nPursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records."
  },
  {
    "title": "Research Engineer – Machine Learning & Systems",
    "company": "World Labs",
    "location": "San Francisco, CA",
    "salary": "Full-time",
    "url": "https://www.indeed.com/rc/clk?jk=121bcde1a59e93a1&bb=HW25cW-A9mcHz-0_tn33BP_KGZ5w15x-ydWjAM-zJldizg-rEjxLQGX5J-bzMkXx4icsPYNXXffSDOA552IXDj0zbq7ZSakfXN6BTEBaWY9oNJoLHqmjlBSXL1asHp1N6Q65ICCjeuIM_ap3xyXtKfzn2zvOmWBw&xkcb=SoAG67M3sYpPSCSMbp0BbzkdCdPP&fccid=dd616958bd9ddc12&vjs=3",
    "description": "Role Overview\nWe are looking for a versatile Research Engineer with a strong background in machine learning or 3D, software development, and systems design. This role is ideal for someone excited about bridging cutting-edge research with practical engineering, and who thrives on solving diverse technical challenges across modeling, infrastructure, and product development.\nYou’ll work closely with researchers, engineers, and product teams to design, build, and deploy advanced models and systems in real-world applications on the cutting edge of spatial intelligence. The role emphasizes hands-on contributions across the entire lifecycle—exploration, prototyping, experimentation, and production deployment. You will help ensure our technology continues to push boundaries in AI and remains robust, scalable, and impactful.\nKey Responsibilities\nResearch, design, and implement machine learning models and systems across multiple domains (vision, generative AI, simulation, rendering).\nDevelop efficient software pipelines and infrastructure for data curation, training, evaluation, and deployment.\nTranslate research insights into production-ready solutions, collaborating with product teams to meet real-world requirements.\nContribute hands-on to all aspects of the engineering cycle—prototyping, optimization, integration, and scaling.\nStay current with the latest research trends and explore opportunities to apply new methods to product and system development.\nShare technical expertise with colleagues, mentor junior team members, and promote engineering best practices.\n\nIdeal Candidate Profile\n3+ years of experience in applied machine learning, research engineering, 3D, or related development roles, ideally in fast-paced or startup environments.\nProficiency with ML frameworks such as PyTorch or TensorFlow, and solid understanding of generative modeling, deep learning, or reinforcement learning.\nDemonstrated ability to work across different problem domains (e.g., computer vision, simulation, graphics, or systems).\nProven track record of delivering robust prototypes and/or production systems.\nStrong coding skills in Python (additional experience with C++ or CUDA a plus) and comfort with GPU-accelerated computing.\nStrong problem-solving skills with the ability to adapt quickly, manage ambiguity, and operate in a dynamic environment.\nExcellent communication skills, with the ability to work effectively across research and product-focused teams.\nNice to Have\nContributions to open-source projects in ML, systems, or developer tools.\nExperience with large-scale training or distributed systems (multi-GPU or multi-node).\nFamiliarity with deployment and integration of ML models in production settings.\nExperience writing efficient low-level code (e.g., CUDA kernels, performance optimization)."
  },
  {
    "title": "Software Engineer, Infrastructure (Onboard System & Toolchain)",
    "company": "pony.ai",
    "location": "Fremont, CA",
    "salary": "$130,000 - $250,000 a year",
    "url": "https://www.indeed.com/rc/clk?jk=45a208576c409927&bb=HW25cW-A9mcHz-0_tn33BFzvQjb6TCn5-sQzaWDnfjiNxZALg7DZQ1bB2M5WsX8c1ha7EyJs0Akqpd4rUYvSTbWnYHCwjk5PlHwcVboEmptGaAP2aiqGllnycqjHz6b8TpqQNKLvHlnj1BWc6xtBGl1P6FMeKkK0&xkcb=SoCy67M3sYpPSCSMbp0AbzkdCdPP&fccid=ff5c40dcb95012b5&vjs=3",
    "description": "Founded in 2016 in Silicon Valley, Pony.ai has quickly become a global leader in autonomous mobility and is a pioneer in extending autonomous mobility technologies and services at a rapidly expanding footprint of sites around the world. Operating Robotaxi, Robotruck and Personally Owned Vehicles (POV) business units, Pony.ai is an industry leader in the commercialization of autonomous driving and is committed to developing the safest autonomous driving capabilities on a global scale. Pony.ai’s leading position has been recognized, with CNBC ranking Pony.ai #10 on its CNBC Disruptor list of the 50 most innovative and disruptive tech companies of 2022. In June 2023, Pony.ai was recognized on the XPRIZE and Bessemer Venture Partners inaugural “XB100” 2023 list of the world’s top 100 private deep tech companies, ranking #12 globally. As of August 2023, Pony.ai has accumulated nearly 21 million miles of autonomous driving globally. Pony.ai went public at NASDAQ in November 2024.\nResponsibility\nWe are seeking a talented Software Engineer to join our Onboard Infrastructure team. In this role, you will collaborate with world-class engineers to design, build, and maintain the core systems and toolchain that empower the development of fully autonomous driving technologies. You will be responsible for both the in-vehicle systems and offline infrastructures that power our end-to-end development cycle—including replay, simulation, and system diagnostics. You will build robust infrastructure to enable efficient performance evaluation, large-scale data processing, and fast iteration for mission-critical systems.\nDesign, build, and maintain scalable and efficient pipelines to support development and deployment of autonomous driving software on vehicle platforms and in offline environments.\nOptimize build and test performance by analyzing bottlenecks, caching strategies, and test topology.\nDevelop and maintain scalable simulation and replay platforms to evaluate vehicle software behavior\nDesign and implement interactive dashboards and data visualization tools to surface insights across vehicle and simulation data.\nCollaborate with various engineering teams to ensure the infrastructure supports cross-functional needs, including real-time systems, simulation, and machine learning modules.\nRequirements\nBachelor's degree or above, computer science or related major.\n3+ years of professional experience in software engineering.\nBachelor's degree or above, computer science or related major.\nSolid experience developing production-quality software in C/C++, Python\nStrong understanding of Unix/Linux based operating systems.\nProficiency in Git and experience with Git-based development workflows.\nExceptional troubleshooting, problem-solving, and communication skills.\nStrong organizational and time management skills, with the ability to prioritize tasks and meet deadlines in a fast-paced environment.\nPreferred Experience:\nProficient in containerization and orchestration, with hands-on experience in container runtimes (e.g., Docker, containerd) and orchestration platforms (e.g., Kubernetes).\nProficiency with Bazel or similar large-scale build systems and dependency management tools.\nHands-on experience developing with or integrating distributed database systems in diverse environments.\nExperienced in creating dashboards and reports to communicate analytical insights using data visualization tools (e.g., Metabase).\nSkilled in backend development with Python, covering API design (REST/GraphQL), distributed data pipelines, and system integration, using modern frameworks and cloud-native practices.\nCompensation and Benefits\nBase Salary Range: $130,000 - $250,000 Annually\nCompensation may vary outside of this range depending on many factors, including the candidate’s qualifications, skills, competencies, experience, and location. Base pay is one part of the Total Compensation and this role may be eligible for bonuses/incentives and restricted stock units.\nAlso, we provide the following benefits to the eligible employees:\nHealth Care Plan (Medical, Dental & Vision)\nRetirement Plan (Traditional and Roth 401k)\nLife Insurance (Basic, Voluntary & AD&D)\nPaid Time Off (Vacation & Public Holidays)\nFamily Leave (Maternity, Paternity)\nShort Term & Long Term Disability\nFree Food & Snacks\nPlease click here for our privacy disclosure."
  },
  {
    "title": "Senior Machine Learning Engineer",
    "company": "TETRAMEM INC",
    "location": "San Jose, CA 95131 \n(North Valley area)",
    "salary": "$110,000 - $300,000 a year",
    "url": "https://www.indeed.com/rc/clk?jk=08a19faaec27d166&bb=HW25cW-A9mcHz-0_tn33BOFVY46cluWjmBVTofjeOghcJqVqKxe9Pa4KaeFE_4HaOGc6ai4U6mot7CAxuMEzE54MOaOCFwgX2au6IEJ5LSMYSMlCA1C8U2rh3k9fdlG0jR7dmuItjITxZ8MS4lj5GrKHGYra6U0a&xkcb=SoA867M3sYpPSCSMbp0HbzkdCdPP&fccid=781e9c6ab28d76a7&vjs=3",
    "description": "Responsibilities:\nDevelop, optimize, and deploy lightweight machine learning models for edge AI applications, particularly for audio processing.\nImplement and optimize ML models on embedded platforms, including FPGA and custom ASIC solutions.\nWork closely with hardware and software teams to integrate ML models into production systems.\nResearch and implement state-of-the-art ML techniques to enhance model efficiency, latency, and power consumption for embedded AI applications.\nImprove inference efficiency and model compression techniques, including quantization, pruning, and knowledge distillation.\nCollaborate with cross-functional teams to drive innovation and contribute to the overall system architecture.\nProvide technical leadership and mentorship to junior engineers.\nPublish research findings, present at conferences, and contribute to open-source projects when applicable.\n\n\n\nRequirements:\n5+ years of experience or PhD in Computer Science, Electrical Engineering, or related fields.\nStrong experience in machine learning, with a focus on edge AI and lightweight model deployment.\nExpertise in ML frameworks such as PyTorch, TensorFlow, JAX.\nProficiency in programming languages such as C/C++, Python, and experience with ML model optimization.\nAbility to work independently and collaboratively in a fast-paced startup environment.\n\n\n\nExperience in one or more of the following areas considered a strong plus:\nUnderstanding of ML compiler and runtime design.\nExperience working with tools such as Optimum, ONNX, TensorRT, TFLite/LiteRT, ncnn, or CoreML.\nFamiliarity with hardware acceleration techniques.\nExperience in embedded system development.\nSalary Range: $110,000 - $300,000 / year"
  },
  {
    "title": "Senior ML Engineer",
    "company": "Shopmonkey",
    "location": "Hybrid work in San Jose, CA",
    "salary": "$163,000 - $195,000 a year",
    "url": "https://www.indeed.com/rc/clk?jk=c12afe061f878231&bb=HW25cW-A9mcHz-0_tn33BJKMDkLE2Nr2pUIodCBG9hvnt_fC7XEKv57UFsWV1rth59DgytUvoJPF7PuicwP6sA9OkPkbpoCoPWjrzsYC4IagB-dU-1CzyAzaiek3NpK8TrtFSIg9X9ZSQB2lo048jpkyBEGPKSYm&xkcb=SoCI67M3sYpPSCSMbp0GbzkdCdPP&fccid=fbdeae1a6b58ca60&vjs=3",
    "description": "Shopmonkey's vision is to help every shop thrive by equipping them with the tools they need to run and grow their business. Our cloud based all-in-one shop management software takes owners and technicians from quote to cashing out a satisfied customer. Our software has a modern and intuitive UI and our backend is powered by the latest technologies so our clients can focus on the things they do best.\nAs a Senior ML Engineer at Shopmonkey, you will be a part of a globally distributed engineering team working closely with your product and design counterparts. You will have the chance to work on the frontier of agentic AI, applying cutting-edge LLMs and co-pilot frameworks to meet real-world auto shop needs. Shopmonkey has the structured data, workflows, and operational maturity to deliver AI that's not only intelligent but trusted and useful. You'll move fast to bring AI agents from discovery all the way through production, helping to shape the future of the automotive care experience. Please note this is a hybrid position, with an expectation of 2-3 days per week on-site at our Morgan Hill office.\nWhat You Will Do:\nBuild and ship production-ready AI agents that automate key workflows (e.g., appointment setting, inventory ordering).\nDesign and implement workflows and scripts for agentic conversations based on real-world data.\nPerform discovery with your Squad on key customer use cases and guide the development of use-case-driven agents.\nConduct end-to-end development including data gathering, hypothesis testing, prototyping, demoing, productionizing, and monitoring.\nImplement NLP and LLM-powered components for sentiment analysis, real-time conversation evaluation, and behavior optimization.\nDesign evaluation agents to enhance the quality and coherence of autonomous conversations.\nWork within a modern MLOps environment to ensure scalable and reliable deployment of models.\nContribute to analytics and predictive features such as no-show prediction and sentiment dashboards.\nTranslate complex ML workflows into digestible updates for cross-functional stakeholders.\nContribute to backlog velocity by owning appropriate tickets and delivering high-impact work in a collaborative, fast-paced environment.\nWe Are Looking For People Who Have:\nProven experience shipping models into production (not just proof-of-concepts).\nProficiency in Python or TypeScript; strong SQL skills for working with large-scale data.\nExperience with LLMs and NLP frameworks (e.g., TensorFlow, Hugging Face, LangChain).\nCloud infrastructure experience, (e.g. GCP, AWS).\nUnderstanding of MLOps, including orchestration tools like Airflow or Dagster.\nStrong collaboration and communication skills—comfortable working with PMs, designers, engineers and other cross functional team members.\nConducted code reviews and have to ability to provide constructive feedback\nBachelor's degree in a STEM field, or equivalent practical experience.\n5+ years of industry experience in applied machine learning or AI engineering; advanced degrees (Master's or PhD) may offset years of experience.\nBonus Points:\nPrior experience working at a high growth startup.\nExperience building consumer-facing agents in vertical SaaS, in the automotive industry (business or consumers).\nBackground in data processing or real-time analytics.\nExperience with Snowflake or other large-scale data warehouse solutions.\nIn the United States, the range is typically a salary of $163,000 to $195,000 + bonus + equity + benefits. The range provided is Shopmonkey's reasonable estimate of the base compensation for this role. The actual amount will be based on job-related and non-discriminatory factors such as location, experience, training, skills, and abilities. Consult with your Recruiter during the initial call to determine a more targeted range based on these job-related factors. In addition to this base compensation company stock options and benefits as outlined below are included.\nWhy Shopmonkey?\nShopmonkey has become an amazing environment where employees feel that they are valued as people, and not just worker bees. To ensure that our team thrives, we invest in the following perks (benefits below are mainly for U.S. based, full-time employees). Other benefits vary upon location outside of the United States, and employment status:\nHealth & Wellness\nMedical, dental, vision, and life insurance benefits available the 1st of the month following hire date\nShort term and long term disability\nEmployee assistance program\nReimbursement for a personal health and wellness membership\nGenerous parental leave\n401(k) available upon hire\n✈️ Time Off\n11 paid holidays\nFlexible time off - take the time off you need!\nGiving Back\nMatching donations for approved charitable organizations\nGroup volunteer efforts\nCheck out our founder's story, life page, or hear from real employees about what it's like to work at Shopmonkey.\nJoin our team of hungry, humble, smart people who love what they do, and change the auto industry by helping every shop thrive.\nAbout the Industry\nThe U.S. is the second largest passenger vehicle market with more than 260 million registered passenger vehicles, and the global car repair market is estimated to be worth more than $500B. Shopmonkey aims to change the status quo and enable auto shops to become more efficient and give their customers a more delightful experience.\nAbout Shopmonkey\nShopmonkey is the leading auto-repair shop software company; it is a cloud-based solution that helps auto-repair shops consolidate tools, save time, and streamline their entire operation onto a simple, easy-to-use platform.\nHeadquartered in Silicon Valley and trusted by more than 3,500+ auto shops across the U.S. and Canada, Shopmonkey aims to change the status quo of the car repair market, estimated to be worth more than $500B.\nIn 2021 Shopmonkey raised a $75 million Series C, supported by top-tier Silicon Valley venture capital firms Bessemer Venture Partners, Index Ventures, Headline, I2BF, and ICONIQ Growth.\nIn 2022, Shopmonkey was named #4 on Forbes' annual ranking of America's Best Startup Employers list (and #1 in Business Products & Software Services). Shopmonkey was once again named as one of America's Best Startup Employers by Forbes in 2023 and 2024.\nShopmonkey is committed to building a diverse and inclusive team. We are looking for team members from all backgrounds that are committed to the Shopmonkey mission.\nShopmonkey provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training.\nShopmonkey is committed to the full inclusion of all qualified individuals. In keeping with our our commitment, Shopmonkey will take the steps to assure that people with disabilities are provided reasonable accommodations. Accordingly, if reasonable accommodation is required to fully participate in the job application or interview process, to perform the essential functions of the position, and/or to receive all other benefits and privileges of employment, please contact our Talent Team at hiring@shopmonkey.io.\nPlease note: Shopmonkey will never request sensitive information such as your social security number, bank account information, or other non-publicly available information during the application and interview process. If an applicant is extended an offer of employment, such sensitive information will be requested at that time. Shopmonkey will never ask you to receive and ship packages or goods as part of the interview. Other practices to be on alert for:\nContact initiated via unsolicited text message or cold call. Shopmonkey does not follow up with candidates through instant messaging applications.\nOur Talent Acquisition team only corresponds from email addresses with the domain '@Shopmonkey.io'. If a generic email ID ending with Gmail/Yahoo or other domain is used while receiving a job offer or interview call, there is a likelihood of a scammer.\nWhile some of our jobs can be found on third party job sites, all of our current job opportunities and descriptions are posted on Shopmonkey's Careers page, or our official LinkedIn Company Page\nThe U.S. Federal Trade Commission has published helpful articles to help individuals learn more about protecting themselves from recruiting scams and financial fraud. If you believe you were a victim of such a scam, you may contact your local law enforcement agencies. Shopmonkey is not responsible for any claims, liability, losses, damages, or expenses resulting from scammers or impersonators."
  },
  {
    "title": "Machine Learning Engineer, Autonomy",
    "company": "Blue River Technology",
    "location": "Remote in Santa Clara, CA",
    "salary": "$108,000 - $193,000 a year",
    "url": "https://www.indeed.com/rc/clk?jk=44ca778ccc90cecb&bb=HW25cW-A9mcHz-0_tn33BIPppl19nx5_fAOJz4W0mh0L4pFJPDempWB12A_eXapKpk69ioWRIm0ihNyMHVL8Gx6PkEL6KDadvFj0Z-BfacdA6zbgSjoZ3cXmGOcSzeC_eJgHCD2D6RRrTpaPNJ1DVzoy5WHNSOoR&xkcb=SoBy67M3sYpPSCSMbp0NbzkdCdPP&fccid=d222f47157f92ce5&vjs=3",
    "description": "We're Blue River, a team of innovators driven to create intelligent machinery that solves monumental problems for our customers. We empower our customers – farmers, construction crews, and foresters - to implement safer and more sustainable solutions, driving increased profitability with less reliance on scarce labor. We believe that focusing on the small stuff – pixel-by-pixel and task-by-task - leads to big gains.\nBlue River Technology aligns with John Deere's vision to \"innovate on behalf of humanity\" by quickly identifying and solving high-value, high-uncertainty challenges in AI, machine learning, computer vision, and robotics. BRT acts as a research and development flywheel, building not only new products but also new platforms that reliably create value for both Deere and its customers. From fully autonomous machines to highly precise farming equipment, BRT and Deere are partnering to create technical breakthroughs in industries like agriculture and construction.\n\nSummary\nWe are looking for a highly skilled and innovative Machine Learning Engineer to join the team responsible for building the perception stack for Blue River Technology's autonomous tractor initiative. You will be responsible for working on the development of CVML models, training and testing pipelines to enhance system safety and performance in challenging production environments. This role will range from developing initial prototypes to scaling for production. We're looking for a motivated and collaborative individual to help build the future of autonomous agriculture.\nEmployment Type: Full-Time\nWork Location: Remote in the United States\nVisa sponsorship is not available for this position.\nJob Responsibilities\nA combination, not necessarily all-inclusive, of the following:\nImplementing deep-learning-based classification systems for identifying, characterizing, and classifying various farm-related objects using images and videos.\nExploring and developing new methods for improving detection performance and increasing the speed of processing.\nWorking with the Software team to transition processing from desktop/server-class machines to real-time, field robotic systems.\nWork with systems software engineers to help architect and develop data processing and annotation pipelines for continuous system monitoring and improvement.\nRequired Experience and Skills\nBachelor's or Master's Degree in Computer Science or a related field, graduate degree preferred.\n2 years of experience developing high-performance ML systems, training and optimizing DNNs for segmentation, depth, and related perception tasks with large-scale datasets.\nStrong Python + PyTorch/TensorFlow skills.\nSolid grasp of vision + deep learning fundamentals.\nStrong communication skills to work closely with interdisciplinary teams to integrate models into edge and cloud systems.\nPreferred Experience and Skills\nExperience building and deploying full-stack ML pipelines, from data ingestion to model training, testing, and deployment.\nEdge deployment or real-time optimization know-how.\nExperience in working with CVML & Robotics projects.\nExperience with multi-view geometry or SLAM.\nExperience in the vehicle autonomy space.\nExperience in metrics implementation, analysis, and dashboarding.\nKnowledge of robotics libraries such as ROS / ROS2.\nOnly individual applicants will be considered. We do not work with unsolicited third-party agencies or proxy interview services.\nAt Blue River, we're passionate about creating an inclusive workplace that promotes and values diversity. While we have more work to do to advance diversity and inclusion, we're investing in our programs, including recruiting, mentorship, career development, and learning & development to ensure they support our Diversity, Equity, and Inclusion goals. We support each employee in living a full life, enabling a thriving career, and accomplishing a meaningful, challenging mission while collaborating with incredible people. We are dedicated to building a diverse and inclusive workplace, so if you're excited about this role but your experience doesn't align completely with the job description, we encourage you to apply anyway.\nWe are an equal-opportunity employer and do not discriminate based on race, religion, color, national origin, sex, gender, gender expression, sexual orientation, age, marital status, veteran status, or disability status. We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, perform essential job functions, and receive other benefits and privileges of employment. Please contact us to request an accommodation.\nThe US annual base salary range for this position is $108,000 - $193,000, along with eligibility for Blue River's bonus and benefit programs.\nOur salary ranges are determined by role, level, and location. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your location during the hiring process. During the recruitment process, we may identify an alternative role or level to which you are more suited. If your ideal role at Blue River differs from the advertised position, we will provide an updated pay range as soon as possible during the hiring process.\n#LI-AN1"
  },
  {
    "title": "Full Stack AI Engineer",
    "company": "CuraFi",
    "location": "San Francisco, CA 94107 \n(Potrero Hill area)",
    "salary": "$150,000 - $160,000 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0AEKVQ-nwt1a-Aq0kjGjJJlTzAb2psuh9whMlq1Ll5ENbPMvLgxmiXGF-pQfKQPX1uFAKMiPrTPt2zmygz1At51QarXN91sVjNRkF7kYGryBtbir0R0WsCWbYOBZj6yQ0BeZd133bnDtTK_H2J4AykTO2Qn1u-iyT-lYu-FcSBuegB2F7K0aTNTpWC7CdimghCZw9ZZzRVSRITcaq3LdV6SqrYEhfiABZ9PbqQzM4epK2_9ns8NihN6yEHEapKgdL_MQAB8L37qdw2lPCcngIfdFstXZ5H8MhHvf3WRQPxGUzy5j427wQSYPCJTYGeZyKj1GWIgVSzd_Cx6dNkCxLc3JAHcdNCMmWsO8oTCa4mSvfDXr8Hxg3u9pX6OElPK2LL14Ko2wEYNzdjpdo7whcw51X6BUeVifdmVgQHAN18d21FOyUThr57qkqKREgiPhCVUtSDhTq510p_fE1e5pom1KVvKOmIgM4x1N_tmMD_8z1rMcFlkEvW-jfcD9FZC55pSeY_xjPorBGy6wTyQ_Cz426nZdQGjP1dJ4ucNoz9ptjqO7hVWt-ovXbkJ8siMLaMkYkDgGFu4GsArcApSlAeBOjFpS5pYnAr0zAtNTHQu2AlDBk13oV2ziv_aY9yWyar2_Yizc8jl9GS1N7I3Ib4TjdJVQxPM2HdADsNDrx90_N3E_UA7_wuBDxvoJyBebBwtHe7t5TlVkQ==&xkcb=SoC86_M3sYpPSCSMbp0LbzkdCdPP&camk=UoKtGZLa3XIa2oV8P_V83Q==&p=0&fvj=0&vjs=3",
    "description": "About CuraFi:\nAt CuraFi, we develop advanced software solutions that facilitate the management of specialty drugs and improve the healthcare journey for patients with complex conditions. Our platform assists healthcare providers and payers by offering tools that provide insights into drug cost management, risk analysis and provider enablement. As a member of our team, you will play a crucial role in evolving our products and driving significant impact in the healthcare sector.\nTechnical Skillset Required:\nReact 16.8+ (React hooks): Proficient in building responsive and intuitive user interfaces.\nPython: Advanced skills in Python for robust backend development.\nWeb Frameworks: Experience with Flask or comparable frameworks.\nSQL (MySQL): Strong ability to perform complex database queries and manage data effectively.\nAI/ML: Previous experience integrating third party LLM APIs into systems including but not limited to OpenAI, Groq, Claude, Perplexity\nKey Responsibilities:\nDesign, develop, and maintain both front-end interfaces and backend services with AI capabilities.\nCreate and manage RESTful APIs and integrate AI services such as LLMs, embeddings, and document parsing tools.\nExtract, transform, and analyze large datasets to enhance product features and user experience.\nImplement machine learning pipelines and real-time decision support tools that integrate into provider workflows.\nEnsure high code quality through rigorous testing, code reviews, and debugging.\nProactively solve technical issues and contribute to all phases of the development lifecycle.\nStay updated with emerging technologies and incorporate them into our operations where beneficial.\nWillingness and ability to travel to customer sites as needed to support implementation, training, or ongoing collaboration.\nPreferred Qualifications:\nExperience applying LLMs or generative AI to solve real-world problems (e.g., summarization, RAG, document automation).\nSkills in prompt engineering, embedding models, or working with vector databases.\nStrong skills in data manipulation and API development.\nExperience in or knowledge of the healthcare industry, particularly in managing healthcare data.\nProficiency in deploying applications on cloud platforms like AWS or Heroku.\nWillingness to travel nationwide (~10%) to meet clients and support deployments\nPersonal Attributes:\nAbility to work independently and collaboratively with a team.\nWillingness to engage deeply with complex problems and deliver innovative solutions.\nEnthusiastic about hands-on involvement and capable of taking initiative in a dynamic environment.\nExperience:\nAt least 5 years in software development, with significant exposure to full-stack projects and 1–2 years working on AI/ML-related applications or projects.\nJob Types: Full-time, Contract\nPay: $150,000.00 - $160,000.00 per year\nBenefits:\n401(k)\nDental insurance\nFlexible schedule\nHealth insurance\nPaid time off\nRelocation assistance\nVision insurance\nAbility to Commute:\nSan Francisco, CA 94107 (Required)\nAbility to Relocate:\nSan Francisco, CA 94107: Relocate with an employer provided relocation package (Required)\nWork Location: In person"
  },
  {
    "title": "ML Engineer",
    "company": "Prospance Inc",
    "location": "Fremont, CA 94536 \n(Niles area)",
    "salary": "$70.78 - $80.15 an hour",
    "url": "https://www.indeed.com/rc/clk?jk=9cebc318ece9611e&bb=HW25cW-A9mcHz-0_tn33BHzJzIJ3dmS_srrxSLQWH2ZCxU5uMhu24OqAAw7gPm5_JcuJcWnUBq23J05R43Kzpxt3Bo2SA3VT7QFathSn3_Evlx_5fFJu1ggz2qblOaBjdc-Gaq1xlIRDsGiukGtL2IG5iMbLLjg3&xkcb=SoDG67M3sYpPSCSMbp0MbzkdCdPP&fccid=d9ff0d7fd00093cd&cmp=Prospance-Inc&ti=Ai%2Fml+Engineer&vjs=3",
    "description": "Job Description:\nServe as a member of the factory software machine learning and computer vision team. Design, develop and implement critical machine learning models that operate on our factory and warehouse environments. Take ambiguous problem statements and build end-to-end models using a variety of techniques and tools like supervised learning, convolutional neural networks, Pytorch, Pandas, etc. Work closely with partners in production, process, controls, quality, etc. to build solutions for the hardest problems faced in our operations. Will take ownership of models in production and ensure there is proper alerting systems in place to rapidly deal with any issues that occur. Must be able to clean and deal with diverse and heterogeneous data sets that combine many modalities like images, multi-spectral sensor outputs, voice, text, and tabular data.\nMinimum Requirements:In-depth knowledge of Python for high-performance data-intensive applications.Familiarity with at least one modern deep learning framework (Pytorch, Jax, Tensorflow, etc.)Expertise in one or more areas like computer vision, large language models, recommender systems, or operations research.Foundational knowledge of statistics for comparing models and assessing solution feasibility and performance.Real-world experience deploying and maintaining production machine learning use-cases.Passion for clean code and sustainable modular code for taking research ideas into production.\nJob Type: Contract\nPay: $70.78 - $80.15 per hour\nExpected hours: 40 per week\nBenefits:\n401(k)\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\nWork Location: In person"
  },
  {
    "title": "Principal AI/ML Engineer - Onboard Embodied AI",
    "company": "General Motors",
    "location": "Mountain View, CA",
    "salary": "$259,000 - $396,700 a year",
    "url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0BqJjBsvJkVIRVupdyx-l7jJlkPL5nU6SVET5Mq4mDejegpz4R4z9X6QNcQ1GgqKr5LJWCtKe0SRLHc6YI0dOJ_BkmaDsPHccyGQ0KNyfW4Lp6VDrZbpfGaKnz_TEsQNVncKLTDM32fcmU7kd2haAAeoe9aY_o6rwwY3DJAxQ-qItcgbnng0HqTO8tbr3FUkmws85DC88zVv078jMQiE-6LxebeFACjPrGZzTJpVX7MQYXShB8Oa2x4trge7WxdCgL7t0cEdCCcczyQoz8UUhKfnvQgyiBXYv7RTgFPNCBNnxMNkpUfd33tl30iSx19E6ldEwGroclPTWTMqkVNDpAZY2LRGrObgaZFPWw4RBpN9oKKU6yf0qnFyltwjeqSUdnqZTsjxx8VwBMYMj4D-QOAm9vtmxdY8Rv_uDw0jNmkJF0etYpOCkX6SXwAqnclW8OQBHgD-bQEO1iNpyCTf9E3_bLnoCTCr7b9aVMs0xIf6YYViI_dWFXN3qcbEktKj6p3elVj9mu6axNrfFaLfoYxmJggZfhoRGWZMcvRIQyC1cnyHhDSrpOCES4-_11kh-j2MsvoSha4qVDviU2fuGieqNxv8mIygo1eouGHf0WGfZHAMNJLqo9z4BWqlZPcG72LPKwECK6Lk5bSgV6ZeYEgQWF9_ieBMj8IQfquk30d6foopDIvZh5QuWe9lNR3vGHtCxeLTT3r2Gf1vhEPhkRHMiP9hQCDs564fakCuYQcLMv_YwMR4f_C_M915_u1Gl5f-9Ok8bAOmlYHLCOwuUuU6awXyu0UhL4DpuMhFBBrhtYGj-cuSG-JDvsXil_xeSI=&xkcb=SoAI6_M3sYpPSCSMbp0KbzkdCdPP&camk=nUmJqO2E8rh8JLMt8M-EVQ==&p=1&fvj=0&vjs=3",
    "description": "Job Description\nRole:\nAs a Technical Lead in Machine Learning within the Onboard Embodied AI organization, you will be a senior individual contributor driving cutting-edge end-to-end machine learning solutions directly impacting autonomous driving performance. Your role is pivotal in designing, architecting, and deploying advanced ML models that translate raw sensor data into actionable driving behaviors, enabling vehicles to robustly navigate diverse real-world scenarios and conditions. You'll lead critical technical initiatives, collaborate closely with cross-functional teams, mentor ML engineers, and significantly shape the future of onboard ML capabilities.\nThe Onboard Embodied AI team is at the forefront of developing groundbreaking onboard ML systems powering fully autonomous vehicles. We leverage modern end-to-end machine learning approaches with sophisticated neural networks trained from large-scale driving data and using state - of - the - art alignment approaches . Our solutions enable vehicles to understand complex, dynamic driving environments, handle uncertainty gracefully, and adapt seamlessly to changing conditions. Join a collaborative and innovative team redefining autonomy through state-of-the-art machine learning, delivering solutions that move beyond current technological boundaries.\nKey Responsibilities:\nDrive the design, development, and deployment of advanced onboard ML models, delivering end-to-end solutions capable of real-time inference and robust autonomous driving performance.\nLead and architect complex machine learning projects, from conception through validation to onboard implementation, emphasizing scalability, robustness, and safety-critical operation.\nChampion innovation in neural network architectures, training methodologies, and inference optimization strategies suited for real-time onboard deployment.\nProvide technical mentorship and thought leadership, elevating engineering practices, and fostering ML innovation across teams.\nCollaborate closely with multidisciplinary engineering groups, ensuring seamless integration of ML capabilities into autonomous vehicle systems.\nInfluence technical roadmaps, shaping strategic ML priorities aligned with company objectives and product milestones.\nYour Skills & Abilities:\nMaster's or Ph.D. in Machine Learning, Robotics, Computer Science, Electrical Engineering, or a related technical field.\n5 + years of modern machine learning techniques\nExtensive experience developing and deploying advanced ML systems, particularly in end-to-end real-time onboard applications.\nProven track record as a technical leader and expert in developing robust deep learning models that directly map sensor data to actionable outputs within safety-critical systems.\nDeep expertise in state- of- the-art computer vision techniques, neural architectures, representation learning, real-time inference, model optimization, and robustness under uncertainty.\nStrong software engineering proficiency , particularly Python and C++, alongside extensive hands-on experience with modern ML frameworks ( PyTorch , TensorFlow, JAX).\nExcellent communication, collaboration, and mentoring abilities, comfortable influencing technical strategy and guiding ML engineering excellence across the organization.\nBonus: AV/ADAS experience is a big plus\nCompensation : The compensation information is a good faith estimate only. It is based on what a successful applicant might be paid in accordance with applicable state laws. The compensation may not be representative for positions located outside of New York, Colorado, California, or Washington.\nThe salary range for this role is $259,000 to $396,700. The actual base salary a successful candidate will be offered within this range will vary based on factors relevant to the position.\nBonus Potential: An incentive pay program offers payouts based on company performance, job level, and individual performance.\nHybrid: This role is categorized as hybrid. This means the successful candidate is expected to report to the Mountain View Technical Center in the Bay Area three times per week, at minimum.\nRelocation: This job may be eligible for relocation benefits.\n#LI-MH2\n&#xa;&#xa;\nAbout GM\nOur vision is a world with Zero Crashes, Zero Emissions and Zero Congestion and we embrace the responsibility to lead the change that will make our world better, safer and more equitable for all.\n&#xa;&#xa;\nWhy Join Us\nWe believe we all must make a choice every day – individually and collectively – to drive meaningful change through our words, our deeds and our culture. Every day, we want every employee to feel they belong to one General Motors team.\n&#xa;&#xa;\nBenefits Overview\nFrom day one, we're looking out for your well-being–at work and at home–so you can focus on realizing your ambitions. Learn how GM supports a rewarding career that rewards you personally by visiting Total Rewards Resources .\n&#xa;&#xa;\nNon-Discrimination and Equal Employment Opportunities (U.S.)\nGeneral Motors is committed to being a workplace that is not only free of unlawful discrimination, but one that genuinely fosters inclusion and belonging. We strongly believe that providing an inclusive workplace creates an environment in which our employees can thrive and develop better products for our customers.\nAll employment decisions are made on a non-discriminatory basis without regard to sex, race, color, national origin, citizenship status, religion, age, disability, pregnancy or maternity status, sexual orientation, gender identity, status as a veteran or protected veteran, or any other similarly protected status in accordance with federal, state and local laws.\nWe encourage interested candidates to review the key responsibilities and qualifications for each role and apply for any positions that match their skills and capabilities. Applicants in the recruitment process may be required, where applicable, to successfully complete a role-related assessment(s) and/or a pre-employment screening prior to beginning employment. To learn more, visit How we Hire .\n&#xa;&#xa;\nAccommodations\nGeneral Motors offers opportunities to all job seekers including individuals with disabilities. If you need a reasonable accommodation to assist with your job search or application for employment, email us or call us at 800-865-7580. In your email, please include a description of the specific accommodation you are requesting as well as the job title and requisition number of the position for which you are applying."
  },
  {
    "title": "Machine Learning Research Engineer",
    "company": "Prophecy",
    "location": "San Francisco, CA \n(Bayview Hunters Point area)",
    "salary": "$250,000 - $350,000 a year",
    "url": "https://www.indeed.com/rc/clk?jk=591302219dc395e5&bb=HW25cW-A9mcHz-0_tn33BJVAdjyjcZgc9Lsbjcwx6ufHef8DRdAx4mZnjq8M5jMTdwVZEBCvmbFAK7z6pfegfSZkBNlkJg6FLMTgF-07C3noCp2suVCqCMGpnD4ggtwety-pcp-gt1p2aA0DFCp2gV5M7K5bFuIS&xkcb=SoCb67M3sYpPSCSMbp0CbzkdCdPP&fccid=17798fe25c6ed8f7&vjs=3",
    "description": "About Prophecy\nProphecy is the world's most advanced data integration platform, designed to make complex data work simple and powerful. Designed natively for modern cloud data platforms, Prophecy uniquely serves the needs of business analysts while ensuring enterprise-grade governance and compliance, giving organizations the confidence to innovate. Our AI-driven platform simplifies and automates data preparation, accelerating AI and analytics across Fortune 500 companies in banking, insurance, healthcare, life sciences, and technology. By enabling secure, self-service data transformation within a robust governance framework, Prophecy empowers every data user to develop, deploy, and monitor cloud-native data pipelines with ease. Today, Prophecy supports tens of thousands of pipelines, delivering clean, trusted, and timely data at scale to power the most demanding AI and analytics workloads.\nMust-Have Skills:\nAdvanced ML/LLM knowledge: hands-on fine-tuning (SFT, DPO, RLHF), distillation, quantization/pruning for model optimization.\nFull ML lifecycle: from data acquisition to training to productization with PyTorch and open-source transformers (e.g., HuggingFace).\nFluency in Python for dataset/model processing.\nExperience with backend pipelines/microservices software development in public cloud: AWS, k8s, java, scala.\nBuilder mentality: Experience taking ideas to production.\nWhat Will Make You Stand Out\nML/LLM work in code generation (e.g., Codex, text-to-SQL), semantic extraction, or knowledge graphs (e.g., Neo4j, Neptune).\nExperience with big-data engines like Spark.\nCompiler development for languages like SQL, Python, or Scala.\nOptimization of ML models for low-latency, high-throughput production use.\nContributions to open-source AI/ML projects (e.g., Hugging Face, PyTorch).\nExpertise in retrieval systems or vector databases (e.g., Pinecone, Weaviate).\nSkill in evaluating tech and driving build/buy decisions.\nSeniority: Jr to Staff Level\nExperience: 1+ years in industry\nCompensation: $250,000–$350,000\nReflected is the base pay range offered for this position. Pay may vary depending on factors including but not limited to achievements, skills, experience, or work location. The range listed is just one component of the compensation package offered to candidates.\nBenefits and Perks\nProphecy covers 99% of employee health insurance and 75% for dependents\nWe offer $200 per month towards wellness, gyms, massages, facials, and more!\nCelebrate your birthday and anniversary with a day off!\nFlexible PTO\nProphecy provides employees with a $500 professional development reimbursement every year\nCompany sponsored Long Term Disability and Life Insurance\nFSA/HSA\nAbility to have your fingerprint on an innovative platform\nEnd-to-end ownership of your projects\nAnd more!\nBenefits and perks may vary per country\nOur Commitment to Diversity and Inclusion\nAt Prophecy, we hire for merit and foster an inclusive culture where people from diverse backgrounds can excel and do their best work. We take great care to ensure that our hiring practices are inclusive and meet equal employment opportunity standards. Individuals looking for employment at Prophecy are considered without regard to age, color, disability, ethnicity, family or marital status, gender identity or expression, language, national origin, physical and mental ability, political affiliation, race, religion, sexual orientation, socio-economic status, veteran status, and any other protected characteristics under applicable laws."
  },
  {
    "title": "ML Infrastructure Engineer",
    "company": "Virtue AI",
    "location": "San Francisco, CA",
    "salary": "Full-time",
    "url": "https://www.indeed.com/rc/clk?jk=43909c37e951edac&bb=HW25cW-A9mcHz-0_tn33BCHhugIlvYeBigThb-4Hlq42QAOnWiagHBPvYCU7AB3UCacdxKu5f8_9qiHbwMVWU91SumIIkU67scqCA0P12AcutPuYMp1s52z70UZWaL2y-qz7ZftXdf7uqbo5a8zP5OMZdzK3FdnJ&xkcb=SoDv67M3sYpPSCSMbp0ObzkdCdPP&fccid=dd616958bd9ddc12&vjs=3",
    "description": "About the Company\nVirtue AI is at the forefront of AI security. As enterprises increasingly adopt Large Language Models, the need for robust, trustworthy, and safe AI has never been greater. Our mission is to build the essential guardrails and red-teaming tools that enable organizations to deploy multi-modal AI applications confidently and responsibly. We are a well-funded, early-stage startup founded by industry veterans, and we're looking for passionate builders to join our core team.\nAre you a high-performing, motivated engineer ready to make a significant impact in the AI security space? Virtue AI is seeking talented AI Infrastructure Engineer (MLOps) to join us. We are a fast-paced, customer-focused company with cutting-edge technology, strong early customer traction, and market dominance. If you thrive in an environment that values hard work, collaboration, and technical curiosity, we want to hear from you.\nAbout the Role\nThe future of AI will depend on our ability to keep it safe and responsible. We're seeking an Applied Machine Learning (ML) Engineer to champion our efforts in doing so. You will play a pivotal role in building robust ML systems to address AI safety challenges. You will combine cutting-edge machine learning techniques with strong engineering practices to design and deploy scalable, effective solutions that detect and mitigate risks in AI systems. Working at the intersection of AI and security, you will help shape the future of safe AI applications.\nIn this role, you will:\nDevelop AI Risk Mitigation Systems: Design, build, and deploy scalable ML models and workflows to detect, analyze, and mitigate threats to AI/ML environments\nEnd-to-End ML Workflow Ownership: Implement experimentation pipelines, model evaluation strategies, and deployment mechanisms to productionize AI safety tools\nRed-Teaming and Testing: Facilitate red-teaming exercises to uncover vulnerabilities, validate robustness, and enhance the reliability of AI models\nCollaborate Across Teams: Work closely with researchers, engineers, and security experts to ensure that technical solutions align with product goals and safety objectives\nRequired Qualifications\nBachelor’s or Master’s degree in Computer Science, Machine Learning, or a related field.\n2+ years of experience in applied machine learning or AI engineering roles.\nProficiency in Python and ML frameworks, with a focus on Hugging Face Transformers and PyTorch.\nHands-on experience with fine-tuning pipelines for large language models (e.g., Qwen, LLaMA) and generative image/video models.\nSolid understanding of model architectures, including knowledge of transformer-based models and neural network design.\nExpertise in model inference and deployment frameworks, including optimizing and scaling ML systems in production environments.\nExperience with prompt engineering and developing effective strategies for generative AI systems.\nStrong communication skills and a collaborative mindset, with the ability to work effectively in cross-functional teams.\nPreferred Qualifications:\nExperience with AI/ML safety, security, or adversarial machine learning in text, image, video, or audio domains.\nKnowledge of secure software practices and AI vulnerability testing.\nFamiliarity with tools and frameworks for red-teaming in AI, particularly for generative models."
  },
  {
    "title": "Data Engineer",
    "company": "WES Global LLC",
    "location": "Mountain View, CA 94043 \n(Moffett Boulevard area)",
    "salary": "$40 - $50 an hour",
    "url": "https://www.indeed.com/rc/clk?jk=72145db8419c8226&bb=HW25cW-A9mcHz-0_tn33BFquV1UC1qUt7phT7V_moism1mpRW9BcbilXu_vnKxHhlOgGhCplyh1V_-pCRgzci4MfA7LRffvmhi6ilBNS8Y8cjb2OJ5aV9-qfhKoz_BNLB6Q2nl6YZ3FhjvSdCxn2ncf8VwdU8XFV&xkcb=SoAV67M3sYpPSCSMbp0FbzkdCdPP&fccid=1ee6ed83ce2d2156&cmp=Incoexco&ti=Data+Engineer&vjs=3",
    "description": "Job Summary\nWES Global LLC is seeking a highly skilled and motivated Data Engineer who will have strong hands-on experience with big data technologies, programming languages, API development, and cloud-based solutions. You will play a key role in designing, developing, and maintaining scalable data pipelines and platforms to support analytics, AI/ML, and business operations.\nExperience: 04 -05 years\nSalary: $40 - $50\nContract: 06 months.\nKey Responsibilities\nDesign, build, and optimize scalable data pipelines and ETL processes.\nDevelop APIs and integrate with applications using Java, Python, Scala, Node.js, and GQL.\nWork with big data tools including Hadoop, Hive, Spark (Scala), Presto/Trino, and Data Lakes.\nImplement, schedule, and monitor workflows using Airflow, Luigi, and Automic.\nLeverage stream processing systems such as Storm and Spark Streaming.\nDeploy and manage solutions on Kubernetes and Cloud platforms.\nCollaborate with Data Scientists and Analysts to implement Vertex AI and other AI/ML pipelines.\nEnsure data security, governance, and compliance across systems.\nTroubleshoot and optimize data workflows for performance and scalability.\nRequired Skills & Qualifications\nBachelor’s degree in Computer Science, Engineering, Data Science, or related field (or equivalent experience).\n4–5 years of proven experience in data engineering or big data development.\nStrong programming skills in Java, Python, and Scala.\nHands-on experience with Hadoop ecosystem, Hive, Spark (Scala), and Presto/Trino.\nExperience with Kubernetes, Cloud platforms (AWS, GCP, Azure), and Data Lake concepts.\nWorkflow management expertise with Airflow, Luigi, Automic.\nFamiliarity with Vertex AI and machine learning data pipelines.\nStrong understanding of real-time stream processing systems (Storm, Spark Streaming, etc.).\nExcellent problem-solving and communication skills.\nAbility to work in cross-functional and agile environments.\nJob Type: Contract\nPay: $40.00 - $50.00 per hour\nWork Location: In person"
  },
  {
    "title": "",
    "company": "",
    "location": "",
    "salary": "",
    "url": "https://www.indeed.com/viewjob?jk=789abcdef0123456",
    "description": "None"
  }
]